[
    {
        "id": "aeb3d57b0922e7d4",
        "topic_id": "5533",
        "title": "Haithe - Decentralized Protocol for Verifiable AI",
        "url": "https://forum.ceg.vote/t/haithe-decentralized-protocol-for-verifiable-ai/5533",
        "views": "",
        "comments": "31",
        "created_date": "Jun 12, 2025 8:06 pm",
        "latest_activity": "Aug 4, 2025 12:13 am",
        "content": "Haithe\nA Decentralized Protocol for Verifiable AI.\nThe Problem\nThe core challenge for AI in Web3 isn’t just proving that data hasn’t been tampered with; it’s proving the data’s substance. A cryptographic hash can guarantee a dataset’s integrity, but it cannot verify its origin, quality, or content. A creator could claim their AI is trained on financial data when it was actually trained on irrelevant information, and the hash would still be valid.\nThis “semantic gap” creates a trust vacuum, preventing developers from confidently building high-stakes applications that rely on third-party AI agents.\nThe Solution\nHaithe is a trust protocol that solves this problem by creating a transparent, verifiable ecosystem for AI. We move beyond simple integrity checks to a system of substantive verification, enabled by three key roles: Creators, Consumers, and Auditors.\nInstead of just registering a data hash, creators submit a detailed Claim Manifest about their dataset. Staked domain experts, acting as Auditors, are granted temporary, private access to investigate these claims. Their findings are published in a granular, on-chain Audit Report, allowing consumers to make informed decisions based on expert, independent verification.\nHow It Works: A Three-Part Ecosystem\nHaithe’s workflow ensures checks and balances between all participants, with smart contracts on Hyperion orchestrating the process.\n1. The Creator: Defining the Claims\nBuild & Register: Developers use the Alith framework to build high-performance AI agents and register them on the Haithe marketplace.\nSubmit the Claim Manifest: Alongside the agent, the Creator submits a structured manifest containing specific, falsifiable claims about the training data. For example:\nSource: “API data from Uniswap v3 on Polygon.”\nDate Range: “All swaps from June 1, 2023, to December 31, 2023.”\nContent: “Dataset contains no personally identifiable information (PII).”\nSchema: “Includes columns for token_pair, amount_in, amount_out, and gas_price.”\n2. The Auditor: Investigating the Substance\nStake & Qualify: Domain experts (in finance, NLP, security, etc.) stake tokens to become eligible Auditors.\nAccept the Task: An Auditor accepts an audit request, which can be funded by the Creator or a Consumer.\nInvestigate Claims: The Auditor is granted secure, time-limited, off-chain access to the private dataset. Their role is to meticulously investigate the claims made in the manifest. This requires genuine domain expertise.\nPublish the Audit Report: The Auditor submits a detailed report to IPFS, with its hash recorded on-chain. This report confirms or refutes each claim individually, providing qualitative remarks.\n3. The Consumer: Making Informed Decisions\nDiscover & Filter: Developers browse the Haithe marketplace for AI agents. They can filter for agents based on their audit status.\nReview Reports: Before subscribing, a Consumer can review the detailed Audit Report for any agent. This allows them to assess if the agent’s verified characteristics fit their specific use case.\nIntegrate with Confidence: Armed with expert-verified information, the Consumer can confidently integrate the agent into their dApp, knowing exactly what they are getting.\nKey Features\nOn-Chain Claim Manifests: Creators make specific, verifiable claims about their AI’s data foundation.\nExpert-Led Audits: Audits are performed by staked domain experts, not just automated checkers.\nGranular Audit Reports: Replaces a simple pass/fail with a detailed report that verifies individual claims.\nDecentralized Access Control: A secure mechanism grants auditors temporary, private access to datasets for verification.\nIncentive-Aligned Ecosystem: Creators are rewarded for building great agents, and Auditors are rewarded for providing high-quality, trustworthy verification.\nBuilt for Performance: Powered by the Alith AI framework and the Hyperion blockchain for high throughput and low fees.\nTechnology Stack\nBlockchain: Hyperion\nAI Framework: Alith\nSmart Contracts: Solidity\nDecentralized Storage: IPFS / Arweave for datasets and audit reports\nCommunity & Testing\nHaithe is an ecosystem, and its strength comes from its community. We invite you to participate in our testnet by taking on one of the core roles:\nBecome a Creator: Build a simple agent with Alith, deploy it on our platform, and create a Claim Manifest for it.\nAct as a Consumer: Browse the marketplace, review the claims and audit reports of existing agents, and integrate them into a test application.\nJoin the Auditor Program: If you have domain expertise, apply to our Auditor program to help verify claims and build the foundation of trust for the ecosystem.",
        "comments_details": [
            {
                "author": "jriyyya",
                "comment": "Haithe\nA Decentralized Protocol for Verifiable AI.\nThe Problem\nThe core challenge for AI in Web3 isn’t just proving that data hasn’t been tampered with; it’s proving the data’s substance. A cryptographic hash can guarantee a dataset’s integrity, but it cannot verify its origin, quality, or content. A creator could claim their AI is trained on financial data when it was actually trained on irrelevant information, and the hash would still be valid.\nThis “semantic gap” creates a trust vacuum, preventing developers from confidently building high-stakes applications that rely on third-party AI agents.\nThe Solution\nHaithe is a trust protocol that solves this problem by creating a transparent, verifiable ecosystem for AI. We move beyond simple integrity checks to a system of substantive verification, enabled by three key roles: Creators, Consumers, and Auditors.\nInstead of just registering a data hash, creators submit a detailed Claim Manifest about their dataset. Staked domain experts, acting as Auditors, are granted temporary, private access to investigate these claims. Their findings are published in a granular, on-chain Audit Report, allowing consumers to make informed decisions based on expert, independent verification.\nHow It Works: A Three-Part Ecosystem\nHaithe’s workflow ensures checks and balances between all participants, with smart contracts on Hyperion orchestrating the process.\n1. The Creator: Defining the Claims\nBuild & Register: Developers use the Alith framework to build high-performance AI agents and register them on the Haithe marketplace.\nSubmit the Claim Manifest: Alongside the agent, the Creator submits a structured manifest containing specific, falsifiable claims about the training data. For example:\nSource: “API data from Uniswap v3 on Polygon.”\nDate Range: “All swaps from June 1, 2023, to December 31, 2023.”\nContent: “Dataset contains no personally identifiable information (PII).”\nSchema: “Includes columns for token_pair, amount_in, amount_out, and gas_price.”\n2. The Auditor: Investigating the Substance\nStake & Qualify: Domain experts (in finance, NLP, security, etc.) stake tokens to become eligible Auditors.\nAccept the Task: An Auditor accepts an audit request, which can be funded by the Creator or a Consumer.\nInvestigate Claims: The Auditor is granted secure, time-limited, off-chain access to the private dataset. Their role is to meticulously investigate the claims made in the manifest. This requires genuine domain expertise.\nPublish the Audit Report: The Auditor submits a detailed report to IPFS, with its hash recorded on-chain. This report confirms or refutes each claim individually, providing qualitative remarks.\n3. The Consumer: Making Informed Decisions\nDiscover & Filter: Developers browse the Haithe marketplace for AI agents. They can filter for agents based on their audit status.\nReview Reports: Before subscribing, a Consumer can review the detailed Audit Report for any agent. This allows them to assess if the agent’s verified characteristics fit their specific use case.\nIntegrate with Confidence: Armed with expert-verified information, the Consumer can confidently integrate the agent into their dApp, knowing exactly what they are getting.\nKey Features\nOn-Chain Claim Manifests: Creators make specific, verifiable claims about their AI’s data foundation.\nExpert-Led Audits: Audits are performed by staked domain experts, not just automated checkers.\nGranular Audit Reports: Replaces a simple pass/fail with a detailed report that verifies individual claims.\nDecentralized Access Control: A secure mechanism grants auditors temporary, private access to datasets for verification.\nIncentive-Aligned Ecosystem: Creators are rewarded for building great agents, and Auditors are rewarded for providing high-quality, trustworthy verification.\nBuilt for Performance: Powered by the Alith AI framework and the Hyperion blockchain for high throughput and low fees.\nTechnology Stack\nBlockchain: Hyperion\nAI Framework: Alith\nSmart Contracts: Solidity\nDecentralized Storage: IPFS / Arweave for datasets and audit reports\nCommunity & Testing\nHaithe is an ecosystem, and its strength comes from its community. We invite you to participate in our testnet by taking on one of the core roles:\nBecome a Creator: Build a simple agent with Alith, deploy it on our platform, and create a Claim Manifest for it.\nAct as a Consumer: Browse the marketplace, review the claims and audit reports of existing agents, and integrate them into a test application.\nJoin the Auditor Program: If you have domain expertise, apply to our Auditor program to help verify claims and build the foundation of trust for the ecosystem."
            }
        ]
    },
    {
        "id": "719f0bfd443b3679",
        "topic_id": "8517",
        "title": "Bridge Inflows, Smart Wallets, and dApps: Key Patterns ALPHA Reads Before Alerting",
        "url": "https://forum.ceg.vote/t/bridge-inflows-smart-wallets-and-dapps-key-patterns-alpha-reads-before-alerting/8517",
        "views": "",
        "comments": "0",
        "created_date": "Aug 3, 2025 11:40 pm",
        "latest_activity": null,
        "content": "Bridge Inflows, Smart Wallets, and dApps: Key Patterns ALPHA Reads Before Alerting\nIn Hyperion, one transaction rarely tells the full story. Liquidity migration, governance manipulation, or stealth launches often involve multiple events happening in sequence. Spotting these patterns early can mean the difference between acting first and reacting too late.\nALPHA doesn’t look at isolated wallet transfers or contract deployments. It links related events to detect meaningful patterns, such as:\nBridge inflows + whale activity → possible liquidity migration or yield opportunity\nSmart wallets funding new contracts → early dApp launches worth exploring\nDAO proposals + unusual voting wallets → governance shifts or manipulation\nMost tools flood you with individual updates. ALPHA filters and ranks events only after contextual reasoning, which means you get alerts when patterns show real opportunity or risk.\nPattern recognition is what separates ALPHA from bots. It doesn’t just watch Hyperion, it understands it, letting you act before others catch on.",
        "comments_details": [
            {
                "author": "Alpha_Alith",
                "comment": "Bridge Inflows, Smart Wallets, and dApps: Key Patterns ALPHA Reads Before Alerting\nIn Hyperion, one transaction rarely tells the full story. Liquidity migration, governance manipulation, or stealth launches often involve multiple events happening in sequence. Spotting these patterns early can mean the difference between acting first and reacting too late.\nALPHA doesn’t look at isolated wallet transfers or contract deployments. It links related events to detect meaningful patterns, such as:\nBridge inflows + whale activity → possible liquidity migration or yield opportunity\nSmart wallets funding new contracts → early dApp launches worth exploring\nDAO proposals + unusual voting wallets → governance shifts or manipulation\nMost tools flood you with individual updates. ALPHA filters and ranks events only after contextual reasoning, which means you get alerts when patterns show real opportunity or risk.\nPattern recognition is what separates ALPHA from bots. It doesn’t just watch Hyperion, it understands it, letting you act before others catch on."
            }
        ]
    },
    {
        "id": "19107ea94bbceb14",
        "topic_id": "6128",
        "title": "Fracture Point: Core Development Update – A Deep Dive into Our Web3 Foundation!",
        "url": "https://forum.ceg.vote/t/fracture-point-core-development-update-a-deep-dive-into-our-web3-foundation/6128",
        "views": "",
        "comments": "117",
        "created_date": "Jul 3, 2025 4:43 pm",
        "latest_activity": "Aug 3, 2025 10:25 pm",
        "content": "Live Link: https://prototypelobbyfpoint.netlify.app/\nWe are thrilled to unveil a monumental leap in the development of Fracture Point, our upcoming tactical TPS game. While our interactive lobby prototype provides a glimpse into the player experience, the true revolution lies in the meticulously crafted on-chain smart contracts and the robust Alith Architecture that power our innovative Proof of Play ecosystem.\nThis past month has been dedicated to building the immutable bedrock of Fracture Point’s Web3 capabilities, focusing on decentralized ownership, verifiable progression, and a player-driven economy.\nFracture Point: The Game Skill, Strategy, and True Digital Ownership\nFracture Point is designed as a high-octane, tactical third-person shooter that demands precision, strategic thinking, and teamwork. We are building a fiercely competitive environment where your skill and dedication are not just recognized, but are fundamentally integrated into the game’s core value system.\nPrepare for:\nIntense FPS Combat: Master diverse weapon loadouts and tactical maneuvers in dynamic, high-stakes engagements.\nDeep Customization: Personalize your agents and unique “variants”, making your mark on the battlefield.\nCompetitive Progression: Climb verifiable leaderboards, earn genuine rewards, and truly own your in-game achievements.\nThe Proof of Play Revolution: Rewarding Skill On-Chain\nOur commitment to Proof of Play is the defining feature of Fracture Point. This is not a concept; it’s a core, on-chain mechanism ensuring that your active engagement and skillful performance directly translate into verifiable, immutable value and progression within the game’s ecosystem.\nHow Proof of Play works in Fracture Point, powered by our contracts:\nVerifiable Achievements: Through the GameAchievementRegistry.sol contract (which is part of our ClaimManager system), your significant in-game achievements and progression milestones are immutably recorded on the blockchain. This provides transparent, provable recognition for your dedication and skill.\nSkill-Based Rewards: Our FPToken (FracturePoint Token), serving as XP, is minted to players based on their in-game performance (e.g., in Rift events), authorized exclusively by our trusted Alith Oracle. This ensures that rewards are earned through genuine gameplay.\nOn-Chain Progression & Badges: Your accumulated FPToken (XP) can then be burned via the ClaimManager contract to claim unique Rank Badges (ERC-721 NFTs) from the RankBadge.sol contract, signifying your seasonal achievements and skill tier. This process is entirely on-chain, making your rank verifiable and owned.\nPlayer-Driven Ecosystem: This interconnected system ensures that the game’s economy and value are directly influenced and shaped by the collective activity and skilled contributions of its player base.\nThis ensures Fracture Point rewards genuine skill, time invested, and proven performance, fostering a fair, transparent, and truly player-owned gaming experience.\nOur Core Architecture: Dedicated Smart Contracts and The Alith Framework\nThe true innovation behind Fracture Point lies in its robust, interconnected smart contracts and the strategic implementation of the Alith Architecture.\n1. The Alith Architecture: Our Tailored Blockchain Game Framework\nFracture Point leverages a bespoke implementation of the Alith Architecture. This is our comprehensive, modular framework meticulously designed to seamlessly integrate blockchain technology without compromising gameplay performance. It intelligently separates:\nOn-Chain Components: Our smart contracts (FPToken, RankBadge, ClaimManager) handle critical, immutable data like XP (FPToken) balances, Rank Badge (NFT) ownership, and verifiable achievements. This ensures decentralization, security, and provable ownership. The Alith Oracle acts as the trusted off-chain authority that bridges game outcomes to on-chain actions, such as distributing XP and authorizing badge claims.\nOff-Chain Backend: High-frequency game logic, real-time matchmaking, complex physics calculations, and volatile player statistics run on a performant off-chain backend. This guarantees a smooth, low-latency, and responsive gameplay experience, unburdened by blockchain transaction times and gas costs.\nSecure Interoperability: A robust and auditable communication layer ensures seamless and secure data flow between our contracts (governed by the Alith Oracle) and the off-chain game server.\n2. Fracture Point’s Core Smart Contracts (Audited & Interconnected)\nWe have successfully designed, developed, and prepared for deployment the foundational smart contracts that power Fracture Point’s Web3 economy and the Proof of Play mechanics. These contracts work in concert:\nFPToken.sol (FuturePoint Token) : This ERC-20 token represents XP within the Fracture Point ecosystem. It’s designed specifically for in-game progression:\nMinted by Alith Oracle: Only the designated alithOracle can mint new FPToken to players (e.g., via distributeRiftXP) based on game outcomes.\nBurned by ClaimManager: The ClaimManager contract is uniquely authorized to burn FPToken (XP) from player balances when they claim Rank Badges, creating a clear utility and economic loop.\nNon-Transferable (Player-to-Player): Significantly, direct player-to-player transfers of FPToken are disabled. This ensures FPToken remains a pure XP/progression token, preventing speculative trading and focusing its value on in-game achievement.\nRankBadge.sol (Fracture Point Rank Badge) : This ERC-721 NFT contract represents unique, season-specific Rank Badges that players can earn.\nMinted by ClaimManager: Only the ClaimManager contract is authorized to mint new Rank Badges to players, ensuring badges are earned through the proper Proof of Play mechanism.\nImmutable On-Chain Proof: Each badge is a unique NFT, providing verifiable, immutable proof of a player’s achievement for a given season and rank.\nClaimManager.sol : This is the central orchestrator contract, linking FPToken (XP) to Rank Badges (NFTs) and acting as the bridge to the Alith Oracle.\nManages Badge Claims: Players claim badges via ClaimManager, which then verifies their XP balance, burns the necessary FPToken from their account, and instructs RankBadge.sol to mint the new NFT.\nSeason Management: It tracks the currentSeason, ensuring players can only claim one badge per season.\nKarma Evaluation Requests: It facilitates requests for off-chain “Karma” evaluations by the Alith Oracle, hinting at deeper player behavior analysis.\nAlith Oracle Integration: It designates and relies on the alithOracle for authorizing badge claims and distributing rewards based on verified game data.\nThe code for these foundational contracts and the full Alith Architecture implementation can be reviewed in our public repository: https://github.com/SUPAMAN-dev/fracture-point-hyperhack\nYou can also verify our currently deployed contract addresses on the Hyperion testnet network: https://hyperion-testnet.metisdevops.link/\nFPToken Address: 0x4D23a7A2231624F1486CE0dE07C2fbF002f751B9\nClaimManager Address: 0x1Dab96d049e3ce56D51e6B0b149477927B897FFb\nRankBadge Address: 0xBB84D771f6aef01f00dEE45D9C9dF9C7ef9159e5\n(Note on GHC: While not currently on-chain, the fixed supply GHC currency, managed by multisig, will form the broader economic layer of Fracture Point. Its design ensures seamless future integration with our on-chain systems when the time is right, complementing the FPToken XP system.)\nLobby Prototype: The Player’s Interactive Gateway\nComplementing this powerful blockchain backend, our functional lobby prototype provides the intuitive player-facing interface. It allows players to:\nSeamlessly navigate between game modes, customization options, and personal profiles.\nExperience a polished UI/UX that aligns with Fracture Point’s futuristic theme.\nInteract with the foundational elements for future wallet integration, demonstrating how players will connect their on-chain assets to the game.\nLink to the prototype demo: https://youtu.be/aI_lQ6DcwEI\nEcosystem Interest: Strategic Offer from Plurality Web3\nAs a direct result of our development efforts during this Hyperion Hackathon, Fracture Point attracted partnership interest from leading Web3 infrastructure teams, most notably Plurality Web3, a startup pioneering embedded identity and authentication infrastructure for dApps.\nPlurality offered us a 12-month support package under their Partner Program, which includes:\n1:1 Engineering Support for seamless integration of user authentication and personalized in-game logic.\nFree infrastructure credits to cover authentication, user session tooling, and zkTLS-powered identity gating.\nUX Collaboration to co-design smooth onboarding flows without popups or clunky wallets particularly valuable for our casual-to-core player conversion goals.\nTheir outreach came after they reviewed Fracture Point’s Hyperion-backed Proof of Play system and saw clear potential for adoption in competitive Web3 gaming.\nWe view this offer as both validation of our underlying architecture and a strategic complement to the low-cost, high-throughput infrastructure that Hyperion enables. These ecosystem synergies affirm that Fracture Point is not just a playable demo, but a platform being taken seriously by early infrastructure players.\nWhat’s Next for Fracture Point?\nWith the core blockchain architecture, smart contracts, and the lobby interface firmly established, our immediate next steps are to integrate these powerful systems with the actual game engine to bring the full combat experience to life. This includes:\nBackend Game Logic Development: Building out the sophisticated off-chain systems for real-time matchmaking, secure player data management, and robust anti-cheat measures.\nGame Engine Integration: Connecting the lobby and backend systems to a game engine to render the immersive world and high-fidelity combat of Fracture Point.\nProof of Play Loop Refinement: Fully integrating in-game actions with our GameAchievementRegistry.sol via the Alith Oracle to ensure every skill-based action is verifiable and contributes to player progression and potential future GHC earnings.\nThis is an incredibly exciting time for Fracture Point. We invite you to join our community as we build the next evolution of TPS gaming, truly owned and driven by its players.\nJoin our community and stay updated!\nTelegram\nFracture Point\nYou can view and join @fracturepointlabs right away.\nDiscord\nJoin the Fracture Point Discord Server!\nCheck out the Fracture Point community on Discord – hang out with 2 other members and enjoy free voice and text chat.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!",
        "comments_details": [
            {
                "author": "i_am_supaman_lj",
                "comment": "Live Link: https://prototypelobbyfpoint.netlify.app/\nWe are thrilled to unveil a monumental leap in the development of Fracture Point, our upcoming tactical TPS game. While our interactive lobby prototype provides a glimpse into the player experience, the true revolution lies in the meticulously crafted on-chain smart contracts and the robust Alith Architecture that power our innovative Proof of Play ecosystem.\nThis past month has been dedicated to building the immutable bedrock of Fracture Point’s Web3 capabilities, focusing on decentralized ownership, verifiable progression, and a player-driven economy.\nFracture Point: The Game Skill, Strategy, and True Digital Ownership\nFracture Point is designed as a high-octane, tactical third-person shooter that demands precision, strategic thinking, and teamwork. We are building a fiercely competitive environment where your skill and dedication are not just recognized, but are fundamentally integrated into the game’s core value system.\nPrepare for:\nIntense FPS Combat: Master diverse weapon loadouts and tactical maneuvers in dynamic, high-stakes engagements.\nDeep Customization: Personalize your agents and unique “variants”, making your mark on the battlefield.\nCompetitive Progression: Climb verifiable leaderboards, earn genuine rewards, and truly own your in-game achievements.\nThe Proof of Play Revolution: Rewarding Skill On-Chain\nOur commitment to Proof of Play is the defining feature of Fracture Point. This is not a concept; it’s a core, on-chain mechanism ensuring that your active engagement and skillful performance directly translate into verifiable, immutable value and progression within the game’s ecosystem.\nHow Proof of Play works in Fracture Point, powered by our contracts:\nVerifiable Achievements: Through the GameAchievementRegistry.sol contract (which is part of our ClaimManager system), your significant in-game achievements and progression milestones are immutably recorded on the blockchain. This provides transparent, provable recognition for your dedication and skill.\nSkill-Based Rewards: Our FPToken (FracturePoint Token), serving as XP, is minted to players based on their in-game performance (e.g., in Rift events), authorized exclusively by our trusted Alith Oracle. This ensures that rewards are earned through genuine gameplay.\nOn-Chain Progression & Badges: Your accumulated FPToken (XP) can then be burned via the ClaimManager contract to claim unique Rank Badges (ERC-721 NFTs) from the RankBadge.sol contract, signifying your seasonal achievements and skill tier. This process is entirely on-chain, making your rank verifiable and owned.\nPlayer-Driven Ecosystem: This interconnected system ensures that the game’s economy and value are directly influenced and shaped by the collective activity and skilled contributions of its player base.\nThis ensures Fracture Point rewards genuine skill, time invested, and proven performance, fostering a fair, transparent, and truly player-owned gaming experience.\nOur Core Architecture: Dedicated Smart Contracts and The Alith Framework\nThe true innovation behind Fracture Point lies in its robust, interconnected smart contracts and the strategic implementation of the Alith Architecture.\n1. The Alith Architecture: Our Tailored Blockchain Game Framework\nFracture Point leverages a bespoke implementation of the Alith Architecture. This is our comprehensive, modular framework meticulously designed to seamlessly integrate blockchain technology without compromising gameplay performance. It intelligently separates:\nOn-Chain Components: Our smart contracts (FPToken, RankBadge, ClaimManager) handle critical, immutable data like XP (FPToken) balances, Rank Badge (NFT) ownership, and verifiable achievements. This ensures decentralization, security, and provable ownership. The Alith Oracle acts as the trusted off-chain authority that bridges game outcomes to on-chain actions, such as distributing XP and authorizing badge claims.\nOff-Chain Backend: High-frequency game logic, real-time matchmaking, complex physics calculations, and volatile player statistics run on a performant off-chain backend. This guarantees a smooth, low-latency, and responsive gameplay experience, unburdened by blockchain transaction times and gas costs.\nSecure Interoperability: A robust and auditable communication layer ensures seamless and secure data flow between our contracts (governed by the Alith Oracle) and the off-chain game server.\n2. Fracture Point’s Core Smart Contracts (Audited & Interconnected)\nWe have successfully designed, developed, and prepared for deployment the foundational smart contracts that power Fracture Point’s Web3 economy and the Proof of Play mechanics. These contracts work in concert:\nFPToken.sol (FuturePoint Token) : This ERC-20 token represents XP within the Fracture Point ecosystem. It’s designed specifically for in-game progression:\nMinted by Alith Oracle: Only the designated alithOracle can mint new FPToken to players (e.g., via distributeRiftXP) based on game outcomes.\nBurned by ClaimManager: The ClaimManager contract is uniquely authorized to burn FPToken (XP) from player balances when they claim Rank Badges, creating a clear utility and economic loop.\nNon-Transferable (Player-to-Player): Significantly, direct player-to-player transfers of FPToken are disabled. This ensures FPToken remains a pure XP/progression token, preventing speculative trading and focusing its value on in-game achievement.\nRankBadge.sol (Fracture Point Rank Badge) : This ERC-721 NFT contract represents unique, season-specific Rank Badges that players can earn.\nMinted by ClaimManager: Only the ClaimManager contract is authorized to mint new Rank Badges to players, ensuring badges are earned through the proper Proof of Play mechanism.\nImmutable On-Chain Proof: Each badge is a unique NFT, providing verifiable, immutable proof of a player’s achievement for a given season and rank.\nClaimManager.sol : This is the central orchestrator contract, linking FPToken (XP) to Rank Badges (NFTs) and acting as the bridge to the Alith Oracle.\nManages Badge Claims: Players claim badges via ClaimManager, which then verifies their XP balance, burns the necessary FPToken from their account, and instructs RankBadge.sol to mint the new NFT.\nSeason Management: It tracks the currentSeason, ensuring players can only claim one badge per season.\nKarma Evaluation Requests: It facilitates requests for off-chain “Karma” evaluations by the Alith Oracle, hinting at deeper player behavior analysis.\nAlith Oracle Integration: It designates and relies on the alithOracle for authorizing badge claims and distributing rewards based on verified game data.\nThe code for these foundational contracts and the full Alith Architecture implementation can be reviewed in our public repository: https://github.com/SUPAMAN-dev/fracture-point-hyperhack\nYou can also verify our currently deployed contract addresses on the Hyperion testnet network: https://hyperion-testnet.metisdevops.link/\nFPToken Address: 0x4D23a7A2231624F1486CE0dE07C2fbF002f751B9\nClaimManager Address: 0x1Dab96d049e3ce56D51e6B0b149477927B897FFb\nRankBadge Address: 0xBB84D771f6aef01f00dEE45D9C9dF9C7ef9159e5\n(Note on GHC: While not currently on-chain, the fixed supply GHC currency, managed by multisig, will form the broader economic layer of Fracture Point. Its design ensures seamless future integration with our on-chain systems when the time is right, complementing the FPToken XP system.)\nLobby Prototype: The Player’s Interactive Gateway\nComplementing this powerful blockchain backend, our functional lobby prototype provides the intuitive player-facing interface. It allows players to:\nSeamlessly navigate between game modes, customization options, and personal profiles.\nExperience a polished UI/UX that aligns with Fracture Point’s futuristic theme.\nInteract with the foundational elements for future wallet integration, demonstrating how players will connect their on-chain assets to the game.\nLink to the prototype demo: https://youtu.be/aI_lQ6DcwEI\nEcosystem Interest: Strategic Offer from Plurality Web3\nAs a direct result of our development efforts during this Hyperion Hackathon, Fracture Point attracted partnership interest from leading Web3 infrastructure teams, most notably Plurality Web3, a startup pioneering embedded identity and authentication infrastructure for dApps.\nPlurality offered us a 12-month support package under their Partner Program, which includes:\n1:1 Engineering Support for seamless integration of user authentication and personalized in-game logic.\nFree infrastructure credits to cover authentication, user session tooling, and zkTLS-powered identity gating.\nUX Collaboration to co-design smooth onboarding flows without popups or clunky wallets particularly valuable for our casual-to-core player conversion goals.\nTheir outreach came after they reviewed Fracture Point’s Hyperion-backed Proof of Play system and saw clear potential for adoption in competitive Web3 gaming.\nWe view this offer as both validation of our underlying architecture and a strategic complement to the low-cost, high-throughput infrastructure that Hyperion enables. These ecosystem synergies affirm that Fracture Point is not just a playable demo, but a platform being taken seriously by early infrastructure players.\nWhat’s Next for Fracture Point?\nWith the core blockchain architecture, smart contracts, and the lobby interface firmly established, our immediate next steps are to integrate these powerful systems with the actual game engine to bring the full combat experience to life. This includes:\nBackend Game Logic Development: Building out the sophisticated off-chain systems for real-time matchmaking, secure player data management, and robust anti-cheat measures.\nGame Engine Integration: Connecting the lobby and backend systems to a game engine to render the immersive world and high-fidelity combat of Fracture Point.\nProof of Play Loop Refinement: Fully integrating in-game actions with our GameAchievementRegistry.sol via the Alith Oracle to ensure every skill-based action is verifiable and contributes to player progression and potential future GHC earnings.\nThis is an incredibly exciting time for Fracture Point. We invite you to join our community as we build the next evolution of TPS gaming, truly owned and driven by its players.\nJoin our community and stay updated!\nTelegram\nFracture Point\nYou can view and join @fracturepointlabs right away.\nDiscord\nJoin the Fracture Point Discord Server!\nCheck out the Fracture Point community on Discord – hang out with 2 other members and enjoy free voice and text chat.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!"
            }
        ]
    },
    {
        "id": "ce062c93d90a22e9",
        "topic_id": "5925",
        "title": "Safe Work Pay",
        "url": "https://forum.ceg.vote/t/safe-work-pay/5925",
        "views": "",
        "comments": "20",
        "created_date": "Jun 23, 2025 7:06 pm",
        "latest_activity": "Aug 3, 2025 9:12 pm",
        "content": "Live Link: https://safe-work-pay-hyper.vercel.app/\nProject Name\nSafeWorkPay\nProblem Statement\nFreelancing platforms often face payment disputes and trust issues.\nClients may withhold funds even when work is completed.\nDevelopers may fail to deliver after receiving payment.\nThese issues discourage honest participation and reduce efficiency.\nThere’s a need for a secure, transparent, and fair system to build trust between clients and freelancers.\nSolution Overview\nSafeWorkPay is a decentralized freelancing platform powered by blockchain and DAO governance.\nClients deposit funds into a smart contract, which holds the money in escrow.\nFunds are released only when milestones or full projects are completed and verified.\nIn case of disputes, a DAO (Decentralized Autonomous Organization) reviews the work and decides on a fair resolution.\nThe DAO can release funds proportionally based on project completion (e.g., 50% work = 50% payment).\nCombines the strengths of blockchain’s trustless escrow and community-driven governance, unlike traditional platforms like Upwork or basic blockchain-based platforms like Ethlance.\nProject Description\nClients can post projects and deposit funds into smart contracts.\nDevelopers bid on projects and submit milestones as they complete work.\nThe DAO votes on project completion status in case of disputes.\nSmart contracts release payments when milestones are verified.\nFeatures include:\nMilestone-based payments\nDAO-powered dispute resolution\nBlockchain-based reputation system\nNative token (SWP Token) for payments and governance\nEthereum Layer 2 ensures scalability and low fees.\nA simple web interface allows users to post jobs, bid, chat, and track progress.\nThe MVP will include:\nA basic web UI\nA smart contract escrow system\nA demo DAO voting interface to simulate dispute resolution.\nCommunity Engagement Features\nTestable Features/Tasks\nProject Posting & Bidding:\nClients post test projects.\nDevelopers submit bids.\nMilestone Submission & DAO Simulation:\nDevelopers upload sample code for a milestone.\nDAO members simulate voting to approve or reject the milestone.\nFeedback Submission:\nUsers give feedback on the platform’s design or DAO decisions.\nPoints System\nPost a project: +50 points\nSubmit a bid: +30 points\nComplete a milestone (DAO verified): +100 points\nProvide feedback: +20 points\nPoints are stored on a blockchain ledger and redeemable for:\nSWP Tokens\nPlatform benefits like reduced fees\nGamification\nUsers are rewarded for participation through points and tokens.\nA leaderboard displays top testers and contributors.\nThe system encourages interaction and trust-building while testing.\nGetting Involved\nTest the MVP:\nSign up on safeworkpay.com (or testnet)\nPost projects, bid, and give feedback during the hackathon\nContribute Code:\nDevelopers can help improve the smart contracts and frontend UI\nGitHub repo link will be shared post-hackathon\nJoin the Community:\nParticipate in discussions on Discord or Telegram\nStay updated and propose new features\nProvide Expertise:\nBlockchain/DAO professionals can guide governance and voting logic\nContact the team via the community forum\nLet me know if you want a one-pager version or presentation slides too.",
        "comments_details": [
            {
                "author": "rahul_iiitv",
                "comment": "Live Link: https://safe-work-pay-hyper.vercel.app/\nProject Name\nSafeWorkPay\nProblem Statement\nFreelancing platforms often face payment disputes and trust issues.\nClients may withhold funds even when work is completed.\nDevelopers may fail to deliver after receiving payment.\nThese issues discourage honest participation and reduce efficiency.\nThere’s a need for a secure, transparent, and fair system to build trust between clients and freelancers.\nSolution Overview\nSafeWorkPay is a decentralized freelancing platform powered by blockchain and DAO governance.\nClients deposit funds into a smart contract, which holds the money in escrow.\nFunds are released only when milestones or full projects are completed and verified.\nIn case of disputes, a DAO (Decentralized Autonomous Organization) reviews the work and decides on a fair resolution.\nThe DAO can release funds proportionally based on project completion (e.g., 50% work = 50% payment).\nCombines the strengths of blockchain’s trustless escrow and community-driven governance, unlike traditional platforms like Upwork or basic blockchain-based platforms like Ethlance.\nProject Description\nClients can post projects and deposit funds into smart contracts.\nDevelopers bid on projects and submit milestones as they complete work.\nThe DAO votes on project completion status in case of disputes.\nSmart contracts release payments when milestones are verified.\nFeatures include:\nMilestone-based payments\nDAO-powered dispute resolution\nBlockchain-based reputation system\nNative token (SWP Token) for payments and governance\nEthereum Layer 2 ensures scalability and low fees.\nA simple web interface allows users to post jobs, bid, chat, and track progress.\nThe MVP will include:\nA basic web UI\nA smart contract escrow system\nA demo DAO voting interface to simulate dispute resolution.\nCommunity Engagement Features\nTestable Features/Tasks\nProject Posting & Bidding:\nClients post test projects.\nDevelopers submit bids.\nMilestone Submission & DAO Simulation:\nDevelopers upload sample code for a milestone.\nDAO members simulate voting to approve or reject the milestone.\nFeedback Submission:\nUsers give feedback on the platform’s design or DAO decisions.\nPoints System\nPost a project: +50 points\nSubmit a bid: +30 points\nComplete a milestone (DAO verified): +100 points\nProvide feedback: +20 points\nPoints are stored on a blockchain ledger and redeemable for:\nSWP Tokens\nPlatform benefits like reduced fees\nGamification\nUsers are rewarded for participation through points and tokens.\nA leaderboard displays top testers and contributors.\nThe system encourages interaction and trust-building while testing.\nGetting Involved\nTest the MVP:\nSign up on safeworkpay.com (or testnet)\nPost projects, bid, and give feedback during the hackathon\nContribute Code:\nDevelopers can help improve the smart contracts and frontend UI\nGitHub repo link will be shared post-hackathon\nJoin the Community:\nParticipate in discussions on Discord or Telegram\nStay updated and propose new features\nProvide Expertise:\nBlockchain/DAO professionals can guide governance and voting logic\nContact the team via the community forum\nLet me know if you want a one-pager version or presentation slides too."
            }
        ]
    },
    {
        "id": "ceb4394b22da79f3",
        "topic_id": "6405",
        "title": "How to submit our project?",
        "url": "https://forum.ceg.vote/t/how-to-submit-our-project/6405",
        "views": "",
        "comments": "11",
        "created_date": "Jul 17, 2025 4:27 am",
        "latest_activity": "Aug 3, 2025 7:47 pm",
        "content": "How to submit our project for Hyperion Hackathon? What are key dates?\nThanks",
        "comments_details": [
            {
                "author": "ashqking",
                "comment": "How to submit our project for Hyperion Hackathon? What are key dates?\nThanks"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "You only need to make a final publish with all the details your project has achieved. All this is done on the ideation forum and fill the form for live testing and your project will be updated as live for other users to stress-test. I will provide more details in a bit."
            }
        ]
    },
    {
        "id": "2c152acc5e844c78",
        "topic_id": "4420",
        "title": "EduVerse: AI-Powered Personalized Education Platform",
        "url": "https://forum.ceg.vote/t/eduverse-ai-powered-personalized-education-platform/4420",
        "views": "",
        "comments": "116",
        "created_date": "May 20, 2025 5:45 pm",
        "latest_activity": "Aug 3, 2025 7:26 pm",
        "content": "Live Link: https://eduverse-ecru.vercel.app/\nProblem Statement\nStandardized education overlooks individual learning styles and paces, leading to disengagement and hindering student potential. Students and educators face the challenge of a rigid system that doesn’t adapt to diverse needs, impacting learning outcomes.\nSolution Overview\nOur AI-Powered Personalized Education Platform offers a dynamic solution by employing a multi-agent system built on the Alith Agentic Framework. Specialized AI agents collaboratively analyze individual learning styles, curate tailored content, provide adaptive tutoring, and track progress in real time. This creates a uniquely personalized learning journey that adjusts to each student’s needs and pace. By integrating diverse educational resources, the platform aims to enhance engagement, improve learning outcomes, and empower both students and educators.\nProject Description\nThis platform is designed to benefit a wide range of users across the educational landscape. Students of all ages, from kindergarten through higher education, can experience a more engaging and effective learning journey tailored to their specific needs. Educators can utilize the platform to enhance their teaching capabilities, gain deeper insights into student progress, and free up time for more individualized support.\nOn-Chain Components: A First-Class Implementation and Core Requirement for Blockchain Deployment\nOur AI-powered personalized education platform is not merely “blockchain-enhanced” — its core functionality and unique value proposition depend fundamentally on blockchain deployment via Hyperion. The decentralized, trustless, and immutable nature of blockchain—particularly Hyperion’s AI-optimized environment—is essential to realizing our vision.\nVerifiable and Immutable Learning Profiles (On-Chain Data Storage)\nWhat’s On-Chain:\nStudent learning profiles—containing hashed learning milestones, verified skills, and personalized path progress—are recorded on Hyperion’s MetisDB. Each profile includes:\nA unique student identifier\nImmutable logs of achievements\nReferences to off-chain AI agent interactions and curated learning content\nWhy It Needs Blockchain:\nTrustless Verification:\nCentralized educational records are prone to tampering and lack transparency. On-chain profiles offer tamper-proof, auditable records of a learner’s journey—verifiable by students, employers, and academic institutions alike.\nData Sovereignty:\nStudents retain full control of their learning data. On-chain metadata ensures ownership and transparency, unlike siloed centralized platforms.\nFoundation for AI Credentialing:\nImmutable learning progress forms the backbone for future AI-driven credentialing systems. AI-generated content, assessments, and learning paths can be reliably tied to a verifiable blockchain record.\nDecentralized Agent Coordination and Trust (Smart Contract Architecture)\nWhat’s On-Chain:\nAgent Registry & Capabilities:\nAll core agents (e.g., Learning Style Analyst, Content Curator, Personalized Tutor) are registered via smart contracts, with:\nUnique IDs\nDefined roles and permissions\nClear scope of data access and processing\nService Agreements & Orchestration Logic:\nSmart contracts manage agent workflows. For example:\nCompletion of a module may trigger the Progress Tracker\nUpon validation, the Personalized Tutor recommends next steps\nIncentive Mechanisms:\nToken-based rewards for learning milestones, community engagement, and future decentralized agent marketplaces.\nWhy It Needs Blockchain:\nTrustless Agent Interaction:\nIn a multi-agent system, blockchain ensures agent behaviors and interactions are transparent, verifiable, and not reliant on a centralized authority.\nGuaranteed Execution:\nSmart contracts enforce the deterministic execution of workflows, ensuring learning paths adapt in real time based on defined rules.\nImmutable Rules:\nEducational logic, access rights, and reward systems are hard-coded and transparent, fostering trust and accountability.\nAI Enablement via the Alith Agentic Framework\nWhat is Alith:\nAlith is a modular, multi-agent framework designed to power personalized learning by simulating human-like reasoning, memory, and collaboration among AI agents. It forms the intelligence layer of our platform, with deep interoperability with blockchain systems like Hyperion.\nKey Features of Alith:\nAgent Management:\nModular deployment of specialized AI agents:\nLearning Style Analyst\nContent Curator\nPersonalized Tutor\nProgress Tracker\nCollaboration Facilitator\nPersistent Memory:\nAgents maintain long-term memory and context across sessions, enhancing personalization.\nInter-Agent Communication:\nSecure and structured communication between agents, enabling dynamic, cooperative behavior.\nToolchain Access:\nSeamless access to external APIs, knowledge bases, and assessments.\nBlockchain Integration with Alith:\nOn-Chain Agent Registry:\nAll Alith agents are registered on-chain, with roles and capabilities enforced via smart contracts.\nCoordinated Workflow Execution:\nAlith agent interactions are triggered and validated by smart contracts, enabling a trustless education logic layer.\nToken-Driven Incentives:\nAgents’ performance and student outcomes can be linked to on-chain reward systems to drive engagement and adaptive learning.\nPlanned Enhancements for Alith\nTo further improve the personalization, decentralization, and performance of the Alith framework, we are planning several critical upgrades:\n1. Decentralized Agent Marketplace\nAllow community developers to contribute new agents (e.g., specialized tutors or regional content curators)\nAgents will be published and authenticated on-chain with verifiable capabilities\nToken-based reputation and staking mechanisms will prevent misuse or malicious behavior\n2. Agent Fine-Tuning via Federated Learning\nSupport for secure, privacy-preserving personalization of agent behavior based on user feedback\nFine-tuning AI agents locally or within federated clusters, without compromising sensitive student data\n3. ZK-Verifiable Inference\nIntegrate zkML (zero-knowledge machine learning) to enable cryptographic verification of off-chain AI outputs\nThis allows validators and institutions to confirm an agent’s decision (e.g., a test score) without exposing the underlying model or input\n4. Composable Agent Workflows\nEnable developers and educators to compose reusable learning workflows by chaining agents together via simple declarative schemas\nBacked by on-chain validation to ensure logical and pedagogical soundness\n5. Multilingual & Accessibility Agents\nCreate plug-and-play AI agents specialized in localization, translation, and neurodiverse learning strategies\nThese agents will leverage both on-chain registries and external toolchains for broader inclusion\nSecure, Real-Time AI Inference (Leveraging Hyperion’s AI-Native Infrastructure)\nWhat’s On-Chain (or Hyperion-enabled):\nWhile most heavy AI workloads (e.g., model training, long-form inference) run off-chain via the Alith framework, Hyperion enables:\nLightweight on-chain AI inferences for rapid adaptation and scoring\nSmart contract–verified AI outputs to ensure compliance with educational standards\nReal-time coordination between on-chain logic and off-chain AI services\nWhy It Needs Blockchain:\nVerifiable AI Outputs:\nAI-driven assessments and tutor recommendations can be validated on-chain, ensuring educational integrity and transparency—unlike opaque, centralized AI systems.\nLow Latency, High Throughput:\nHyperion’s parallel execution environment supports responsive, adaptive AI interactions critical to keeping learners engaged.\nScalable AI Coordination:\nIntegrating real-time AI decision-making into a decentralized, tamper-proof environment offers performance benefits without compromising trust or cost-efficiency.\nConclusion: Blockchain as the Foundation, Not a Feature\nDeploying on Hyperion transforms the platform from an advanced AI education app into a decentralized, verifiable, trust-minimized learning ecosystem. The blockchain is not an add-on — it is the bedrock of:\nTrust in student progress\nTransparency in agent interaction\nRobust, real-time AI performance\nData Sovereignty, Incentives, and Trust in Our Education Platform\nOur AI-Powered Personalized Education Platform leverages Hyperion’s blockchain to give students true control over their learning data and foster a trusted educational environment.\nData Sovereignty\nWe achieve data sovereignty by giving students self-sovereign identities (SSIs) on Hyperion. Critical learning milestones and verified skills are recorded as immutable hashes on-chain (MetisDB), tied to the student’s SSI. While detailed content stays off-chain, access is cryptographically linked to and controlled by the student. This means students decide who sees what data, creating a tamper-proof and verifiable record that’s genuinely theirs, free from central control.\nToken Incentives\nWe use a utility token, LearnPoints ($LP), to drive engagement:\nLearn-to-Earn (L2E): Students earn $LP for completing modules, mastering skills, and consistent engagement.\nContribution Rewards: Educators and community members earn $LP for creating content, providing feedback, or participating in forums.\nStaking & Governance: $LP can be staked for premium features or used to vote on platform decisions, aligning community interests.\nThese tokens incentivize participation, build a strong community, and add tangible value to learning achievements.\nImportance of Trust and Transparency\nIn education, trust and transparency are paramount:\nLearner Trust: Students need to trust that their achievements are real and that AI decisions (like tutoring paths) are fair and unbiased. On-chain verifiable credentials and transparent AI orchestration build this crucial trust.\nEmpowering Educators: Transparent data provides educators with reliable insights into student progress and curriculum effectiveness, reducing administrative burdens and fostering accountability.\nEquity & Accessibility: Blockchain prevents fraud and offers a universal, trusted way for students to showcase skills, democratizing opportunities regardless of background. Auditable AI decisions also help mitigate bias.\nSummary\nDeploying on Hyperion transforms our platform into a decentralized, verifiable, and trust-minimized educational ecosystem. Blockchain is the bedrock enabling trust in student progress, transparency in AI agent interactions, and robust real-time AI capabilities that define our personalized learning experience.\nCommunity Engagement Features\nPeer Study Groups: Connect with others for collaborative discussions and support.\nQ&A Forums: Ask and answer subject-related questions to deepen understanding.\nSimulated Collaboration: Practice teamwork in virtual, project-based learning scenarios.\nOptional Mentorship: Receive guidance from experienced peers and educators.\nProgress Sharing (Privacy-Controlled): Share milestones to motivate peers while maintaining control over visibility.\nCommunity Challenges: Participate in gamified group activities to promote engagement and friendly competition.\nTeam Members\n@amardeep\n@priyankg3",
        "comments_details": [
            {
                "author": "amardeep",
                "comment": "Live Link: https://eduverse-ecru.vercel.app/\nProblem Statement\nStandardized education overlooks individual learning styles and paces, leading to disengagement and hindering student potential. Students and educators face the challenge of a rigid system that doesn’t adapt to diverse needs, impacting learning outcomes.\nSolution Overview\nOur AI-Powered Personalized Education Platform offers a dynamic solution by employing a multi-agent system built on the Alith Agentic Framework. Specialized AI agents collaboratively analyze individual learning styles, curate tailored content, provide adaptive tutoring, and track progress in real time. This creates a uniquely personalized learning journey that adjusts to each student’s needs and pace. By integrating diverse educational resources, the platform aims to enhance engagement, improve learning outcomes, and empower both students and educators.\nProject Description\nThis platform is designed to benefit a wide range of users across the educational landscape. Students of all ages, from kindergarten through higher education, can experience a more engaging and effective learning journey tailored to their specific needs. Educators can utilize the platform to enhance their teaching capabilities, gain deeper insights into student progress, and free up time for more individualized support.\nOn-Chain Components: A First-Class Implementation and Core Requirement for Blockchain Deployment\nOur AI-powered personalized education platform is not merely “blockchain-enhanced” — its core functionality and unique value proposition depend fundamentally on blockchain deployment via Hyperion. The decentralized, trustless, and immutable nature of blockchain—particularly Hyperion’s AI-optimized environment—is essential to realizing our vision.\nVerifiable and Immutable Learning Profiles (On-Chain Data Storage)\nWhat’s On-Chain:\nStudent learning profiles—containing hashed learning milestones, verified skills, and personalized path progress—are recorded on Hyperion’s MetisDB. Each profile includes:\nA unique student identifier\nImmutable logs of achievements\nReferences to off-chain AI agent interactions and curated learning content\nWhy It Needs Blockchain:\nTrustless Verification:\nCentralized educational records are prone to tampering and lack transparency. On-chain profiles offer tamper-proof, auditable records of a learner’s journey—verifiable by students, employers, and academic institutions alike.\nData Sovereignty:\nStudents retain full control of their learning data. On-chain metadata ensures ownership and transparency, unlike siloed centralized platforms.\nFoundation for AI Credentialing:\nImmutable learning progress forms the backbone for future AI-driven credentialing systems. AI-generated content, assessments, and learning paths can be reliably tied to a verifiable blockchain record.\nDecentralized Agent Coordination and Trust (Smart Contract Architecture)\nWhat’s On-Chain:\nAgent Registry & Capabilities:\nAll core agents (e.g., Learning Style Analyst, Content Curator, Personalized Tutor) are registered via smart contracts, with:\nUnique IDs\nDefined roles and permissions\nClear scope of data access and processing\nService Agreements & Orchestration Logic:\nSmart contracts manage agent workflows. For example:\nCompletion of a module may trigger the Progress Tracker\nUpon validation, the Personalized Tutor recommends next steps\nIncentive Mechanisms:\nToken-based rewards for learning milestones, community engagement, and future decentralized agent marketplaces.\nWhy It Needs Blockchain:\nTrustless Agent Interaction:\nIn a multi-agent system, blockchain ensures agent behaviors and interactions are transparent, verifiable, and not reliant on a centralized authority.\nGuaranteed Execution:\nSmart contracts enforce the deterministic execution of workflows, ensuring learning paths adapt in real time based on defined rules.\nImmutable Rules:\nEducational logic, access rights, and reward systems are hard-coded and transparent, fostering trust and accountability.\nAI Enablement via the Alith Agentic Framework\nWhat is Alith:\nAlith is a modular, multi-agent framework designed to power personalized learning by simulating human-like reasoning, memory, and collaboration among AI agents. It forms the intelligence layer of our platform, with deep interoperability with blockchain systems like Hyperion.\nKey Features of Alith:\nAgent Management:\nModular deployment of specialized AI agents:\nLearning Style Analyst\nContent Curator\nPersonalized Tutor\nProgress Tracker\nCollaboration Facilitator\nPersistent Memory:\nAgents maintain long-term memory and context across sessions, enhancing personalization.\nInter-Agent Communication:\nSecure and structured communication between agents, enabling dynamic, cooperative behavior.\nToolchain Access:\nSeamless access to external APIs, knowledge bases, and assessments.\nBlockchain Integration with Alith:\nOn-Chain Agent Registry:\nAll Alith agents are registered on-chain, with roles and capabilities enforced via smart contracts.\nCoordinated Workflow Execution:\nAlith agent interactions are triggered and validated by smart contracts, enabling a trustless education logic layer.\nToken-Driven Incentives:\nAgents’ performance and student outcomes can be linked to on-chain reward systems to drive engagement and adaptive learning.\nPlanned Enhancements for Alith\nTo further improve the personalization, decentralization, and performance of the Alith framework, we are planning several critical upgrades:\n1. Decentralized Agent Marketplace\nAllow community developers to contribute new agents (e.g., specialized tutors or regional content curators)\nAgents will be published and authenticated on-chain with verifiable capabilities\nToken-based reputation and staking mechanisms will prevent misuse or malicious behavior\n2. Agent Fine-Tuning via Federated Learning\nSupport for secure, privacy-preserving personalization of agent behavior based on user feedback\nFine-tuning AI agents locally or within federated clusters, without compromising sensitive student data\n3. ZK-Verifiable Inference\nIntegrate zkML (zero-knowledge machine learning) to enable cryptographic verification of off-chain AI outputs\nThis allows validators and institutions to confirm an agent’s decision (e.g., a test score) without exposing the underlying model or input\n4. Composable Agent Workflows\nEnable developers and educators to compose reusable learning workflows by chaining agents together via simple declarative schemas\nBacked by on-chain validation to ensure logical and pedagogical soundness\n5. Multilingual & Accessibility Agents\nCreate plug-and-play AI agents specialized in localization, translation, and neurodiverse learning strategies\nThese agents will leverage both on-chain registries and external toolchains for broader inclusion\nSecure, Real-Time AI Inference (Leveraging Hyperion’s AI-Native Infrastructure)\nWhat’s On-Chain (or Hyperion-enabled):\nWhile most heavy AI workloads (e.g., model training, long-form inference) run off-chain via the Alith framework, Hyperion enables:\nLightweight on-chain AI inferences for rapid adaptation and scoring\nSmart contract–verified AI outputs to ensure compliance with educational standards\nReal-time coordination between on-chain logic and off-chain AI services\nWhy It Needs Blockchain:\nVerifiable AI Outputs:\nAI-driven assessments and tutor recommendations can be validated on-chain, ensuring educational integrity and transparency—unlike opaque, centralized AI systems.\nLow Latency, High Throughput:\nHyperion’s parallel execution environment supports responsive, adaptive AI interactions critical to keeping learners engaged.\nScalable AI Coordination:\nIntegrating real-time AI decision-making into a decentralized, tamper-proof environment offers performance benefits without compromising trust or cost-efficiency.\nConclusion: Blockchain as the Foundation, Not a Feature\nDeploying on Hyperion transforms the platform from an advanced AI education app into a decentralized, verifiable, trust-minimized learning ecosystem. The blockchain is not an add-on — it is the bedrock of:\nTrust in student progress\nTransparency in agent interaction\nRobust, real-time AI performance\nData Sovereignty, Incentives, and Trust in Our Education Platform\nOur AI-Powered Personalized Education Platform leverages Hyperion’s blockchain to give students true control over their learning data and foster a trusted educational environment.\nData Sovereignty\nWe achieve data sovereignty by giving students self-sovereign identities (SSIs) on Hyperion. Critical learning milestones and verified skills are recorded as immutable hashes on-chain (MetisDB), tied to the student’s SSI. While detailed content stays off-chain, access is cryptographically linked to and controlled by the student. This means students decide who sees what data, creating a tamper-proof and verifiable record that’s genuinely theirs, free from central control.\nToken Incentives\nWe use a utility token, LearnPoints ($LP), to drive engagement:\nLearn-to-Earn (L2E): Students earn $LP for completing modules, mastering skills, and consistent engagement.\nContribution Rewards: Educators and community members earn $LP for creating content, providing feedback, or participating in forums.\nStaking & Governance: $LP can be staked for premium features or used to vote on platform decisions, aligning community interests.\nThese tokens incentivize participation, build a strong community, and add tangible value to learning achievements.\nImportance of Trust and Transparency\nIn education, trust and transparency are paramount:\nLearner Trust: Students need to trust that their achievements are real and that AI decisions (like tutoring paths) are fair and unbiased. On-chain verifiable credentials and transparent AI orchestration build this crucial trust.\nEmpowering Educators: Transparent data provides educators with reliable insights into student progress and curriculum effectiveness, reducing administrative burdens and fostering accountability.\nEquity & Accessibility: Blockchain prevents fraud and offers a universal, trusted way for students to showcase skills, democratizing opportunities regardless of background. Auditable AI decisions also help mitigate bias.\nSummary\nDeploying on Hyperion transforms our platform into a decentralized, verifiable, and trust-minimized educational ecosystem. Blockchain is the bedrock enabling trust in student progress, transparency in AI agent interactions, and robust real-time AI capabilities that define our personalized learning experience.\nCommunity Engagement Features\nPeer Study Groups: Connect with others for collaborative discussions and support.\nQ&A Forums: Ask and answer subject-related questions to deepen understanding.\nSimulated Collaboration: Practice teamwork in virtual, project-based learning scenarios.\nOptional Mentorship: Receive guidance from experienced peers and educators.\nProgress Sharing (Privacy-Controlled): Share milestones to motivate peers while maintaining control over visibility.\nCommunity Challenges: Participate in gamified group activities to promote engagement and friendly competition.\nTeam Members\n@amardeep\n@priyankg3"
            }
        ]
    },
    {
        "id": "2220dec7e5c44bb3",
        "topic_id": "6370",
        "title": "Vibesflow",
        "url": "https://forum.ceg.vote/t/vibesflow/6370",
        "views": "",
        "comments": "6",
        "created_date": "Jul 15, 2025 4:17 pm",
        "latest_activity": "Aug 3, 2025 6:36 pm",
        "content": "Live Link: https://vibesflow.ai\nProject Name\nVibesflow AI\nProblem Statement\nNo existing solution (AI or otherwise) for real-time music-generaration based on motion. Only text-based, and not in real-time\nSolution Overview\nAn economically incentivized, mobile app to generate music based on user’s motion.\nVibesFlow is the first app that lets you create music through your motion - be autonomous, create your own rhythm.\nProject Description\nA motion (expo-sensors inputs) to music generation mobile-native app. Music is produced continuously, and it adapts in real time to user’s movements.\nThere is a “group” mode as well - for private parties and/or event organizers to let others in the vicinity to connect to their streams.\nIt introduces a new financial asset as well, which I call RTA: Real-time Asset: an RWA-like asset which acquires value in real-time.\nThree main contracts:\nRTA\nstream (for continuous payments during group-mode)\nroyalties (which distributes monthly-subscriptions revenues based on how many times a “chunk” - 60-sec .wav extracted during the music stream and uploaded to Filecoin - is played respect to the total plays. It’s a fairer model, which allows co-ownership - potentially, in a dj set of 60 minutes (with 60 individual chunkIDs) there could be 60 different shareholders - and favors section-plays over song-plays, trackable through queries and verifiable through Filecoin PDP provenance to drastically reduce manipulation).\nCommunity Engagement Features\nGroup mode, create & share, marketplace\nGetting Involved\nHelp with frontend integration ; spreading the word ; use and enjoy the app",
        "comments_details": [
            {
                "author": "Jabyl",
                "comment": "Live Link: https://vibesflow.ai\nProject Name\nVibesflow AI\nProblem Statement\nNo existing solution (AI or otherwise) for real-time music-generaration based on motion. Only text-based, and not in real-time\nSolution Overview\nAn economically incentivized, mobile app to generate music based on user’s motion.\nVibesFlow is the first app that lets you create music through your motion - be autonomous, create your own rhythm.\nProject Description\nA motion (expo-sensors inputs) to music generation mobile-native app. Music is produced continuously, and it adapts in real time to user’s movements.\nThere is a “group” mode as well - for private parties and/or event organizers to let others in the vicinity to connect to their streams.\nIt introduces a new financial asset as well, which I call RTA: Real-time Asset: an RWA-like asset which acquires value in real-time.\nThree main contracts:\nRTA\nstream (for continuous payments during group-mode)\nroyalties (which distributes monthly-subscriptions revenues based on how many times a “chunk” - 60-sec .wav extracted during the music stream and uploaded to Filecoin - is played respect to the total plays. It’s a fairer model, which allows co-ownership - potentially, in a dj set of 60 minutes (with 60 individual chunkIDs) there could be 60 different shareholders - and favors section-plays over song-plays, trackable through queries and verifiable through Filecoin PDP provenance to drastically reduce manipulation).\nCommunity Engagement Features\nGroup mode, create & share, marketplace\nGetting Involved\nHelp with frontend integration ; spreading the word ; use and enjoy the app"
            }
        ]
    },
    {
        "id": "0030693fd3832cdc",
        "topic_id": "6562",
        "title": "**Spotlight KPI Milestone Incoming!**",
        "url": "https://forum.ceg.vote/t/spotlight-kpi-milestone-incoming/6562",
        "views": "",
        "comments": "9",
        "created_date": "Jul 20, 2025 4:17 pm",
        "latest_activity": "Aug 3, 2025 5:56 pm",
        "content": "We’re thrilled to share that Festify has successfully onboarded 90+ members to the Metis Hyperion Forum, and we’re just a few steps away from hitting 100+, our first KPI goal in the Metis Spotlight Campaign!\nThis milestone isn’t just a number, it’s a growing community of people joining the movement to make on-chain celebrations more fun, meaningful, and rewarding through AI-powered NFT greetings.\nHuge thanks to the amazing Metis community for the support, and to everyone who’s joined us so far.\nLet’s keep building, minting, and making memories — together.\nshare with friends to join us pls: Metis iDAO Forum",
        "comments_details": [
            {
                "author": "arbilearn",
                "comment": "We’re thrilled to share that Festify has successfully onboarded 90+ members to the Metis Hyperion Forum, and we’re just a few steps away from hitting 100+, our first KPI goal in the Metis Spotlight Campaign!\nThis milestone isn’t just a number, it’s a growing community of people joining the movement to make on-chain celebrations more fun, meaningful, and rewarding through AI-powered NFT greetings.\nHuge thanks to the amazing Metis community for the support, and to everyone who’s joined us so far.\nLet’s keep building, minting, and making memories — together.\nshare with friends to join us pls: Metis iDAO Forum"
            },
            {
                "author": "Union_5G",
                "comment": "That’s wonderful, you should have unlocked the badge for the campaign.\nWhat tactic brought about this break through?"
            }
        ]
    },
    {
        "id": "6bdc57b61b734956",
        "topic_id": "6580",
        "title": "## 🎙️ FESTIFY Twitter Space Recap – 1,000+ Tuned In!",
        "url": "https://forum.ceg.vote/t/festify-twitter-space-recap-1-000-tuned-in/6580",
        "views": "",
        "comments": "7",
        "created_date": "Jul 21, 2025 9:55 am",
        "latest_activity": "Aug 3, 2025 5:32 pm",
        "content": "Hey Hyperion community!\nAs part of the ongoing 2-week Spotlight Campaign, we hosted our first-ever FESTIFY Twitter Space — and the response blew us away!\nOver 1,000+ people tuned in live to hear about how we’re bringing celebrations onchain.\nWe shared our vision for Web3-native greetings, how FESTIFY turns special moments into NFTs, and why joy should be permanent on the blockchain.\nMissed it?\nCatch the recap here:\nhttps://x.com/mrcool_web3/status/1947009923163766841\nTry Festify today!\nMint your own onchain greeting card in seconds:\nFestify - AI-Powered Festival Greetings NFTs\nStay connected:\nFollow us on X → @festify_ai\nWe’re just getting started — more updates coming as the Spotlight Campaign continues!",
        "comments_details": [
            {
                "author": "arbilearn",
                "comment": "Hey Hyperion community!\nAs part of the ongoing 2-week Spotlight Campaign, we hosted our first-ever FESTIFY Twitter Space — and the response blew us away!\nOver 1,000+ people tuned in live to hear about how we’re bringing celebrations onchain.\nWe shared our vision for Web3-native greetings, how FESTIFY turns special moments into NFTs, and why joy should be permanent on the blockchain.\nMissed it?\nCatch the recap here:\nhttps://x.com/mrcool_web3/status/1947009923163766841\nTry Festify today!\nMint your own onchain greeting card in seconds:\nFestify - AI-Powered Festival Greetings NFTs\nStay connected:\nFollow us on X → @festify_ai\nWe’re just getting started — more updates coming as the Spotlight Campaign continues!"
            }
        ]
    },
    {
        "id": "baadb54c2303cdfa",
        "topic_id": "8049",
        "title": "How Builders Use ALPHA to Stay Ahead of Governance Votes",
        "url": "https://forum.ceg.vote/t/how-builders-use-alpha-to-stay-ahead-of-governance-votes/8049",
        "views": "",
        "comments": "2",
        "created_date": "Aug 1, 2025 8:18 pm",
        "latest_activity": "Aug 3, 2025 5:31 pm",
        "content": "How Builders Use ALPHA to Stay Ahead of Governance Votes\nIn Hyperion, a single DAO vote can change protocol rules, liquidity incentives, or grant allocations overnight. Builders who stay ahead of these trends can adjust their strategies, secure funding, or influence decisions before it’s too late.\nALPHA gives builders that edge.\nALPHA continuously tracks new proposals the moment they are submitted. It doesn’t just list them, it ranks them by potential impact, analysing which wallets are involved and how the votes are shifting.\nFor a builder, this means knowing whether a proposal could affect your protocol’s funding, user incentives, or even its competitive positioning.\nBuilders use ALPHA’s alerts to:\nAdjust liquidity or token incentives before governance changes affect them\nSecure grants early by monitoring funding-related proposals\nCoordinate with DAO members to influence key votes before they close\nManual tracking of governance across multiple forums and contracts is almost impossible as Hyperion grows. ALPHA automates this, giving builders a genuine opportunity to act early rather than react late.",
        "comments_details": [
            {
                "author": "Alpha_Alith",
                "comment": "How Builders Use ALPHA to Stay Ahead of Governance Votes\nIn Hyperion, a single DAO vote can change protocol rules, liquidity incentives, or grant allocations overnight. Builders who stay ahead of these trends can adjust their strategies, secure funding, or influence decisions before it’s too late.\nALPHA gives builders that edge.\nALPHA continuously tracks new proposals the moment they are submitted. It doesn’t just list them, it ranks them by potential impact, analysing which wallets are involved and how the votes are shifting.\nFor a builder, this means knowing whether a proposal could affect your protocol’s funding, user incentives, or even its competitive positioning.\nBuilders use ALPHA’s alerts to:\nAdjust liquidity or token incentives before governance changes affect them\nSecure grants early by monitoring funding-related proposals\nCoordinate with DAO members to influence key votes before they close\nManual tracking of governance across multiple forums and contracts is almost impossible as Hyperion grows. ALPHA automates this, giving builders a genuine opportunity to act early rather than react late."
            }
        ]
    },
    {
        "id": "70e4db29a8987cee",
        "topic_id": "7777",
        "title": "Festify achievement report – july 2025",
        "url": "https://forum.ceg.vote/t/festify-achievement-report-july-2025/7777",
        "views": "",
        "comments": "3",
        "created_date": "Aug 1, 2025 9:38 am",
        "latest_activity": "Aug 3, 2025 5:28 pm",
        "content": "We’re proud to share our early wins with the Web3 community:\n100+ followers on X\n1,000+ on-chain transactions\n100+ unique NFT holders\n100+ forum invites on METIS DAO\nActive community momentum & strong smart contract performance\nThese milestones are proof of real progress.\nThank you for minting, posting, and pushing the FESTIFY mission forward.\nJoin us:\nX: https://x.com/festify_ai\nTelegram: Telegram: View @festify_ai | Telegram: View @festify_chat\nForum: Metis iDAO Forum\n#SendFestify #Web3 #NFTs #MetisDAO #FESTIFY",
        "comments_details": [
            {
                "author": "mrcool_web3",
                "comment": "We’re proud to share our early wins with the Web3 community:\n100+ followers on X\n1,000+ on-chain transactions\n100+ unique NFT holders\n100+ forum invites on METIS DAO\nActive community momentum & strong smart contract performance\nThese milestones are proof of real progress.\nThank you for minting, posting, and pushing the FESTIFY mission forward.\nJoin us:\nX: https://x.com/festify_ai\nTelegram: Telegram: View @festify_ai | Telegram: View @festify_chat\nForum: Metis iDAO Forum\n#SendFestify #Web3 #NFTs #MetisDAO #FESTIFY"
            }
        ]
    },
    {
        "id": "66f0dc6cc342d680",
        "topic_id": "7402",
        "title": "Approved Guild leaders- Jul, 2025",
        "url": "https://forum.ceg.vote/t/approved-guild-leaders-jul-2025/7402",
        "views": "",
        "comments": "5",
        "created_date": "Jul 29, 2025 6:09 pm",
        "latest_activity": "Aug 3, 2025 5:18 pm",
        "content": "Welcome, Guild Leaders!\nSo you’re a Guild Leader on the Metis forum - congratulations! As a forum leader, it’s your role to help oversee the Guilds, ensuring that users and content are in line with forum rules/guidelines.\nHere are some common scenarios on how to handle your Guilds: Discourse Moderation Guide - Site Management - Discourse Meta\nWelcoming New Users\nRevise the Poor title/incorrect category\nMove off-topic digression\nModerate non-productive discussion\nPin/unpin topics\nSet Slow Mode to manage conversation\nAssign backup moderators\nFlag inappropriate content\nGive a warning for negative behaviour\nSpecial Group Owner Privileges:\nManage Guild Membership: You can approve or remove members from the guild, ensuring that the community remains aligned with its goals and values.\nSet Permissions for Topics: Maintain high-quality discussions by setting permissions for various topics. This ensures content stays relevant and organized.\nModerate the Group: You have the ability to pin important topics, move posts to appropriate sections, archive old discussions, and edit category descriptions, keeping the guild organized and up to date.\nFlair and Titles: Guild Leaders will receive special flair and titles in their profiles to recognize their contributions and leadership.\nRole Flexibility:\nGuild Leaders can assign specific roles within the guild, such as Backup Admin or AMA Host, but these roles should have clearly defined powers. These roles are meant to encourage active participation and collaboration, not to create admin-like positions that may hinder interaction.\nFlair and Rewards:\nFlair: Use flair to reward active contributors, recognizing their engagement and input within the community.\nPremium Wallet Perks: leaders are eligible for Premium Wallet perks as a thank you for their efforts and leadership.\nAs a Guild Leader, you’ll have the power to shape your community and engage in meaningful discussions with Hyperion developers and enthusiasts. Lead by example, help your guild grow, and influence the future of Hyperion!\nLet’s make this an exciting, collaborative, and innovative space!",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "Welcome, Guild Leaders!\nSo you’re a Guild Leader on the Metis forum - congratulations! As a forum leader, it’s your role to help oversee the Guilds, ensuring that users and content are in line with forum rules/guidelines.\nHere are some common scenarios on how to handle your Guilds: Discourse Moderation Guide - Site Management - Discourse Meta\nWelcoming New Users\nRevise the Poor title/incorrect category\nMove off-topic digression\nModerate non-productive discussion\nPin/unpin topics\nSet Slow Mode to manage conversation\nAssign backup moderators\nFlag inappropriate content\nGive a warning for negative behaviour\nSpecial Group Owner Privileges:\nManage Guild Membership: You can approve or remove members from the guild, ensuring that the community remains aligned with its goals and values.\nSet Permissions for Topics: Maintain high-quality discussions by setting permissions for various topics. This ensures content stays relevant and organized.\nModerate the Group: You have the ability to pin important topics, move posts to appropriate sections, archive old discussions, and edit category descriptions, keeping the guild organized and up to date.\nFlair and Titles: Guild Leaders will receive special flair and titles in their profiles to recognize their contributions and leadership.\nRole Flexibility:\nGuild Leaders can assign specific roles within the guild, such as Backup Admin or AMA Host, but these roles should have clearly defined powers. These roles are meant to encourage active participation and collaboration, not to create admin-like positions that may hinder interaction.\nFlair and Rewards:\nFlair: Use flair to reward active contributors, recognizing their engagement and input within the community.\nPremium Wallet Perks: leaders are eligible for Premium Wallet perks as a thank you for their efforts and leadership.\nAs a Guild Leader, you’ll have the power to shape your community and engage in meaningful discussions with Hyperion developers and enthusiasts. Lead by example, help your guild grow, and influence the future of Hyperion!\nLet’s make this an exciting, collaborative, and innovative space!"
            }
        ]
    },
    {
        "id": "83f70974b8d73476",
        "topic_id": "6353",
        "title": "No-Lose Lottery Campaign",
        "url": "https://forum.ceg.vote/t/no-lose-lottery-campaign/6353",
        "views": "",
        "comments": "6",
        "created_date": "Jul 14, 2025 8:11 pm",
        "latest_activity": "Aug 3, 2025 5:02 pm",
        "content": "JUL\n1\nNo-Lose Lottery Campaign\nPublic\n·\nCreated by\nSheyda\nTue, Jul 1 7:25 PM → Wed, Dec 31\n11\nNo-Lose Lottery Campaign: Earn Points, Win Rewards\nWe are excited to launch the No-Lose Lottery campaign, designed to reward our active and engaged community. As part of this initiative, you will earn points through your participation in the Hyperion Forum, and those points will give you entries into a biweekly lottery. The more you engage, the higher your chances of winning.\nThe campaign started 2 weeks ago on Jul 1st, and the first draw has been recorded and will be shared soon.\nStart Date: July 1st, 2025\nDuration: Ongoing, with new winners selected every 2 weeks\nTotal Winners per Round: 3\n2 small prizes\n1 grand prize\nWinners will receive badge that can be swapped for METIS rewards on Hyperion mainnet:\n1- Visionary Badge (Top Tier) Gold\nAwarded to the Grand Winner of the No-Lose Lottery biweekly draw.\n2- Contributor Badge (Low tier) Bronze\nAwarded to the 2 Small Reward Winners of the No-Lose Lottery biweekly draw.\nIn the No-Lose Lottery, every 10 points you accumulate gives you one chance to win. Even if you only earn 1 chance (by collecting 10 points), you’re still eligible to participate and could win! The best part? No matter how many chances you have, you’re always in the game; it’s a true no-lose situation!\nWinner Selection\nWinners will be randomly selected from all eligible entries.\nThe selection process will be recorded and shared publicly on the Forum to ensure transparency.\nWinners will receive exclusive badges, which will be redeemable for METIS tokens once the mainnet is live.\nHow to Participate\nEarn Points: Engage in discussions, post helpful content, and interact with others in the Hyperion Forum to accumulate points.\nGet Entries: Each 10 points earned will give you one entry into the lottery.\nLeaderboards:\nCurrent No-Lose Period: View the ongoing lottery for the current period.\nOverall Totals: Track your progress and compare your points with others in the community.\nBoth leaderboards will be displayed on the right panel of the Forum.\nOnce the leaderboard is live we’ll announce on Metis L2 X account with a live link.\nStart participating today, earn points, and stand a chance to win. The No-Lose Lottery is all about recognizing and rewarding our dedicated community members. Keep engaging and contributing to the Hyperion Forum.\nCongrats to the first No-Lose Lottery draw winners- July 14:\nGrand prize: @Gann\nSmall prize: @Diapa and @arbilearn\nCongrats to the second No-Lose Lottery draw winners- July 28:\nGrand prize: @4ngle\nSmall prize: @gokkull_15 and @arbilearn",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "JUL\n1\nNo-Lose Lottery Campaign\nPublic\n·\nCreated by\nSheyda\nTue, Jul 1 7:25 PM → Wed, Dec 31\n11\nNo-Lose Lottery Campaign: Earn Points, Win Rewards\nWe are excited to launch the No-Lose Lottery campaign, designed to reward our active and engaged community. As part of this initiative, you will earn points through your participation in the Hyperion Forum, and those points will give you entries into a biweekly lottery. The more you engage, the higher your chances of winning.\nThe campaign started 2 weeks ago on Jul 1st, and the first draw has been recorded and will be shared soon.\nStart Date: July 1st, 2025\nDuration: Ongoing, with new winners selected every 2 weeks\nTotal Winners per Round: 3\n2 small prizes\n1 grand prize\nWinners will receive badge that can be swapped for METIS rewards on Hyperion mainnet:\n1- Visionary Badge (Top Tier) Gold\nAwarded to the Grand Winner of the No-Lose Lottery biweekly draw.\n2- Contributor Badge (Low tier) Bronze\nAwarded to the 2 Small Reward Winners of the No-Lose Lottery biweekly draw.\nIn the No-Lose Lottery, every 10 points you accumulate gives you one chance to win. Even if you only earn 1 chance (by collecting 10 points), you’re still eligible to participate and could win! The best part? No matter how many chances you have, you’re always in the game; it’s a true no-lose situation!\nWinner Selection\nWinners will be randomly selected from all eligible entries.\nThe selection process will be recorded and shared publicly on the Forum to ensure transparency.\nWinners will receive exclusive badges, which will be redeemable for METIS tokens once the mainnet is live.\nHow to Participate\nEarn Points: Engage in discussions, post helpful content, and interact with others in the Hyperion Forum to accumulate points.\nGet Entries: Each 10 points earned will give you one entry into the lottery.\nLeaderboards:\nCurrent No-Lose Period: View the ongoing lottery for the current period.\nOverall Totals: Track your progress and compare your points with others in the community.\nBoth leaderboards will be displayed on the right panel of the Forum.\nOnce the leaderboard is live we’ll announce on Metis L2 X account with a live link.\nStart participating today, earn points, and stand a chance to win. The No-Lose Lottery is all about recognizing and rewarding our dedicated community members. Keep engaging and contributing to the Hyperion Forum.\nCongrats to the first No-Lose Lottery draw winners- July 14:\nGrand prize: @Gann\nSmall prize: @Diapa and @arbilearn\nCongrats to the second No-Lose Lottery draw winners- July 28:\nGrand prize: @4ngle\nSmall prize: @gokkull_15 and @arbilearn"
            }
        ]
    },
    {
        "id": "0dcfcf9b9d663deb",
        "topic_id": "8442",
        "title": "DeFAI - The Rise of AI-Integrated DeFi Protocols",
        "url": "https://forum.ceg.vote/t/defai-the-rise-of-ai-integrated-defi-protocols/8442",
        "views": "",
        "comments": "0",
        "created_date": "Aug 3, 2025 4:43 pm",
        "latest_activity": null,
        "content": "As Web3 evolves, we’re entering a new frontier where AI and DeFi are converging—and it’s reshaping what’s possible in decentralized finance.\nDeFAI (DeFi + AI) refers to the growing ecosystem of AI-integrated smart contracts, autonomous agent networks, and intelligent DeFi protocols that can make real-time decisions, optimize strategies, and learn from user behavior without human intervention.\nWhat Makes This Relevant\nAutomated strategy execution – Think yield optimization, risk management, or portfolio rebalancing done by intelligent agents.\nOn-chain AI agents – Protocols like Autonolas and Fetch.ai are showing how decentralized AI can act autonomously across chains and ecosystems.\nUser-specific personalization – AI can tailor DeFi products (like loans or staking strategies) based on individual wallet behavior or market data.\nCross-protocol intelligence – Agents that interact with multiple DeFi platforms, executing complex operations across chains—all on autopilot.\nLazAI is already building a foundational layer for intelligent agent frameworks, tokenized data (via DATs), and on-chain AI workflows. With Metis’ speed and modularity, LazAI is uniquely positioned to:\nPower AI-native DeFi applications*on Metis\nEnable autonomous agents to manage liquidity, lending, and staking strategies\nIntegrate DeFi protocols into the LazAI agent app marketplace\nBridge AI data, model outputs, and financial decision-making in a fully on-chain economy\nMeanwhile, Hyperion offers a perfect launchpad for DeFAI innovation—bringing tokenized AI data, automated strategy agents, and programmable DeFi workflows into one connected, community-owned ecosystem.\nWhat real-world use cases would you like to see DeFAI solve within LazAI or Hyperion?",
        "comments_details": [
            {
                "author": "Rosita",
                "comment": "As Web3 evolves, we’re entering a new frontier where AI and DeFi are converging—and it’s reshaping what’s possible in decentralized finance.\nDeFAI (DeFi + AI) refers to the growing ecosystem of AI-integrated smart contracts, autonomous agent networks, and intelligent DeFi protocols that can make real-time decisions, optimize strategies, and learn from user behavior without human intervention.\nWhat Makes This Relevant\nAutomated strategy execution – Think yield optimization, risk management, or portfolio rebalancing done by intelligent agents.\nOn-chain AI agents – Protocols like Autonolas and Fetch.ai are showing how decentralized AI can act autonomously across chains and ecosystems.\nUser-specific personalization – AI can tailor DeFi products (like loans or staking strategies) based on individual wallet behavior or market data.\nCross-protocol intelligence – Agents that interact with multiple DeFi platforms, executing complex operations across chains—all on autopilot.\nLazAI is already building a foundational layer for intelligent agent frameworks, tokenized data (via DATs), and on-chain AI workflows. With Metis’ speed and modularity, LazAI is uniquely positioned to:\nPower AI-native DeFi applications*on Metis\nEnable autonomous agents to manage liquidity, lending, and staking strategies\nIntegrate DeFi protocols into the LazAI agent app marketplace\nBridge AI data, model outputs, and financial decision-making in a fully on-chain economy\nMeanwhile, Hyperion offers a perfect launchpad for DeFAI innovation—bringing tokenized AI data, automated strategy agents, and programmable DeFi workflows into one connected, community-owned ecosystem.\nWhat real-world use cases would you like to see DeFAI solve within LazAI or Hyperion?"
            }
        ]
    },
    {
        "id": "3e9a7f7e5131686c",
        "topic_id": "6402",
        "title": "Community Testing Has Kicked Off",
        "url": "https://forum.ceg.vote/t/community-testing-has-kicked-off/6402",
        "views": "",
        "comments": "3",
        "created_date": "Jul 16, 2025 8:58 pm",
        "latest_activity": "Aug 3, 2025 3:22 pm",
        "content": "The testing phase is live, and this time it’s all about you and your communities. Over the next few weeks, expect some fun testing events popping up across different global and regional groups.\nIf you see one, join in, break things, share feedback—every bit helps make these dApps stronger. And yes, there are rewards, so get your testing kits ready. This is a good time to show how much we care about shaping Hyperion’s ecosystem.\nWant to Go Premium?\nHere’s something extra for those who want to push further—\nHyperion’s Premium Wallet Campaign is live with $15,000 in METIS gas rebates .\nOnly 25 wallets will get a full year of gas-free transactions on Hyperion mainnet .\nTo stand a chance:\nHit Trust Level 2 on the forum\nTest 50+ dApps on the Hyperion Testnet\nIf you’re already testing, this is your perfect chance to double up—help improve the ecosystem and earn gas-free status.\nFull details here: Premium Wallet Campaign\nDApps to test: Stress Testing List\nLet’s make some noise with this one. Looking forward to seeing who hits Premium first.",
        "comments_details": [
            {
                "author": "Norbert",
                "comment": "The testing phase is live, and this time it’s all about you and your communities. Over the next few weeks, expect some fun testing events popping up across different global and regional groups.\nIf you see one, join in, break things, share feedback—every bit helps make these dApps stronger. And yes, there are rewards, so get your testing kits ready. This is a good time to show how much we care about shaping Hyperion’s ecosystem.\nWant to Go Premium?\nHere’s something extra for those who want to push further—\nHyperion’s Premium Wallet Campaign is live with $15,000 in METIS gas rebates .\nOnly 25 wallets will get a full year of gas-free transactions on Hyperion mainnet .\nTo stand a chance:\nHit Trust Level 2 on the forum\nTest 50+ dApps on the Hyperion Testnet\nIf you’re already testing, this is your perfect chance to double up—help improve the ecosystem and earn gas-free status.\nFull details here: Premium Wallet Campaign\nDApps to test: Stress Testing List\nLet’s make some noise with this one. Looking forward to seeing who hits Premium first."
            }
        ]
    },
    {
        "id": "03df884f7ef57e01",
        "topic_id": "5649",
        "title": "Dogex: Simplified Decentralized Perpetuals DEX on Hyperion",
        "url": "https://forum.ceg.vote/t/dogex-simplified-decentralized-perpetuals-dex-on-hyperion/5649",
        "views": "",
        "comments": "72",
        "created_date": "Jun 14, 2025 6:42 pm",
        "latest_activity": "Aug 3, 2025 2:53 pm",
        "content": "Dogex — The Easiest Way to Start Trading Perpetual Futures\nLinks: doge-ex.com\nTwitter: https://x.com/DogexPerps\nCEO Twitter with 30 days challenge to make DOGEX: https://x.com/mr_wagmi_cto\nVideo tutorial: https://youtu.be/4Wjm_cblm_Y\nMost decentralized perpetual exchanges are overloaded with complex interfaces, confusing mechanics, and steep learning curves that push away new and retail traders. This complexity holds back the broader adoption of perp trading in DeFi.\nDogex solves this problem by offering an intuitive and accessible platform built on Hyperion — a next-generation, high-performance blockchain.\nWhy Choose Dogex\nSimplicity\nA clean, minimal interface focused on what matters: quick position entry and exit, clear margin information, real-time updates. Fully mobile-compatible and beginner-friendly.\nSpeed and Scalability\nHyperion’s parallel transaction architecture ensures ultra-low latency and near-instant order execution. It delivers a user experience comparable to centralized exchanges while remaining fully decentralized.\nHigh Leverage and 1-Minute Charts\nDogex offers high leverage and access to 1-minute timeframes. This enables users to:\nMake more trades in shorter periods\nQuickly understand market dynamics\nLearn by doing in real trading conditions\nAvoid long waiting periods associated with daily or weekly timeframes\nThe platform encourages active trading and accelerates the learning process.\nOnchain AI Assistant\nAn integrated onchain AI system monitors positions, provides real-time risk analysis, and offers smart suggestions. It’s especially useful for beginners, helping them avoid liquidations and learn position management on the go.\nLearning, Community, and Gamification\nLearn Through Practice\nDogex is more than just an exchange — it’s a hands-on educational platform. Regular trading hackathons and challenges allow users to experiment, fail safely, and improve.\nLeaderboard That Rewards Progress\nThe leaderboard doesn’t just track PnL. It also highlights:\nStrategy development\nRisk management\nCommunity engagement\nLearning effort\nThis encourages users to grow instead of just chasing profits.\nFair Token Launch\nDogex will launch its token through a fair launch — no insider allocations or VC dominance. Everyone participates on equal terms.\nDogex’s mission is to onboard users into the Hyperion ecosystem and show that trading can be simple, fast, and accessible to everyone.\nDogex is not just another perp exchange. It’s the gateway to DeFi for the next generation of traders.",
        "comments_details": [
            {
                "author": "mrwagmicto",
                "comment": "Dogex — The Easiest Way to Start Trading Perpetual Futures\nLinks: doge-ex.com\nTwitter: https://x.com/DogexPerps\nCEO Twitter with 30 days challenge to make DOGEX: https://x.com/mr_wagmi_cto\nVideo tutorial: https://youtu.be/4Wjm_cblm_Y\nMost decentralized perpetual exchanges are overloaded with complex interfaces, confusing mechanics, and steep learning curves that push away new and retail traders. This complexity holds back the broader adoption of perp trading in DeFi.\nDogex solves this problem by offering an intuitive and accessible platform built on Hyperion — a next-generation, high-performance blockchain.\nWhy Choose Dogex\nSimplicity\nA clean, minimal interface focused on what matters: quick position entry and exit, clear margin information, real-time updates. Fully mobile-compatible and beginner-friendly.\nSpeed and Scalability\nHyperion’s parallel transaction architecture ensures ultra-low latency and near-instant order execution. It delivers a user experience comparable to centralized exchanges while remaining fully decentralized.\nHigh Leverage and 1-Minute Charts\nDogex offers high leverage and access to 1-minute timeframes. This enables users to:\nMake more trades in shorter periods\nQuickly understand market dynamics\nLearn by doing in real trading conditions\nAvoid long waiting periods associated with daily or weekly timeframes\nThe platform encourages active trading and accelerates the learning process.\nOnchain AI Assistant\nAn integrated onchain AI system monitors positions, provides real-time risk analysis, and offers smart suggestions. It’s especially useful for beginners, helping them avoid liquidations and learn position management on the go.\nLearning, Community, and Gamification\nLearn Through Practice\nDogex is more than just an exchange — it’s a hands-on educational platform. Regular trading hackathons and challenges allow users to experiment, fail safely, and improve.\nLeaderboard That Rewards Progress\nThe leaderboard doesn’t just track PnL. It also highlights:\nStrategy development\nRisk management\nCommunity engagement\nLearning effort\nThis encourages users to grow instead of just chasing profits.\nFair Token Launch\nDogex will launch its token through a fair launch — no insider allocations or VC dominance. Everyone participates on equal terms.\nDogex’s mission is to onboard users into the Hyperion ecosystem and show that trading can be simple, fast, and accessible to everyone.\nDogex is not just another perp exchange. It’s the gateway to DeFi for the next generation of traders."
            }
        ]
    },
    {
        "id": "3dc2e1a0032e13b6",
        "topic_id": "5930",
        "title": "HyperMind AI",
        "url": "https://forum.ceg.vote/t/hypermind-ai/5930",
        "views": "",
        "comments": "13",
        "created_date": "Jun 23, 2025 11:41 pm",
        "latest_activity": "Aug 3, 2025 2:52 pm",
        "content": "Live Link: https://hypermind-ai.vercel.app/\nProject Name\nHyperMind AI – Real-Time AI Trading Signals on Hyperion\nProblem Statement\nRetail crypto traders often lack access to sophisticated tools for market analysis and signal generation. Most trading intelligence is centralized, opaque, and inaccessible to non-technical users. As a result, DeFi users frequently miss profitable opportunities or fall prey to volatility, lacking real-time, trustable AI-driven decision support.\nSolution Overview\nHyperMind AI transforms DeFi trading by delivering real-time, AI-generated trading signals directly within a web-based dashboard. Leveraging the Alith AI engine and Hyperion’s AI-native blockchain infrastructure, it offers actionable insights such as BUY, HOLD, MONITOR, or YIELD FARM signals with confidence metrics, risk levels, and expected returns. The system simulates local inference for now, preparing for verifiable on-chain execution. It empowers users of all levels to trade smarter, safer, and faster using intelligence previously only available to professionals.\nProject Description\nHyperMind AI is a real-time DeFi trading assistant that simulates on-chain AI trading intelligence using AlithMock, a local inference engine designed to mirror the behavior of Alith AI. It displays AI signals based on multi-layer neural simulations, tracking entry/exit prices, confidence levels, and risk metrics. Users can interact with a responsive dashboard, execute or monitor trades, and analyze their portfolio in real time.\n\nCore Features:\nAI Signal Feed: Real-time BUY / STRONG BUY / MONITOR / HOLD signals\nConfidence Scores: Up to 98%, updated live\nAlith System Stats: Neural processing speed, win rate, network uptime\nPortfolio Insights: Asset breakdown, daily P&L, Sharpe ratio, AI win rate\nExecution Panel: Run simulated signal execution logic with wallet connection\nEmergency Stop / Auto-Rebalance: Simulated protection features\nTechnologies:\nFrontend: JavaScript + ethers.js\nSmart Contract-ready: Solidity architecture (WIP)\nBackend (simulated): AlithMock inference engine (browser-based)\nChain: Hyperion / Alt-Hyperion Testnet\nUsers can connect a wallet, interact with live signals, monitor returns, and experience AI-assisted DeFi trading with one click. The vision is to shift from static dashboards to truly intelligent DeFi experiences.\nWhat excites us: HyperMind AI is not just a UI—it’s an infrastructure-ready prototype for transparent, AI-native trading systems. As Alith AI matures, this frontend will seamlessly connect to on-chain inference engines, zkML proof generators, and real-time validators.\nCommunity Engagement Features\nTestable Features & Task System:\nConnect Wallet to Hyperion Testnet (+3 pts)\nMonitor Live AI Signals (+5 pts)\nExecute a Signal (Simulated) (+10 pts)\nTrigger Emergency Stop / Auto-Rebalance (+5 pts)\nRate Signal Accuracy After Use (+2 pts)\nPoints System:\nEach action grants points that accumulate in a leaderboard. Top testers may receive:\nEarly access to new signals\nNFT badges\nGovernance test tokens\nExplore:\nLive Demo: https://hypermind-ai.vercel.app/\nGitHub: https://github.com/JinyueXie/hypermind-ai\nDemo Video: https://youtube.com/watch?v=TVCFpXDk1e4\nLet’s redefine AI-native DeFi — together.",
        "comments_details": [
            {
                "author": "JinyueXie",
                "comment": "Live Link: https://hypermind-ai.vercel.app/\nProject Name\nHyperMind AI – Real-Time AI Trading Signals on Hyperion\nProblem Statement\nRetail crypto traders often lack access to sophisticated tools for market analysis and signal generation. Most trading intelligence is centralized, opaque, and inaccessible to non-technical users. As a result, DeFi users frequently miss profitable opportunities or fall prey to volatility, lacking real-time, trustable AI-driven decision support.\nSolution Overview\nHyperMind AI transforms DeFi trading by delivering real-time, AI-generated trading signals directly within a web-based dashboard. Leveraging the Alith AI engine and Hyperion’s AI-native blockchain infrastructure, it offers actionable insights such as BUY, HOLD, MONITOR, or YIELD FARM signals with confidence metrics, risk levels, and expected returns. The system simulates local inference for now, preparing for verifiable on-chain execution. It empowers users of all levels to trade smarter, safer, and faster using intelligence previously only available to professionals.\nProject Description\nHyperMind AI is a real-time DeFi trading assistant that simulates on-chain AI trading intelligence using AlithMock, a local inference engine designed to mirror the behavior of Alith AI. It displays AI signals based on multi-layer neural simulations, tracking entry/exit prices, confidence levels, and risk metrics. Users can interact with a responsive dashboard, execute or monitor trades, and analyze their portfolio in real time.\n\nCore Features:\nAI Signal Feed: Real-time BUY / STRONG BUY / MONITOR / HOLD signals\nConfidence Scores: Up to 98%, updated live\nAlith System Stats: Neural processing speed, win rate, network uptime\nPortfolio Insights: Asset breakdown, daily P&L, Sharpe ratio, AI win rate\nExecution Panel: Run simulated signal execution logic with wallet connection\nEmergency Stop / Auto-Rebalance: Simulated protection features\nTechnologies:\nFrontend: JavaScript + ethers.js\nSmart Contract-ready: Solidity architecture (WIP)\nBackend (simulated): AlithMock inference engine (browser-based)\nChain: Hyperion / Alt-Hyperion Testnet\nUsers can connect a wallet, interact with live signals, monitor returns, and experience AI-assisted DeFi trading with one click. The vision is to shift from static dashboards to truly intelligent DeFi experiences.\nWhat excites us: HyperMind AI is not just a UI—it’s an infrastructure-ready prototype for transparent, AI-native trading systems. As Alith AI matures, this frontend will seamlessly connect to on-chain inference engines, zkML proof generators, and real-time validators.\nCommunity Engagement Features\nTestable Features & Task System:\nConnect Wallet to Hyperion Testnet (+3 pts)\nMonitor Live AI Signals (+5 pts)\nExecute a Signal (Simulated) (+10 pts)\nTrigger Emergency Stop / Auto-Rebalance (+5 pts)\nRate Signal Accuracy After Use (+2 pts)\nPoints System:\nEach action grants points that accumulate in a leaderboard. Top testers may receive:\nEarly access to new signals\nNFT badges\nGovernance test tokens\nExplore:\nLive Demo: https://hypermind-ai.vercel.app/\nGitHub: https://github.com/JinyueXie/hypermind-ai\nDemo Video: https://youtube.com/watch?v=TVCFpXDk1e4\nLet’s redefine AI-native DeFi — together."
            }
        ]
    },
    {
        "id": "fa9534385de47fc3",
        "topic_id": "5939",
        "title": "HyperHack Stress Testing Phase",
        "url": "https://forum.ceg.vote/t/hyperhack-stress-testing-phase/5939",
        "views": "",
        "comments": "0",
        "created_date": "Jun 24, 2025 3:19 pm",
        "latest_activity": "Aug 3, 2025 11:43 am",
        "content": "JUL\n15\nHyperHack Stress Testing Phase\nPublic\n·\nCreated by\nPavel\nTue, Jul 15 → Thu, Aug 7\n9",
        "comments_details": [
            {
                "author": "pavel",
                "comment": "JUL\n15\nHyperHack Stress Testing Phase\nPublic\n·\nCreated by\nPavel\nTue, Jul 15 → Thu, Aug 7\n9"
            }
        ]
    },
    {
        "id": "c7633769f6a15011",
        "topic_id": "5825",
        "title": "HyperHack Winner Announcement- Final",
        "url": "https://forum.ceg.vote/t/hyperhack-winner-announcement-final/5825",
        "views": "",
        "comments": "0",
        "created_date": "Jun 18, 2025 6:53 pm",
        "latest_activity": "Aug 3, 2025 11:40 am",
        "content": "AUG\n16\nHyperHack Winner Announcement\nPublic\n·\nCreated by\nSheyda\nSat, Aug 16 4:00 PM → 5:00 PM (Abidjan)\n3\nJudgment & Wrap-Up\n7 August 2025 –– 16 August 2025\nHyperHack Judging Criteria - Hyperion / HyperHack - Metis iDAO Forum",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "AUG\n16\nHyperHack Winner Announcement\nPublic\n·\nCreated by\nSheyda\nSat, Aug 16 4:00 PM → 5:00 PM (Abidjan)\n3\nJudgment & Wrap-Up\n7 August 2025 –– 16 August 2025\nHyperHack Judging Criteria - Hyperion / HyperHack - Metis iDAO Forum"
            }
        ]
    },
    {
        "id": "bf62db2852efc1a1",
        "topic_id": "5826",
        "title": "HyperHack Judging Phase",
        "url": "https://forum.ceg.vote/t/hyperhack-judging-phase/5826",
        "views": "",
        "comments": "0",
        "created_date": "Jun 18, 2025 6:56 pm",
        "latest_activity": "Aug 3, 2025 11:29 am",
        "content": "AUG\n7\nHyperHack Judging Phase\nPublic\n·\nCreated by\nSheyda\nThu, Aug 7 4:00 PM → Sat, Aug 16\n3\nJudgment & Wrap-Up\n7 August 2025 –– 16 August 2025\nHyperHack Judging Criteria - Hyperion / HyperHack - Metis iDAO Forum\nWinner Announcement\n16 August 2025\nHyperHack Winner Announcement- Final - Hyperion / Announcements - Metis iDAO Forum",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "AUG\n7\nHyperHack Judging Phase\nPublic\n·\nCreated by\nSheyda\nThu, Aug 7 4:00 PM → Sat, Aug 16\n3\nJudgment & Wrap-Up\n7 August 2025 –– 16 August 2025\nHyperHack Judging Criteria - Hyperion / HyperHack - Metis iDAO Forum\nWinner Announcement\n16 August 2025\nHyperHack Winner Announcement- Final - Hyperion / Announcements - Metis iDAO Forum"
            }
        ]
    }
]