[
    {
        "id": "ee9a9d1dacb1cc2c",
        "topic_id": "6130",
        "title": "Guild Campaign",
        "url": "https://forum.ceg.vote/t/guild-campaign/6130",
        "views": "",
        "comments": "0",
        "created_date": "Jul 3, 2025 8:40 pm",
        "latest_activity": null,
        "content": "With the launch of the Guilds Campaign on the Hyperion Forum, we might finally be seeing a scalable structure for decentralized coordination.\nWhat kind of guild would you build if there were no limits? A tooling-focused dev squad? A data-driven research unit? Something else entirely?\nA Guild full of Degen Devs won’t be bad imo",
        "comments_details": [
            {
                "author": "Gann",
                "comment": "With the launch of the Guilds Campaign on the Hyperion Forum, we might finally be seeing a scalable structure for decentralized coordination.\nWhat kind of guild would you build if there were no limits? A tooling-focused dev squad? A data-driven research unit? Something else entirely?\nA Guild full of Degen Devs won’t be bad imo"
            }
        ]
    },
    {
        "id": "b3effa288e47971f",
        "topic_id": "5994",
        "title": "Anyone else thinking about how AI agents could actually use dApps for us?",
        "url": "https://forum.ceg.vote/t/anyone-else-thinking-about-how-ai-agents-could-actually-use-dapps-for-us/5994",
        "views": "",
        "comments": "6",
        "created_date": "Jun 26, 2025 7:34 pm",
        "latest_activity": "Jul 3, 2025 8:34 pm",
        "content": "Been thinking a lot about this lately… after the recent vibe section.\nWith Alith and all this talk of onchain inference, AI agents aren’t just a cool idea anymore they’re actually buildable.\nSo here’s my question:\nIf you could build one AI agent that uses dApps on your behalf, what would it do?\nWould it manage your yield strategies?\nAuto-bridge based on gas prices?\nVote on governance proposals while you sleep?\nCurious what y’all are thinking even if it sounds far-fetched, drop it here.",
        "comments_details": [
            {
                "author": "Gann",
                "comment": "Been thinking a lot about this lately… after the recent vibe section.\nWith Alith and all this talk of onchain inference, AI agents aren’t just a cool idea anymore they’re actually buildable.\nSo here’s my question:\nIf you could build one AI agent that uses dApps on your behalf, what would it do?\nWould it manage your yield strategies?\nAuto-bridge based on gas prices?\nVote on governance proposals while you sleep?\nCurious what y’all are thinking even if it sounds far-fetched, drop it here."
            },
            {
                "author": "han",
                "comment": "If you could build an AI agent for your Web3 tasks, what’s the one thing you’d have it do?"
            },
            {
                "author": "Rosita",
                "comment": "This has been on my mind too!\nIf I could build just one AI agent to use dApps for me, a smart agent that tracks everything I’m involved in across chains and automates actions based on real-time data."
            },
            {
                "author": "priyankg3",
                "comment": "I think i will go with auto bridge based on gas prices, thats easy and time saving for me.."
            },
            {
                "author": "Liametis",
                "comment": "bridging is a pain so i would have an Agent just auto bridge dry powder on each chain and continuously rebalance"
            },
            {
                "author": "CrisMetis",
                "comment": "This is a very subjective question. I believe it really depends on how much help you need and how much trust you want to give to AI agents. Maybe I would avoid having them book or trade for me, but I would definitely use them for governance and to help me with auto-bridging at the lowest gas fees."
            },
            {
                "author": "Gann",
                "comment": "This is actually very practical imo\nWould like to see something of that sort launch"
            }
        ]
    },
    {
        "id": "acef53721b441144",
        "topic_id": "5942",
        "title": "DevRel Isn’t Just GitHub Stars — What Real Success Looks Like",
        "url": "https://forum.ceg.vote/t/devrel-isn-t-just-github-stars-what-real-success-looks-like/5942",
        "views": "",
        "comments": "1",
        "created_date": "Jun 24, 2025 6:23 pm",
        "latest_activity": "Jul 3, 2025 6:24 pm",
        "content": "When people talk about Developer Relations (DevRel), GitHub stars are usually the first metric they throw around.\nAnd yeah, they’re flashy. They look great in investor decks and executive dashboards.\nBut honestly? Stars can be a vanity metric. They don’t always reflect impact or engagement.\nHere’s what I’ve learned actually matters when you want to measure the real success of DevRel work:\n1. Developers Building in Public\nWhen devs start tweeting about the cool project they built using your API or SDK — that’s success.\nBonus if they share screenshots, tag your team, or drop your product into their YouTube demo.\nReal signal: “Just built this wallet connector in 15 mins thanks to @Xdevrel’s docs ”\n2. Tutorials That Drive First Success\nGood DevRel = reducing time-to-first-success.\nTrack how often your tutorials or quickstarts are completed. Ask devs: “How easy was it to get started?”\nIf they’re not rage-quitting halfway through, you’re doing it right.\nPro tip: Add subtle CTAs in tutorials to capture feedback or offer support at key steps.\n3. Community Contributions\nLook for signs of life in your ecosystem:\nPRs to your repo\nIssues with meaningful discussion\nDevs submitting bug fixes or doc updates\nPeople volunteering to write guides or translate docs\nThis is 10x more powerful than passive usage. It shows ownership.\n4. Support That Scales Through the Community\nWhen you see a question pop up in Discord or your forum — and another dev (not staff) answers it — that’s peak DevRel.\nIt means the community is engaged and empowered.\nYou’ve gone from “support team” to “dev enablement multiplier.”\n5. DevRel as a Product Feedback Engine\nIf you’re channeling feedback from devs into product improvements, you’re doing strategic DevRel — not just surface-level engagement.\nStart tracking:\nFeature requests from devs → features shipped\nBug reports that lead to fixes\nConfusion points that improve onboarding\nThis loop is gold for product-market fit.\n6. Talks, Podcasts, and Office Hours That Spark Action\nIt’s not about views or claps — it’s about outcomes.\nDid your talk lead to people signing up? Did your podcast episode drive devs to try something new?\nUse UTM links, follow-up surveys, or just plain community observation to track it.\n7. Retention > Reach\nYou don’t need 10,000 devs in your Discord.\nYou need 100 who keep coming back, build consistently, and bring others in.\nOne retained dev who builds weekly > 50 one-time visitors who star your repo and bounce.\n8. Internal Buy-In and Cross-Team Impact\nIf the PM team is asking for DevRel feedback, or the marketing team wants your help for launch messaging — that means your work is being recognized internally, not just externally.\nThis is often invisible success, but it’s powerful.\nTL;DR:\nDevRel success isn’t loud. It’s quiet, consistent, and based on real dev behavior:\nBuilding stuff\nContributing back\nShowing up\nSharing wins\nGiving feedback\nTeaching others\nAnd yeah, stars are fine. Just don’t let them be the only thing you’re tracking.",
        "comments_details": [
            {
                "author": "nidhinakranii",
                "comment": "When people talk about Developer Relations (DevRel), GitHub stars are usually the first metric they throw around.\nAnd yeah, they’re flashy. They look great in investor decks and executive dashboards.\nBut honestly? Stars can be a vanity metric. They don’t always reflect impact or engagement.\nHere’s what I’ve learned actually matters when you want to measure the real success of DevRel work:\n1. Developers Building in Public\nWhen devs start tweeting about the cool project they built using your API or SDK — that’s success.\nBonus if they share screenshots, tag your team, or drop your product into their YouTube demo.\nReal signal: “Just built this wallet connector in 15 mins thanks to @Xdevrel’s docs ”\n2. Tutorials That Drive First Success\nGood DevRel = reducing time-to-first-success.\nTrack how often your tutorials or quickstarts are completed. Ask devs: “How easy was it to get started?”\nIf they’re not rage-quitting halfway through, you’re doing it right.\nPro tip: Add subtle CTAs in tutorials to capture feedback or offer support at key steps.\n3. Community Contributions\nLook for signs of life in your ecosystem:\nPRs to your repo\nIssues with meaningful discussion\nDevs submitting bug fixes or doc updates\nPeople volunteering to write guides or translate docs\nThis is 10x more powerful than passive usage. It shows ownership.\n4. Support That Scales Through the Community\nWhen you see a question pop up in Discord or your forum — and another dev (not staff) answers it — that’s peak DevRel.\nIt means the community is engaged and empowered.\nYou’ve gone from “support team” to “dev enablement multiplier.”\n5. DevRel as a Product Feedback Engine\nIf you’re channeling feedback from devs into product improvements, you’re doing strategic DevRel — not just surface-level engagement.\nStart tracking:\nFeature requests from devs → features shipped\nBug reports that lead to fixes\nConfusion points that improve onboarding\nThis loop is gold for product-market fit.\n6. Talks, Podcasts, and Office Hours That Spark Action\nIt’s not about views or claps — it’s about outcomes.\nDid your talk lead to people signing up? Did your podcast episode drive devs to try something new?\nUse UTM links, follow-up surveys, or just plain community observation to track it.\n7. Retention > Reach\nYou don’t need 10,000 devs in your Discord.\nYou need 100 who keep coming back, build consistently, and bring others in.\nOne retained dev who builds weekly > 50 one-time visitors who star your repo and bounce.\n8. Internal Buy-In and Cross-Team Impact\nIf the PM team is asking for DevRel feedback, or the marketing team wants your help for launch messaging — that means your work is being recognized internally, not just externally.\nThis is often invisible success, but it’s powerful.\nTL;DR:\nDevRel success isn’t loud. It’s quiet, consistent, and based on real dev behavior:\nBuilding stuff\nContributing back\nShowing up\nSharing wins\nGiving feedback\nTeaching others\nAnd yeah, stars are fine. Just don’t let them be the only thing you’re tracking."
            },
            {
                "author": "Sheyda",
                "comment": "That’s a very comprehensive guide! thanks"
            }
        ]
    },
    {
        "id": "6a0b04f1dc54bcfd",
        "topic_id": "6121",
        "title": "Marketing in Web3 Is Crisis Management with a Smile",
        "url": "https://forum.ceg.vote/t/marketing-in-web3-is-crisis-management-with-a-smile/6121",
        "views": "",
        "comments": "1",
        "created_date": "Jul 3, 2025 10:08 am",
        "latest_activity": "Jul 3, 2025 6:17 pm",
        "content": "In Web3, the blockchain remembers everything — and so does your community.\nA single misstep can turn into a PR firestorm in hours. But a crisis isn’t the end. It’s a stress test for your values.\nAcknowledge fast\nCommunicate with radical transparency\nTake action, not just notes\nYour community doesn’t expect perfection — they expect accountability.\nThe projects that win long-term are the ones that own their story and lead with clarity, even in the storm.",
        "comments_details": [
            {
                "author": "Lucie3",
                "comment": "In Web3, the blockchain remembers everything — and so does your community.\nA single misstep can turn into a PR firestorm in hours. But a crisis isn’t the end. It’s a stress test for your values.\nAcknowledge fast\nCommunicate with radical transparency\nTake action, not just notes\nYour community doesn’t expect perfection — they expect accountability.\nThe projects that win long-term are the ones that own their story and lead with clarity, even in the storm."
            },
            {
                "author": "priyankg3",
                "comment": "I think Metis team should share about their experiences here …\n“How does your team handle tough moments when everyone’s watching?”"
            }
        ]
    },
    {
        "id": "19107ea94bbceb14",
        "topic_id": "6128",
        "title": "Fracture Point: Core Development Update – A Deep Dive into Our Web3 Foundation!",
        "url": "https://forum.ceg.vote/t/fracture-point-core-development-update-a-deep-dive-into-our-web3-foundation/6128",
        "views": "",
        "comments": "0",
        "created_date": "Jul 3, 2025 4:43 pm",
        "latest_activity": "Jul 3, 2025 5:21 pm",
        "content": "We are thrilled to unveil a monumental leap in the development of Fracture Point, our upcoming tactical TPS game. While our interactive lobby prototype provides a glimpse into the player experience, the true revolution lies in the meticulously crafted on-chain smart contracts and the robust Alith Architecture that power our innovative Proof of Play ecosystem.\nThis past month has been dedicated to building the immutable bedrock of Fracture Point’s Web3 capabilities, focusing on decentralized ownership, verifiable progression, and a player-driven economy.\nFracture Point: The Game Skill, Strategy, and True Digital Ownership\nFracture Point is designed as a high-octane, tactical third-person shooter that demands precision, strategic thinking, and teamwork. We are building a fiercely competitive environment where your skill and dedication are not just recognized, but are fundamentally integrated into the game’s core value system.\nPrepare for:\nIntense FPS Combat: Master diverse weapon loadouts and tactical maneuvers in dynamic, high-stakes engagements.\nDeep Customization: Personalize your agents and unique “variants”, making your mark on the battlefield.\nCompetitive Progression: Climb verifiable leaderboards, earn genuine rewards, and truly own your in-game achievements.\nThe Proof of Play Revolution: Rewarding Skill On-Chain\nOur commitment to Proof of Play is the defining feature of Fracture Point. This is not a concept; it’s a core, on-chain mechanism ensuring that your active engagement and skillful performance directly translate into verifiable, immutable value and progression within the game’s ecosystem.\nHow Proof of Play works in Fracture Point, powered by our contracts:\nVerifiable Achievements: Through the GameAchievementRegistry.sol contract (which is part of our ClaimManager system), your significant in-game achievements and progression milestones are immutably recorded on the blockchain. This provides transparent, provable recognition for your dedication and skill.\nSkill-Based Rewards: Our FPToken (FracturePoint Token), serving as XP, is minted to players based on their in-game performance (e.g., in Rift events), authorized exclusively by our trusted Alith Oracle. This ensures that rewards are earned through genuine gameplay.\nOn-Chain Progression & Badges: Your accumulated FPToken (XP) can then be burned via the ClaimManager contract to claim unique Rank Badges (ERC-721 NFTs) from the RankBadge.sol contract, signifying your seasonal achievements and skill tier. This process is entirely on-chain, making your rank verifiable and owned.\nPlayer-Driven Ecosystem: This interconnected system ensures that the game’s economy and value are directly influenced and shaped by the collective activity and skilled contributions of its player base.\nThis ensures Fracture Point rewards genuine skill, time invested, and proven performance, fostering a fair, transparent, and truly player-owned gaming experience.\nOur Core Architecture: Dedicated Smart Contracts and The Alith Framework\nThe true innovation behind Fracture Point lies in its robust, interconnected smart contracts and the strategic implementation of the Alith Architecture.\n1. The Alith Architecture: Our Tailored Blockchain Game Framework\nFracture Point leverages a bespoke implementation of the Alith Architecture. This is our comprehensive, modular framework meticulously designed to seamlessly integrate blockchain technology without compromising gameplay performance. It intelligently separates:\nOn-Chain Components: Our smart contracts (FPToken, RankBadge, ClaimManager) handle critical, immutable data like XP (FPToken) balances, Rank Badge (NFT) ownership, and verifiable achievements. This ensures decentralization, security, and provable ownership. The Alith Oracle acts as the trusted off-chain authority that bridges game outcomes to on-chain actions, such as distributing XP and authorizing badge claims.\nOff-Chain Backend: High-frequency game logic, real-time matchmaking, complex physics calculations, and volatile player statistics run on a performant off-chain backend. This guarantees a smooth, low-latency, and responsive gameplay experience, unburdened by blockchain transaction times and gas costs.\nSecure Interoperability: A robust and auditable communication layer ensures seamless and secure data flow between our contracts (governed by the Alith Oracle) and the off-chain game server.\n2. Fracture Point’s Core Smart Contracts (Audited & Interconnected)\nWe have successfully designed, developed, and prepared for deployment the foundational smart contracts that power Fracture Point’s Web3 economy and the Proof of Play mechanics. These contracts work in concert:\nFPToken.sol (FuturePoint Token) : This ERC-20 token represents XP within the Fracture Point ecosystem. It’s designed specifically for in-game progression:\nMinted by Alith Oracle: Only the designated alithOracle can mint new FPToken to players (e.g., via distributeRiftXP) based on game outcomes.\nBurned by ClaimManager: The ClaimManager contract is uniquely authorized to burn FPToken (XP) from player balances when they claim Rank Badges, creating a clear utility and economic loop.\nNon-Transferable (Player-to-Player): Significantly, direct player-to-player transfers of FPToken are disabled. This ensures FPToken remains a pure XP/progression token, preventing speculative trading and focusing its value on in-game achievement.\nRankBadge.sol (Fracture Point Rank Badge) : This ERC-721 NFT contract represents unique, season-specific Rank Badges that players can earn.\nMinted by ClaimManager: Only the ClaimManager contract is authorized to mint new Rank Badges to players, ensuring badges are earned through the proper Proof of Play mechanism.\nImmutable On-Chain Proof: Each badge is a unique NFT, providing verifiable, immutable proof of a player’s achievement for a given season and rank.\nClaimManager.sol : This is the central orchestrator contract, linking FPToken (XP) to Rank Badges (NFTs) and acting as the bridge to the Alith Oracle.\nManages Badge Claims: Players claim badges via ClaimManager, which then verifies their XP balance, burns the necessary FPToken from their account, and instructs RankBadge.sol to mint the new NFT.\nSeason Management: It tracks the currentSeason, ensuring players can only claim one badge per season.\nKarma Evaluation Requests: It facilitates requests for off-chain “Karma” evaluations by the Alith Oracle, hinting at deeper player behavior analysis.\nAlith Oracle Integration: It designates and relies on the alithOracle for authorizing badge claims and distributing rewards based on verified game data.\nThe code for these foundational contracts and the full Alith Architecture implementation can be reviewed in our public repository: https://github.com/SUPAMAN-dev/fracture-point-hyperhack\nYou can also verify our currently deployed contract addresses on the Hyperion testnet network: https://hyperion-testnet.metisdevops.link/\nFPToken Address: 0x4D23a7A2231624F1486CE0dE07C2fbF002f751B9\nClaimManager Address: 0x1Dab96d049e3ce56D51e6B0b149477927B897FFb\nRankBadge Address: 0xBB84D771f6aef01f00dEE45D9C9dF9C7ef9159e5\n(Note on GHC: While not currently on-chain, the fixed supply GHC currency, managed by multisig, will form the broader economic layer of Fracture Point. Its design ensures seamless future integration with our on-chain systems when the time is right, complementing the FPToken XP system.)\nLobby Prototype: The Player’s Interactive Gateway\nComplementing this powerful blockchain backend, our functional lobby prototype provides the intuitive player-facing interface. It allows players to:\nSeamlessly navigate between game modes, customization options, and personal profiles.\nExperience a polished UI/UX that aligns with Fracture Point’s futuristic theme.\nInteract with the foundational elements for future wallet integration, demonstrating how players will connect their on-chain assets to the game.\nLink to the prototype demo: https://youtu.be/aI_lQ6DcwEI\nEcosystem Interest: Strategic Offer from Plurality Web3\nAs a direct result of our development efforts during this Hyperion Hackathon, Fracture Point attracted partnership interest from leading Web3 infrastructure teams, most notably Plurality Web3, a startup pioneering embedded identity and authentication infrastructure for dApps.\nPlurality offered us a 12-month support package under their Partner Program, which includes:\n1:1 Engineering Support for seamless integration of user authentication and personalized in-game logic.\nFree infrastructure credits to cover authentication, user session tooling, and zkTLS-powered identity gating.\nUX Collaboration to co-design smooth onboarding flows without popups or clunky wallets particularly valuable for our casual-to-core player conversion goals.\nTheir outreach came after they reviewed Fracture Point’s Hyperion-backed Proof of Play system and saw clear potential for adoption in competitive Web3 gaming.\nWe view this offer as both validation of our underlying architecture and a strategic complement to the low-cost, high-throughput infrastructure that Hyperion enables. These ecosystem synergies affirm that Fracture Point is not just a playable demo, but a platform being taken seriously by early infrastructure players.\nWhat’s Next for Fracture Point?\nWith the core blockchain architecture, smart contracts, and the lobby interface firmly established, our immediate next steps are to integrate these powerful systems with the actual game engine to bring the full combat experience to life. This includes:\nBackend Game Logic Development: Building out the sophisticated off-chain systems for real-time matchmaking, secure player data management, and robust anti-cheat measures.\nGame Engine Integration: Connecting the lobby and backend systems to a game engine to render the immersive world and high-fidelity combat of Fracture Point.\nProof of Play Loop Refinement: Fully integrating in-game actions with our GameAchievementRegistry.sol via the Alith Oracle to ensure every skill-based action is verifiable and contributes to player progression and potential future GHC earnings.\nThis is an incredibly exciting time for Fracture Point. We invite you to join our community as we build the next evolution of TPS gaming, truly owned and driven by its players.\nJoin our community and stay updated!\nTelegram\nFracture Point\nYou can view and join @fracturepointlabs right away.\nDiscord\nJoin the Fracture Point Discord Server!\nCheck out the Fracture Point community on Discord – hang out with 2 other members and enjoy free voice and text chat.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!",
        "comments_details": [
            {
                "author": "i_am_supaman_lj",
                "comment": "We are thrilled to unveil a monumental leap in the development of Fracture Point, our upcoming tactical TPS game. While our interactive lobby prototype provides a glimpse into the player experience, the true revolution lies in the meticulously crafted on-chain smart contracts and the robust Alith Architecture that power our innovative Proof of Play ecosystem.\nThis past month has been dedicated to building the immutable bedrock of Fracture Point’s Web3 capabilities, focusing on decentralized ownership, verifiable progression, and a player-driven economy.\nFracture Point: The Game Skill, Strategy, and True Digital Ownership\nFracture Point is designed as a high-octane, tactical third-person shooter that demands precision, strategic thinking, and teamwork. We are building a fiercely competitive environment where your skill and dedication are not just recognized, but are fundamentally integrated into the game’s core value system.\nPrepare for:\nIntense FPS Combat: Master diverse weapon loadouts and tactical maneuvers in dynamic, high-stakes engagements.\nDeep Customization: Personalize your agents and unique “variants”, making your mark on the battlefield.\nCompetitive Progression: Climb verifiable leaderboards, earn genuine rewards, and truly own your in-game achievements.\nThe Proof of Play Revolution: Rewarding Skill On-Chain\nOur commitment to Proof of Play is the defining feature of Fracture Point. This is not a concept; it’s a core, on-chain mechanism ensuring that your active engagement and skillful performance directly translate into verifiable, immutable value and progression within the game’s ecosystem.\nHow Proof of Play works in Fracture Point, powered by our contracts:\nVerifiable Achievements: Through the GameAchievementRegistry.sol contract (which is part of our ClaimManager system), your significant in-game achievements and progression milestones are immutably recorded on the blockchain. This provides transparent, provable recognition for your dedication and skill.\nSkill-Based Rewards: Our FPToken (FracturePoint Token), serving as XP, is minted to players based on their in-game performance (e.g., in Rift events), authorized exclusively by our trusted Alith Oracle. This ensures that rewards are earned through genuine gameplay.\nOn-Chain Progression & Badges: Your accumulated FPToken (XP) can then be burned via the ClaimManager contract to claim unique Rank Badges (ERC-721 NFTs) from the RankBadge.sol contract, signifying your seasonal achievements and skill tier. This process is entirely on-chain, making your rank verifiable and owned.\nPlayer-Driven Ecosystem: This interconnected system ensures that the game’s economy and value are directly influenced and shaped by the collective activity and skilled contributions of its player base.\nThis ensures Fracture Point rewards genuine skill, time invested, and proven performance, fostering a fair, transparent, and truly player-owned gaming experience.\nOur Core Architecture: Dedicated Smart Contracts and The Alith Framework\nThe true innovation behind Fracture Point lies in its robust, interconnected smart contracts and the strategic implementation of the Alith Architecture.\n1. The Alith Architecture: Our Tailored Blockchain Game Framework\nFracture Point leverages a bespoke implementation of the Alith Architecture. This is our comprehensive, modular framework meticulously designed to seamlessly integrate blockchain technology without compromising gameplay performance. It intelligently separates:\nOn-Chain Components: Our smart contracts (FPToken, RankBadge, ClaimManager) handle critical, immutable data like XP (FPToken) balances, Rank Badge (NFT) ownership, and verifiable achievements. This ensures decentralization, security, and provable ownership. The Alith Oracle acts as the trusted off-chain authority that bridges game outcomes to on-chain actions, such as distributing XP and authorizing badge claims.\nOff-Chain Backend: High-frequency game logic, real-time matchmaking, complex physics calculations, and volatile player statistics run on a performant off-chain backend. This guarantees a smooth, low-latency, and responsive gameplay experience, unburdened by blockchain transaction times and gas costs.\nSecure Interoperability: A robust and auditable communication layer ensures seamless and secure data flow between our contracts (governed by the Alith Oracle) and the off-chain game server.\n2. Fracture Point’s Core Smart Contracts (Audited & Interconnected)\nWe have successfully designed, developed, and prepared for deployment the foundational smart contracts that power Fracture Point’s Web3 economy and the Proof of Play mechanics. These contracts work in concert:\nFPToken.sol (FuturePoint Token) : This ERC-20 token represents XP within the Fracture Point ecosystem. It’s designed specifically for in-game progression:\nMinted by Alith Oracle: Only the designated alithOracle can mint new FPToken to players (e.g., via distributeRiftXP) based on game outcomes.\nBurned by ClaimManager: The ClaimManager contract is uniquely authorized to burn FPToken (XP) from player balances when they claim Rank Badges, creating a clear utility and economic loop.\nNon-Transferable (Player-to-Player): Significantly, direct player-to-player transfers of FPToken are disabled. This ensures FPToken remains a pure XP/progression token, preventing speculative trading and focusing its value on in-game achievement.\nRankBadge.sol (Fracture Point Rank Badge) : This ERC-721 NFT contract represents unique, season-specific Rank Badges that players can earn.\nMinted by ClaimManager: Only the ClaimManager contract is authorized to mint new Rank Badges to players, ensuring badges are earned through the proper Proof of Play mechanism.\nImmutable On-Chain Proof: Each badge is a unique NFT, providing verifiable, immutable proof of a player’s achievement for a given season and rank.\nClaimManager.sol : This is the central orchestrator contract, linking FPToken (XP) to Rank Badges (NFTs) and acting as the bridge to the Alith Oracle.\nManages Badge Claims: Players claim badges via ClaimManager, which then verifies their XP balance, burns the necessary FPToken from their account, and instructs RankBadge.sol to mint the new NFT.\nSeason Management: It tracks the currentSeason, ensuring players can only claim one badge per season.\nKarma Evaluation Requests: It facilitates requests for off-chain “Karma” evaluations by the Alith Oracle, hinting at deeper player behavior analysis.\nAlith Oracle Integration: It designates and relies on the alithOracle for authorizing badge claims and distributing rewards based on verified game data.\nThe code for these foundational contracts and the full Alith Architecture implementation can be reviewed in our public repository: https://github.com/SUPAMAN-dev/fracture-point-hyperhack\nYou can also verify our currently deployed contract addresses on the Hyperion testnet network: https://hyperion-testnet.metisdevops.link/\nFPToken Address: 0x4D23a7A2231624F1486CE0dE07C2fbF002f751B9\nClaimManager Address: 0x1Dab96d049e3ce56D51e6B0b149477927B897FFb\nRankBadge Address: 0xBB84D771f6aef01f00dEE45D9C9dF9C7ef9159e5\n(Note on GHC: While not currently on-chain, the fixed supply GHC currency, managed by multisig, will form the broader economic layer of Fracture Point. Its design ensures seamless future integration with our on-chain systems when the time is right, complementing the FPToken XP system.)\nLobby Prototype: The Player’s Interactive Gateway\nComplementing this powerful blockchain backend, our functional lobby prototype provides the intuitive player-facing interface. It allows players to:\nSeamlessly navigate between game modes, customization options, and personal profiles.\nExperience a polished UI/UX that aligns with Fracture Point’s futuristic theme.\nInteract with the foundational elements for future wallet integration, demonstrating how players will connect their on-chain assets to the game.\nLink to the prototype demo: https://youtu.be/aI_lQ6DcwEI\nEcosystem Interest: Strategic Offer from Plurality Web3\nAs a direct result of our development efforts during this Hyperion Hackathon, Fracture Point attracted partnership interest from leading Web3 infrastructure teams, most notably Plurality Web3, a startup pioneering embedded identity and authentication infrastructure for dApps.\nPlurality offered us a 12-month support package under their Partner Program, which includes:\n1:1 Engineering Support for seamless integration of user authentication and personalized in-game logic.\nFree infrastructure credits to cover authentication, user session tooling, and zkTLS-powered identity gating.\nUX Collaboration to co-design smooth onboarding flows without popups or clunky wallets particularly valuable for our casual-to-core player conversion goals.\nTheir outreach came after they reviewed Fracture Point’s Hyperion-backed Proof of Play system and saw clear potential for adoption in competitive Web3 gaming.\nWe view this offer as both validation of our underlying architecture and a strategic complement to the low-cost, high-throughput infrastructure that Hyperion enables. These ecosystem synergies affirm that Fracture Point is not just a playable demo, but a platform being taken seriously by early infrastructure players.\nWhat’s Next for Fracture Point?\nWith the core blockchain architecture, smart contracts, and the lobby interface firmly established, our immediate next steps are to integrate these powerful systems with the actual game engine to bring the full combat experience to life. This includes:\nBackend Game Logic Development: Building out the sophisticated off-chain systems for real-time matchmaking, secure player data management, and robust anti-cheat measures.\nGame Engine Integration: Connecting the lobby and backend systems to a game engine to render the immersive world and high-fidelity combat of Fracture Point.\nProof of Play Loop Refinement: Fully integrating in-game actions with our GameAchievementRegistry.sol via the Alith Oracle to ensure every skill-based action is verifiable and contributes to player progression and potential future GHC earnings.\nThis is an incredibly exciting time for Fracture Point. We invite you to join our community as we build the next evolution of TPS gaming, truly owned and driven by its players.\nJoin our community and stay updated!\nTelegram\nFracture Point\nYou can view and join @fracturepointlabs right away.\nDiscord\nJoin the Fracture Point Discord Server!\nCheck out the Fracture Point community on Discord – hang out with 2 other members and enjoy free voice and text chat.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!"
            }
        ]
    },
    {
        "id": "68d4c6cb134584d5",
        "topic_id": "5537",
        "title": "[MetaPay] A Circulating Basic Income Model with Digital Currency",
        "url": "https://forum.ceg.vote/t/metapay-a-circulating-basic-income-model-with-digital-currency/5537",
        "views": "",
        "comments": "27",
        "created_date": "Jun 12, 2025 11:25 pm",
        "latest_activity": "Jul 3, 2025 5:00 pm",
        "content": "[MetaPay] A Circulating Basic Income Model with Digital Currency\nOverview\nMetaPay is a programmable, circulating basic income system that distributes funds through digital wallets and recollects a fixed percentage to ensure sustainability — without raising taxes or relying on additional government budgets.\nProblem\nMost basic income proposals fail due to unrealistic funding models. They often depend on higher taxation, increasing national debt, or complex redistribution mechanisms that generate political resistance and economic inefficiencies.\nOur Solution\nMetaPay operates on a simple yet powerful loop:\nAn initial fund of 250 trillion KRW\nDistributed over 10 months (25 trillion KRW/month)\nStarting from month 10, 10% of each wallet’s remaining balance is recollected at the end of each month\nThe recollected funds are used to fund the next cycle\nThis creates a self-sustaining system with zero net government burden and maximum benefit for citizens.\nKey Features\nAll payments and recollections are processed exclusively via digital currency\nWallets automatically split payments: 50% MetaPay + 50% cash or card\nNo restrictions on how the income is used\nHigher-income users contribute more through greater spending, while lower-income users retain full benefit\nFully trackable, automated, and transparent\nWhat We Need\nWe are seeking collaborators who can support:\nSmart contract development\nTokenomics modeling and analysis\nUX/UI simulation and digital wallet architecture\nStress testing on the Hyperion Testnet\nLet’s bring MetaPay to life — and demonstrate how real-world programmable basic income can scale sustainably and fairly.",
        "comments_details": [
            {
                "author": "metapay_gyuha",
                "comment": "[MetaPay] A Circulating Basic Income Model with Digital Currency\nOverview\nMetaPay is a programmable, circulating basic income system that distributes funds through digital wallets and recollects a fixed percentage to ensure sustainability — without raising taxes or relying on additional government budgets.\nProblem\nMost basic income proposals fail due to unrealistic funding models. They often depend on higher taxation, increasing national debt, or complex redistribution mechanisms that generate political resistance and economic inefficiencies.\nOur Solution\nMetaPay operates on a simple yet powerful loop:\nAn initial fund of 250 trillion KRW\nDistributed over 10 months (25 trillion KRW/month)\nStarting from month 10, 10% of each wallet’s remaining balance is recollected at the end of each month\nThe recollected funds are used to fund the next cycle\nThis creates a self-sustaining system with zero net government burden and maximum benefit for citizens.\nKey Features\nAll payments and recollections are processed exclusively via digital currency\nWallets automatically split payments: 50% MetaPay + 50% cash or card\nNo restrictions on how the income is used\nHigher-income users contribute more through greater spending, while lower-income users retain full benefit\nFully trackable, automated, and transparent\nWhat We Need\nWe are seeking collaborators who can support:\nSmart contract development\nTokenomics modeling and analysis\nUX/UI simulation and digital wallet architecture\nStress testing on the Hyperion Testnet\nLet’s bring MetaPay to life — and demonstrate how real-world programmable basic income can scale sustainably and fairly."
            },
            {
                "author": "priyankg3",
                "comment": "Hello\n@metapay_gyuha\n, What happens if users withdraw all funds from their wallet before the 10% recollection?\nHow does the automatic 50/50 split with MetaPay and fiat work at merchant checkouts?"
            },
            {
                "author": "han",
                "comment": "Thanks for sharing the MetaPay vision. really inspiring! With 10% of my wallet balance being recollected monthly, will there be a transparent interface to track this process? Also, can the recollection rate be personalized based on my spending behavior?"
            },
            {
                "author": "metapay_gyuha",
                "comment": "Thank you for your great question and your interest in MetaPay!\nLet me answer each part in detail:\n1. Transparent Interface for Recollection Tracking\nMetaPay is designed so that all users can track both the distribution and recollection of funds in real time through their digital wallets.\nAt the end of each month, users will be able to clearly see:\nThe amount recollected (10% of remaining balance)\nThe amount distributed\nCurrent wallet balance\nFull transaction and recollection history\nMonthly reports will also be provided via the mobile app or web-based wallet interface to ensure full transparency.\n2. About Personalizing the Recollection Rate\nMetaPay maintains a fixed 10% recollection rate for all users.\nThis is because the recollected amount is directly used as the fund for the next month’s distribution.\nIf the rate were to vary by individual, it would break the balance of this self-sustaining cycle and threaten the long-term stability of the system.\nHowever, small demographic changes (such as births or deaths) can be handled through government budget adjustments or annual fiscal planning, without affecting the core 10% structure.\nIf you’re curious about the full MetaPay model, please feel free to visit our YouTube channel.\nWe’ve uploaded videos that explain the core mechanics and philosophy of MetaPay in detail:\nMain Intro Video\nMetaPay – A Circulating Basic Income: Whose Time Are You Living?\nhttps://youtu.be/e4lH_uGN-ck\nVisit Our Channel\nhttps://www.youtube.com/@MetaPayProject\nThank you again for engaging with the project. If you have more questions, we’d love to continue the conversation!\n— MetaPay Project Team"
            },
            {
                "author": "metapay_gyuha",
                "comment": "Thank you for your thoughtful questions! Let me explain each point clearly.\n1. What happens if a user withdraws all MetaPay before the 10% recollection at the end of the month?\nMetaPay is a closed-loop digital system that cannot be freely withdrawn as cash.\nAll MetaPay balances are managed within your digital wallet and cannot be transferred directly to others or exchanged into fiat currency.\nEven if you attempt to use up all of your balance before the end of the month, the system will calculate the recollection amount based on your wallet balance at that exact time (e.g., 10% of the remaining amount on the last day of the month).\nThis ensures fairness and sustainability, regardless of spending patterns.\n2. How does the automatic 50/50 split payment work between MetaPay and fiat currency?\nWhenever you make a payment at a registered merchant, your wallet automatically splits the transaction:\n50% is paid using MetaPay, and 50% using your existing payment method (cash, credit, etc.).\nThis is enforced by the system and does not require manual input by the user or merchant, maintaining simplicity and compliance.\nIt also ensures MetaPay is circulated and reclaimed properly within the system.\nWant to explore the MetaPay model in detail?\nCheck out the official video and YouTube channel, where we explain the philosophy and mechanism of MetaPay.\nIntro Video\nMetaPay Circulating Basic Income – “Whose time is it, really?”\n메타페이순환형 기본소득 : 당신의 시간은 누구의 것입니까?\nFull Channel\nYouTube\nMetaPay Project\nShare your videos with friends, family, and the world\nWe believe MetaPay is not just about distributing money—\nit’s about restoring your time, freedom, and dignity.\nLet’s build this future together."
            },
            {
                "author": "priyankg3",
                "comment": "Thanks for the detailed explanation! That clears up both points really well.\nWill definitely check out the video to understand the bigger picture better. Appreciate the quick response!"
            },
            {
                "author": "metapay_gyuha",
                "comment": "[HyperHack Submission] MetaPay – A Circular Basic Income Simulator on Web3\nProject Name: MetaPay\nOne-line Description:\nA self-sustaining basic income simulator using smart contracts and Web3 wallets to solve inequality, restore political trust, and reduce welfare inefficiencies.\nProblem Statement\nMost basic income models struggle due to three major reasons:\nUnsustainable funding (e.g., new taxes or debt)\nPublic distrust in fair distribution\nDisruption to existing welfare systems\nMetaPay introduces a fully digital, autonomous solution that avoids new taxation, ensures transparency via smart contracts, and operates in parallel with current welfare structures.\nSolution\nMetaPay distributes ₩500,000 (~$370) monthly to 50 million citizens via Web3 wallets.\nAll transactions are digitally trackable\nSmart contracts govern issuance, use, and recollection\nAfter 10 months, 10% of remaining wallet balances are recollected to fund the next round, creating a circular, self-replenishing cycle\nUser Flow (Example)\nA citizen receives ₩500,000 in their MetaPay wallet\nThey make a purchase—payment is split 50:50 between MetaPay and cash/card\nUnused MetaPay remains untouched\nAt the end of month 10, 10% of the remaining amount is recollected\nThat amount funds the next distribution\nNo expiration, no loss if spent—just gentle nudging toward use\nSimulation Results (Based on Pilot Assumptions)\n84% average utilization rate per user/month\n19% increase in local SME revenue\nEstimated ₩2.3 trillion additional tax revenue in first year\nNo inflation impact due to controlled injection/recollection loop\n(Detailed modeling in SSRN paper)\nTech Stack\nWeb3 Wallets (MetaMask, Hyperion Wallet)\nEVM-Compatible Smart Contracts (ERC20-like logic)\nAlith ZK-ID Integration (for Sybil resistance)\nAI Policy Simulation Engine (Python ML)\nUX/UI Design Tools (Figma, no-code prototypes)\nAlith ZK-ID Scenario\nTo ensure fairness in decentralized networks:\nEach wallet is linked to a unique identity via Zero-Knowledge Proofs\nNo personal data shared—privacy fully preserved\nPrevents wallet duplication or “Sybil attacks” during distribution\nThis enables equitable and secure distribution even across unbanked or pseudonymous populations.\nWhy MetaPay Matters\nNo new taxes, no system overhaul\nTransparent governance via open-source contracts\nRestores political trust and boosts civic engagement\nReduces unemployment without discouraging job-seeking\nWorks alongside existing welfare programs\nDemo & Repos\nDemo video: https://youtu.be/e4lH_uGN-ck\nGitHub: MetaPay – A Web3-based Circular Basic Income Simulator\nTestnet dApp: MetaPay UI Demo\nPilot & Collaboration Plan\nWe are seeking to pilot MetaPay with:\nSmall EU municipalities (e.g., Estonia, Portugal)\nDecentralized communities or DAOs\nNGOs & academic institutions interested in Web3-driven policy\nLet’s test a real-world basic income loop without the usual frictions.\nForum ID: metapay_gyuha\nLooking Forward\nMetaPay isn’t just a simulator—it’s a prototype for real policy.\nJoin us to co-create the next generation of digital, fair, and circular basic income.\nLet’s build not only systems, but trust.\nDM or comment below if you’d like to collaborate, test, or fork MetaPay."
            },
            {
                "author": "metapay_gyuha",
                "comment": "MetaPay Circulation Structure Visualization (Updated)\nMetaPay is not just about distribution—it is a self-sustaining, circular basic income model that continuously operates through automatic recollection and redistribution using digital currency.\nWithout any need for long-term tax increases or additional government spending, the initial KRW 250 trillion investment enters an infinite loop of monthly distribution and recollection—creating a durable, automated system.\nThe chart below visualizes how the MetaPay system operates over time:\nInitial Capital: KRW 250 trillion (distributed over 10 months at KRW 25 trillion per month)\nImportantly, this initial capital is not a sunk cost.\nAs basic income boosts consumption and economic activity, increased tax revenue can be used to repay the original KRW 250 trillion—without cutting existing programs or raising new taxes.\nRecollection Start: From month 10.5 onward, 10% of each wallet’s remaining balance is automatically recollected at the end of every month\nRecollected Funds: Fully reused as the source of next month’s distribution\nResult: A perfectly circular economic loop with zero net fiscal burden\n“This model can be piloted in small EU nations by adjusting the distribution-to-recollection ratio to fit local GDP.”\nChart Breakdown\nGreen Bars (Distribution): KRW 25 trillion distributed each month\nRed Bars (Recollection): KRW 25 trillion recollected monthly starting at month 10.5\nBlue Line (Cumulative Balance): Tracks the total circulating balance\n→ It rises for the first 10 months, then stabilizes at KRW 250 trillion\n→ This equilibrium is maintained as long as distribution and recollection stay synchronized.\nGlobal Applicability & Pilot Readiness\nMetaPay is designed with a simple mathematical formula that is independent of any specific country’s tax laws or welfare system:\nDistribution (B) = Fixed amount (e.g. 25T)\nRecollection (R) = 10% of wallet balance at the end of the month\nIf B = R → The system becomes self-sustaining\nBecause of this, MetaPay can be implemented anywhere by adjusting only the base amount according to local GDP or population. For instance:\nA small EU country with 5 million people could adjust the monthly benefit per person according to national GDP, while keeping the 10% recollection rule intact.\nThis makes MetaPay ideal for pilot testing in:\nSmall EU member states (e.g., Estonia, Slovenia, Portugal)\nDecentralized communities or digital welfare zones\nInternational policy labs with limited fiscal risk\nMetaPay proves that basic income can be self-sustaining, programmable, and globally adaptable—without requiring new taxes.\nLet’s co-create a fairer digital future that begins with circulation, not debt.\nComing next: Technical Architecture & DID-based Identity Integration (Bonus Track)"
            },
            {
                "author": "metapay_gyuha",
                "comment": "MetaPay Technical Architecture & Identity Layer (Bonus Track)\nTo complement the policy design, this section introduces the technical backbone of MetaPay—integrating decentralized identity, biometric verification, and programmable smart contracts.\nThis architecture enables a secure, automated, and globally scalable basic income system using blockchain and verifiable digital identity.\nSystem Overview\nMetaPay operates through the following core technical layers:\nBiometric Verification (Alice)\nFace recognition ensures each user holds only one MetaPay Wallet (1-person-1-wallet).\nDecentralized ID (DID) + Verifiable Credential (VC)\nAfter facial verification, users are issued a VC that proves their identity without exposing private information.\nSmart Contract\nGoverns income distribution, 10% recollection, and identity verification logic.\nMetaPay Wallet\nAutomatically receives monthly income and recollects 10% of the remaining balance.\nOff-chain Ledger\nOptionally used by governments or institutions to transparently log transactions without storing personal data.\nFlow Summary\nAlice verifies the user’s face during onboarding.\nA Verifiable Credential (VC) is issued and linked to the user’s DID.\nThe VC is submitted to the Smart Contract for validation.\nOnce approved, the contract distributes monthly income to the user’s MetaPay Wallet.\nAt the end of each month, 10% of the wallet’s remaining balance is automatically recollected.\nAll events are transparently recorded to a government or institutional ledger (if applicable).\nTech Stack\nSmart Contracts: Solidity-based, Ethereum-compatible logic\nID Layer: DID + VC + biometric (Alice) integration\nZKP (Zero-Knowledge Proofs): Enables identity verification without revealing personal data\nWallet: MetaMask / Hyperion Wallet customized for MetaPay circulation\nLedger: Off-chain transparency layer for auditing (regional option)\nGlobal Scalability\nThis architecture supports:\nCross-border pilot projects in digital ID-ready regions (e.g., Estonia, Slovenia, Portugal)\nFull compliance with EU Digital Identity Wallet (EUDI Wallet) standards\nAdjustable payout amounts based on national GDP, while maintaining the fixed 10% recollection structure\nArchitecture Diagram – Identity-Integrated Circulation Flow\nVisual representation of MetaPay’s end-to-end system:\nFacial verification (Alice)\nCredential issuance (DID + VC)\nSmart contract logic\nWallet automation\nTransparent recordkeeping\nDiagram: Secure identity-linked basic income distribution and recollection process\nMetaPay is not just a basic income system—\nIt’s verifiable, programmable, and globally adaptable by design.\nLet’s co-create a transparent economic future that begins with circulation, not debt.\nArchitecture Diagram – Identity-Integrated Circulation Flow\nDiagram: Secure identity-linked basic income distribution and recollection process"
            },
            {
                "author": "priyankg3",
                "comment": "Hello\n@metapay_gyuha\n, It would be great to see your project featured in a Vibe session! If you’re interested in applying and showcasing then, I’d really love to see how Hyperion is involved in your project’s vision. If you have a demo to show us, that would be even better."
            },
            {
                "author": "metapay_gyuha",
                "comment": "Thank you\n@priyankg3\nfor your kind message — I’m honored that MetaPay is being considered for a Vibe session!\nTo be transparent, the demo DApp is currently in development, and we’ve encountered a technical issue during Remix deployment. That said, the core logic — including distribution, recollection, and the self-sustaining loop — has already been implemented.\nThe simulation is designed to demonstrate how Hyperion-compatible wallets and smart contracts automate the cycle. We’re actively working to resolve the issue and finalize a testnet version.\nI’d love to share the demo here as soon as it’s ready.\nAppreciate the opportunity and look forward to contributing further!"
            },
            {
                "author": "metapay_gyuha",
                "comment": "MetaPay – A Circulating Basic Income Model Using Digital Currency\nTechnical Overview for Ideathon Submission\n1. Project Summary\nProject Name: MetaPay\nDomain: Web3, Digital Currency, Public Policy, Universal Basic Income, Privacy (ZK-ID)\nMetaPay is a programmable, circulating basic income system that enables sustainable redistribution without raising taxes. It operates entirely through digital currency and blockchain infrastructure, ensuring economic inclusion and policy transparency. Importantly, MetaPay is designed to work alongside existing welfare programs—supporting, not replacing, traditional social protections.\n2. Technical Structure & Flow\nCore Mechanism:\nAn initial capital of 250 trillion KRW is distributed over 10 months (25 trillion/month) via Web3 wallets. From month 11, 10% of each wallet’s remaining balance is automatically recollected and reused for the next cycle—forming an infinite redistribution loop that requires no additional taxes or external funding.\nDistribution Cycle:\nEach citizen receives 500,000 KRW per month in MetaPay\nPayments are made through digital wallets\nAll purchases are auto-split: 50% MetaPay + 50% fiat (cash, card, etc.)\nPayment patterns are transparently trackable, no manual input needed\nRecollection Cycle:\nAt the end of each month (starting month 11), 10% of leftover wallet balance is recollected\nThese funds become the source of the next month’s universal distribution\nNo penalties or restrictions—recollection applies only to unused MetaPay\nZK-ID Integration: To ensure fairness and prevent abuse:\nFacial recognition via Alice biometric layer during onboarding\nDID (Decentralized ID) and VC (Verifiable Credential) issued per person\nSmart contracts verify uniqueness (1 wallet per person) without revealing private data\n3. Policy Relevance & Feasibility\nSubmitted to South Korea’s national digital democracy platform\nPolitically safe: No interference with welfare or pension systems\nTechnically versatile: Works with national ID infrastructure or ZK-ID-only regions\nFinancially circular: System sustains itself without future tax increases\n4. Public Engagement & Tools\nTestnet-based simulator (distribute → recollect → redistribute)\nYouTube explainer: “Whose Time Are You Living?”\nAll smart contracts are open-source and modular (on GitHub)\nSystem interoperable with Polygon ID, Semaphore, Worldcoin ZK stack\n5. Technical Stack\nSmart Contracts: Solidity (ERC20 logic, programmable recollection)\nWallet: MetaMask, Hyperion Wallet (custom UI with auto-split logic)\nIdentity: Biometric face scan + DID + VC (ZK-proof)\nLedger: Optional off-chain ledger for institutional use\nFrontend: React, Web3.js\nSimulation: Vercel-hosted interactive DApp\nMetaPay is more than a prototype. It’s a scalable blueprint for fair, transparent, and programmable digital basic income."
            },
            {
                "author": "metapay_gyuha",
                "comment": "MetaPay – Visual Tech Summary\nThis 1-page summary illustrates how MetaPay enables a sustainable circular basic income using digital wallets, DID/ZK-ID verification, and smart automated fund recycling. Designed to be clear for both developers and policymakers.\nKey structure:\n• ₩25T distributed monthly\n• 10% recollected from wallet balances every month-end\n• Reused for next cycle – no tax increase needed\n• Verified via secure ZK-ID logic\nPDF Download: MetaPay_Visual_TechSummary_EN.pdf\nContact: metapay.gyuha@gmail.com\nYouTube Explainer: https://youtu.be/e4IH_uGN-ck"
            },
            {
                "author": "metapay_gyuha",
                "comment": "MetaPay – Circulating Basic Income DApp: Full Test Completed\nFollowing the previous policy design submission, we have now completed a working DApp prototype of the MetaPay model – a self-sustaining, tax-free basic income system based on monthly distribution and digital recollection.\nThe DApp was developed using:\nSolidity for smart contract logic\nVite + React for front-end\nMetaMask integration for all transactions (wallet connection, signing, gas usage)\nEthers.js for contract interaction\nLocal simulation of wallet ecosystem (1 owner + 5 virtual wallets)\nThe core mechanism is as follows:\nEvery month, the owner (government) distributes ₩500,000 worth of basic income to each citizen’s wallet.\nOn the 10th month, 10% of the remaining balance is automatically recollected per wallet.\nThis collected amount (₩25 trillion equivalent in simulation) becomes the next month’s funding source.\nThe cycle then repeats endlessly without the need for new taxation or deficit spending.\nIn the simulation:\nWe distributed funds 5 times to 5 wallets.\nEach distribution reduced the owner balance and increased user balances accurately.\nAfter triggering collect(), exactly 10% of each balance was recollected and transferred back to the owner.\nAll balances were checked in real-time through the UI.\nMetaMask popped up for every transaction (signing/confirmation), confirming real smart contract interaction.\nWe recorded a 2-minute full-screen demo video showing:\nWallet connection\n5x distributions (with UI & balance changes)\nFinal recollection (with updated balances and contract status)\nMetaMask interactions\nVisual proof of automatic logic and gas-based validation\nThis prototype reflects the technical feasibility of the architecture I submitted in the Bonus Track, including:\nIdentity-linked DID logic (to be integrated later)\nTransparent on-chain tracking\nPeriodic smart contract triggers\nReal wallet-based simulation of macro-scale economy\nMetaPay aims to solve a universal economic challenge: how to provide universal basic income without additional taxation or inflation, while ensuring transparency and long-term sustainability.\nI’d love to present this prototype in an unofficial Vibe Session, if possible. Please let me know if that could be arranged\nThe video demo and DApp can be shared upon request. Feedback and collaboration welcome!"
            },
            {
                "author": "metapay_gyuha",
                "comment": "Can Basic Income Work Without Taxes?\nMetaPay DApp Simulation Completed – Feedback Welcome\nHi HyperHack team and community\nI’ve developed a DApp prototype of the MetaPay Circulating Basic Income Model, which demonstrates a structure where a single initial fund circulates permanently without new taxes.\nThis post shares our simulation results and invites your feedback on the current build.\nTL;DR\nDistributed ₩500,000 to each of 5 wallets (5 rounds tested)\n10% recollection per wallet works as expected\nReal-time UI updates + MetaMask integration confirmed\nAll actions are manually triggered via buttons\nFeedback requested on real wallet usage & automated logic\nWhat Works in the Current Version\nThe admin wallet (government) successfully distributed ₩500,000 to each of 5 test wallets, five times\nOn clicking collect(), 10% of each wallet’s balance was recollected and returned to the admin wallet\nBoth distribution and recollection are executed manually via user-triggered buttons\nThe demo video shows 5 rounds of distribution followed by 1 recollection, all via visible button clicks\nAll balances updated in real-time through the UI, and all transactions were processed via MetaMask with proper gas fees and confirmation\nSmart Contract Core Logic\ndistribute() – sends ₩500,000 to each user in the list\ncollect() – recalls 10% of each wallet’s current balance\nBalances are stored in: mapping(address => uint256) public balanceOf\nAll actions require MetaMask signature and gas confirmation\nWhy We Used a Simplified Test Setup\nTo ensure stability and repeatability, the simulation used 5 hard-coded virtual wallet addresses\nInitial tests with real MetaMask wallets encountered intermittent issues (e.g., gas estimation failure, RPC errors)\nSo, we focused first on verifying the core distribution-recollection loop in a controlled environment\nWhat’s Next\nIntegrate real MetaMask-connected user wallets\nAdd DID or ZK-based identity verification\nImplement scheduled/condition-based triggers for distribution & recollection\nScale test with 100+ wallets for full simulation and stress testing\nDemo Video (2 minutes)\nThe video demonstrates how MetaPay works in practice:\nWallet connection → 5x distribution via button clicks → 1 recollection → UI balance updates → MetaMask confirmations\nWatch the Demo (Google Drive)\nFeedback Requested\nIf you have a moment, we’d really appreciate your thoughts on:\nIs it acceptable to use hard-coded virtual wallets for PoC simulations at this stage? (Yes/No)\nAny known tips or best practices for stabilizing real wallet use in test environments?\nDo you recommend specific tools (e.g., Chainlink, schedulers) for automating periodic smart contract execution?\nMetaPay is an experimental attempt to turn a tax-free, self-sustaining basic income system into functioning code.\nWe know it’s not perfect yet, but we hope it sparks curiosity and collaboration.\nThank you very much for your time"
            },
            {
                "author": "metapay_gyuha",
                "comment": "Can Basic Income Work Without Taxes?\nMetaPay DApp Simulation Completed – Feedback Welcome\nHi HyperHack team and community\nI’ve developed a DApp prototype of the MetaPay Circulating Basic Income Model, which demonstrates a structure where a single initial fund circulates permanently without new taxes.\nThis post shares our simulation results and invites your feedback on the current build.\nTL;DR\nDistributed ₩500,000 to each of 5 wallets (5 rounds tested)\n10% recollection per wallet works as expected\nReal-time UI updates + MetaMask integration confirmed\nAll actions are manually triggered via buttons\nFeedback requested on real wallet usage & automated logic\nWhat Works in the Current Version\nThe admin wallet (government) successfully distributed ₩500,000 to each of 5 test wallets, five times\nOn clicking collect(), 10% of each wallet’s balance was recollected and returned to the admin wallet\nBoth distribution and recollection are executed manually via user-triggered buttons\nThe demo video shows 5 rounds of distribution followed by 1 recollection, all via visible button clicks\nAll balances updated in real-time through the UI, and all transactions were processed via MetaMask with proper gas fees and confirmation\nSmart Contract Core Logic\ndistribute() – sends ₩500,000 to each user in the list\ncollect() – recalls 10% of each wallet’s current balance\nBalances are stored in: mapping(address => uint256) public balanceOf\nAll actions require MetaMask signature and gas confirmation\nWhy We Used a Simplified Test Setup\nTo ensure stability and repeatability, the simulation used 5 hard-coded virtual wallet addresses\nInitial tests with real MetaMask wallets encountered intermittent issues (e.g., gas estimation failure, RPC errors)\nSo, we focused first on verifying the core distribution-recollection loop in a controlled environment\nWhat’s Next\nIntegrate real MetaMask-connected user wallets\nAdd DID or ZK-based identity verification\nImplement scheduled/condition-based triggers for distribution & recollection\nScale test with 100+ wallets for full simulation and stress testing\nDemo Video (2 minutes)\nThe video demonstrates how MetaPay works in practice:\nWallet connection → 5x distribution via button clicks → 1 recollection → UI balance updates → MetaMask confirmations\nWatch the Demo (Google Drive)\nFeedback Requested\nIf you have a moment, we’d really appreciate your thoughts on:\nIs it acceptable to use hard-coded virtual wallets for PoC simulations at this stage? (Yes/No)\nAny known tips or best practices for stabilizing real wallet use in test environments?\nDo you recommend specific tools (e.g., Chainlink, schedulers) for automating periodic smart contract execution?\nMetaPay is an experimental attempt to turn a tax-free, self-sustaining basic income system into functioning code.\nWe know it’s not perfect yet, but we hope it sparks curiosity and collaboration.\nThank you very much for your time"
            },
            {
                "author": "metapay_gyuha",
                "comment": "@han\nHello! I wanted to kindly bring to your attention a feedback request I shared above on the MetaPay DApp simulation. It’s a PoC exploring tax-free basic income through digital currency. If you have a moment to take a look or share any insights, it would mean a lot. Thank you in advance!"
            },
            {
                "author": "han",
                "comment": "Thanks for the reminder! I’ll check out the MetaPay DApp simulation soon and share my thoughts. Appreciate you looping me in!"
            },
            {
                "author": "metapay_gyuha",
                "comment": "MetaPay – Looking for UI/UX feedback and simulation testers!\nHi builders and thinkers\nI’m currently working on MetaPay, a Web3-based circular basic income simulator designed to prove that Universal Basic Income (UBI) can be sustainable — without raising taxes.\nWhat is MetaPay?\nMost UBI models struggle with:\nLack of sustainable funding\nTax burdens and redistribution resistance\nOne-way payouts with no structural loop\nMetaPay solves this through a self-sustaining cycle:\nDistribute 500 MetaPay tokens monthly to users\nReclaim 10% of unspent MetaPay at the end of each round\nUse reclaimed tokens to fund the next round\n→ A repeatable “Distribute → Reclaim → Redistribute” loop\n→ Inflation-proof, transparent, and gamified via smart contracts\nTech Stack\nVite + React + ethers.js (Frontend)\nSolidity (EVM Smart Contract)\nManual wallet simulation for now (Next: full automation)\n10 test wallets simulate circulation\nFull code & ABI on GitHub\nResources\nLive DApp (manual simulation):\nhttps://meta-pay.vercel.app\nGitHub repo:\nhttps://github.com/metapay-creator/MetaPay\nDemo video:\nhttps://drive.google.com/file/d/1e-N4DTBXr-xJYKlSI05Vw90m7eNmLPCQ/view\nYouTube intro (Concept & simulation):\nhttps://youtu.be/e4lH_uGN-ck\nI Need Help With:\nUI/UX feedback for wallet view + token flow clarity\nSuggestions for gamification (leaderboard? badges?)\nHelp with animation, dashboard graphs or time-loop UI\nAny thoughts on economic/policy realism & terminology\nI’m also planning a real-time simulation event (with 10 users, multiple rounds over 20 minutes). If you’re interested, let me know — you’ll receive a MetaPay test wallet and get featured on X\nComment or DM if you want to test, collaborate, or just share ideas.\nLet’s build something that can shift real-world policy with transparent code\n\n#HyperHack #MetaPay #BasicIncome #Web3 #SocialImpact #Hackathon #BuildInPublic"
            },
            {
                "author": "metapay_gyuha",
                "comment": "Project: MetaPay – Circulating Basic Income with Smart Contracts\nMetaPay is a self-sustaining basic income system built on smart contracts and digital currency.\nIt distributes a fixed amount monthly to citizen wallets and recollects a small portion of unused balances to fund future payments.\nThis creates a sustainable economic loop without requiring additional taxation.\nGitHub (Source code): GitHub - metapay-creator/MetaPay-\nDemo Video: Link will be posted after the Vibe session (July 2nd)\nTest DApp: Not deployed yet – available in GitHub repository\nFeedback and collaboration are always welcome!"
            }
        ]
    },
    {
        "id": "7e5cb990675a4a0e",
        "topic_id": "6125",
        "title": "ProofDAO - zero-knowledge proof system for trustless DAO task verification",
        "url": "https://forum.ceg.vote/t/proofdao-zero-knowledge-proof-system-for-trustless-dao-task-verification/6125",
        "views": "",
        "comments": "0",
        "created_date": "Jul 3, 2025 1:52 pm",
        "latest_activity": null,
        "content": "Project Name\nProofDAO - zero-knowledge proof system for trustless DAO task verification\nProblem Statement\nDAO’s and on-chain companies often struggle to trust contributors without prior relationships. Not only that, they are sometimes unable to track microtask completion in a trust minimized way and filter quality contributors without KYC or resumes.\nSolution Overview\nA decentralized platform where DAO’s can post microtasks or bounties, and contributors submit work along with zk-proofs or attestations of skill. The system verifies completion and auto-rewards based on DAO rules.\nProject Description\nOur project, ProofDAO, is a decentralized platform that allows DAO’s and Web3 projects to post microtasks (like design, dev work, translations, marketing) and have contributors complete them in a trustless, reputation-based way. The main goal is to let DAO’s tap into global talent without having to rely on traditional CV or trust assumptions.\nThe platform works in a simple way that is DAO’s create bounties with rewards, contributors submit their work along with some form of identity proof (either linking GitHub or Twitter, or basic on-chain reputation NFT) and upon approval, they get rewarded. We’re also experimenting with simulating zero-knowledge proofs (or lightweight attestations) just to show how trustless verification of skills can work without fully revealing someone’s identity.\nThe smart contracts will be deployed on Metis and the good thing is it’s EVM compatible and gas fees are really low, which makes it perfect for micro-transactions. We’ll also integrate the Metis DAC framework to show how actual DAO workflows can function on-chain. Frontend will probably be in Next.js with wagmi and rainbowkit for wallet connection.\nI think what excites us the most is that this idea is actually useful. It’s not just another DeFi toy, DAO’s do need better tools for trustless coordination, and this project could really help reduce friction for contributors trying to break into the space.\nHyperion’s architecture gives us a powerful foundation to supercharge ProofDAO in several ways:\nAI Co-Agent for Task Validation: One of the trickiest parts of managing bounties or microtasks is ensuring submissions are both relevant and high quality. Hyperion’s built-in AI co-agent could help us automate task review, either by helping DAO admins filter submissions or flagging ones that match historical patterns of excellence. This would reduce human workload while ensuring consistent quality control.\nOn-Chain AI & Data for Identity Verification: We’re exploring ways to simulate ZK-proofs or lightweight attestations for contributor reputation. With Hyperion’s AI and data pipelines directly on-chain, we can potentially streamline how contributor identities or skills are verified, without forcing full doxxing or heavy KYC. That means contributors can prove credibility without oversharing and DAOs still get the signal they need.\nReal-Time Interactions: Because we’re enabling microtask coordination, the faster the response loop, the better the experience. Hyperion’s low-latency infra lets us build a smoother, more dynamic interface where task submissions, approvals, and feedback can happen almost instantly critical for keeping contributors engaged and reducing friction in DAO workflows.\nScalable Gamification: Our leaderboard and rewards system relies on tracking a lot of small interactions (like submissions, reviews, account linking). Hyperion’s performance and modularity would help us scale this system efficiently, especially during high community activity.\nIn short, Hyperion adds muscle to both the intelligence and real-time responsiveness of ProofDAO. It’s a perfect match for what we’re building.\nWe’re applying for Track 1: AI-Native and Core-Aligned Projects.\nSpecifically, we align with:\nAI-Native dApps, since we plan to embed AI into the task evaluation and contributor support flows.\nHyperion AI Integration, as we’re actively exploring use of the Hyperion co-agent to help DAOs handle microtask submissions and contributor vetting with minimal overhead.\nCommunity Engagement Features\nWe’ll gamifying the platform by assigning points to key actions like creating a DAO, posting or submitting tasks, reviewing work and linking social accounts. Users earn badges and rank on leaderboards, making testing feel more like a game. This approach not only encourages full platform exploration but also drives organic onboarding by rewarding users for meaningful participation.\nGetting Involved\nPeople can reach out to me via my twitter handle (@i_dodgerini) or telegram (@riteshdas1). Always open to chat, collaborate or help out!",
        "comments_details": [
            {
                "author": "rit",
                "comment": "Project Name\nProofDAO - zero-knowledge proof system for trustless DAO task verification\nProblem Statement\nDAO’s and on-chain companies often struggle to trust contributors without prior relationships. Not only that, they are sometimes unable to track microtask completion in a trust minimized way and filter quality contributors without KYC or resumes.\nSolution Overview\nA decentralized platform where DAO’s can post microtasks or bounties, and contributors submit work along with zk-proofs or attestations of skill. The system verifies completion and auto-rewards based on DAO rules.\nProject Description\nOur project, ProofDAO, is a decentralized platform that allows DAO’s and Web3 projects to post microtasks (like design, dev work, translations, marketing) and have contributors complete them in a trustless, reputation-based way. The main goal is to let DAO’s tap into global talent without having to rely on traditional CV or trust assumptions.\nThe platform works in a simple way that is DAO’s create bounties with rewards, contributors submit their work along with some form of identity proof (either linking GitHub or Twitter, or basic on-chain reputation NFT) and upon approval, they get rewarded. We’re also experimenting with simulating zero-knowledge proofs (or lightweight attestations) just to show how trustless verification of skills can work without fully revealing someone’s identity.\nThe smart contracts will be deployed on Metis and the good thing is it’s EVM compatible and gas fees are really low, which makes it perfect for micro-transactions. We’ll also integrate the Metis DAC framework to show how actual DAO workflows can function on-chain. Frontend will probably be in Next.js with wagmi and rainbowkit for wallet connection.\nI think what excites us the most is that this idea is actually useful. It’s not just another DeFi toy, DAO’s do need better tools for trustless coordination, and this project could really help reduce friction for contributors trying to break into the space.\nHyperion’s architecture gives us a powerful foundation to supercharge ProofDAO in several ways:\nAI Co-Agent for Task Validation: One of the trickiest parts of managing bounties or microtasks is ensuring submissions are both relevant and high quality. Hyperion’s built-in AI co-agent could help us automate task review, either by helping DAO admins filter submissions or flagging ones that match historical patterns of excellence. This would reduce human workload while ensuring consistent quality control.\nOn-Chain AI & Data for Identity Verification: We’re exploring ways to simulate ZK-proofs or lightweight attestations for contributor reputation. With Hyperion’s AI and data pipelines directly on-chain, we can potentially streamline how contributor identities or skills are verified, without forcing full doxxing or heavy KYC. That means contributors can prove credibility without oversharing and DAOs still get the signal they need.\nReal-Time Interactions: Because we’re enabling microtask coordination, the faster the response loop, the better the experience. Hyperion’s low-latency infra lets us build a smoother, more dynamic interface where task submissions, approvals, and feedback can happen almost instantly critical for keeping contributors engaged and reducing friction in DAO workflows.\nScalable Gamification: Our leaderboard and rewards system relies on tracking a lot of small interactions (like submissions, reviews, account linking). Hyperion’s performance and modularity would help us scale this system efficiently, especially during high community activity.\nIn short, Hyperion adds muscle to both the intelligence and real-time responsiveness of ProofDAO. It’s a perfect match for what we’re building.\nWe’re applying for Track 1: AI-Native and Core-Aligned Projects.\nSpecifically, we align with:\nAI-Native dApps, since we plan to embed AI into the task evaluation and contributor support flows.\nHyperion AI Integration, as we’re actively exploring use of the Hyperion co-agent to help DAOs handle microtask submissions and contributor vetting with minimal overhead.\nCommunity Engagement Features\nWe’ll gamifying the platform by assigning points to key actions like creating a DAO, posting or submitting tasks, reviewing work and linking social accounts. Users earn badges and rank on leaderboards, making testing feel more like a game. This approach not only encourages full platform exploration but also drives organic onboarding by rewarding users for meaningful participation.\nGetting Involved\nPeople can reach out to me via my twitter handle (@i_dodgerini) or telegram (@riteshdas1). Always open to chat, collaborate or help out!"
            }
        ]
    },
    {
        "id": "fd8da3ad54d2b6c7",
        "topic_id": "6123",
        "title": "SEO in the Age of Generative Search Engines",
        "url": "https://forum.ceg.vote/t/seo-in-the-age-of-generative-search-engines/6123",
        "views": "",
        "comments": "1",
        "created_date": "Jul 3, 2025 12:54 pm",
        "latest_activity": "Jul 3, 2025 1:34 pm",
        "content": "“I don’t know how to do SEO in 2025.”\nA lot of marketers feel this way right now — and for good reason.\nSearch has changed. It’s no longer just about ranking on Google. In 2025, people are finding answers through AI-powered search results, voice assistants, social platforms, and even chatbots. Welcome to the world of “Search Everywhere Optimization.”\n1. Google isn’t the only game in town\nSure, classic SEO still matters — clean websites, strong content, and solid backlinks. But today, visibility also depends on how your content shows up in AI tools like ChatGPT, Google’s AI Overviews, or Bing’s Copilot.\n2. AI answers need better inputs\nGenerative search engines don’t just crawl websites — they summarize. That means your content needs to be clear, factual, and structured in a way AI can understand and cite. Think: straight answers, organized data, and trusted sources.\n3. Being visible = being everywhere\nIt’s not just about your website anymore. You need a presence on platforms with high authority — Medium, LinkedIn, Reddit, YouTube, Amazon — wherever your audience is searching or asking questions.\n4. Brand mentions matter more than backlinks\nTraditional link-building is being replaced by brand visibility. If AI sees your name mentioned across trusted sites, forums, and newsletters — even without a link — you start becoming the default answer.\n5. Your community is your SEO\nReddit threads, Discord chats, Slack groups, niche forums — they all influence search now. Show up. Add value. Get noticed.\nSo, what’s the move?\nThink of SEO as a long game — a mix of content creation, brand building, and platform strategy. Instead of chasing rankings, aim to be the most helpful, trusted voice on your topic, across every touchpoint.\nThe goal?\nWhen someone searches for answers — no matter where or how — they find you.",
        "comments_details": [
            {
                "author": "Julie0xnana",
                "comment": "“I don’t know how to do SEO in 2025.”\nA lot of marketers feel this way right now — and for good reason.\nSearch has changed. It’s no longer just about ranking on Google. In 2025, people are finding answers through AI-powered search results, voice assistants, social platforms, and even chatbots. Welcome to the world of “Search Everywhere Optimization.”\n1. Google isn’t the only game in town\nSure, classic SEO still matters — clean websites, strong content, and solid backlinks. But today, visibility also depends on how your content shows up in AI tools like ChatGPT, Google’s AI Overviews, or Bing’s Copilot.\n2. AI answers need better inputs\nGenerative search engines don’t just crawl websites — they summarize. That means your content needs to be clear, factual, and structured in a way AI can understand and cite. Think: straight answers, organized data, and trusted sources.\n3. Being visible = being everywhere\nIt’s not just about your website anymore. You need a presence on platforms with high authority — Medium, LinkedIn, Reddit, YouTube, Amazon — wherever your audience is searching or asking questions.\n4. Brand mentions matter more than backlinks\nTraditional link-building is being replaced by brand visibility. If AI sees your name mentioned across trusted sites, forums, and newsletters — even without a link — you start becoming the default answer.\n5. Your community is your SEO\nReddit threads, Discord chats, Slack groups, niche forums — they all influence search now. Show up. Add value. Get noticed.\nSo, what’s the move?\nThink of SEO as a long game — a mix of content creation, brand building, and platform strategy. Instead of chasing rankings, aim to be the most helpful, trusted voice on your topic, across every touchpoint.\nThe goal?\nWhen someone searches for answers — no matter where or how — they find you."
            },
            {
                "author": "priyankg3",
                "comment": "Very Well said. Visibility is the key here.\nYou need to be visible everywhere, online or offline both."
            }
        ]
    },
    {
        "id": "aeb3d57b0922e7d4",
        "topic_id": "5533",
        "title": "Haithe - Decentralized Protocol for Verifiable AI",
        "url": "https://forum.ceg.vote/t/haithe-decentralized-protocol-for-verifiable-ai/5533",
        "views": "",
        "comments": "19",
        "created_date": "Jun 12, 2025 8:06 pm",
        "latest_activity": "Jul 3, 2025 1:03 pm",
        "content": "Haithe\nA Decentralized Protocol for Verifiable AI.\nThe Problem\nThe core challenge for AI in Web3 isn’t just proving that data hasn’t been tampered with; it’s proving the data’s substance. A cryptographic hash can guarantee a dataset’s integrity, but it cannot verify its origin, quality, or content. A creator could claim their AI is trained on financial data when it was actually trained on irrelevant information, and the hash would still be valid.\nThis “semantic gap” creates a trust vacuum, preventing developers from confidently building high-stakes applications that rely on third-party AI agents.\nThe Solution\nHaithe is a trust protocol that solves this problem by creating a transparent, verifiable ecosystem for AI. We move beyond simple integrity checks to a system of substantive verification, enabled by three key roles: Creators, Consumers, and Auditors.\nInstead of just registering a data hash, creators submit a detailed Claim Manifest about their dataset. Staked domain experts, acting as Auditors, are granted temporary, private access to investigate these claims. Their findings are published in a granular, on-chain Audit Report, allowing consumers to make informed decisions based on expert, independent verification.\nHow It Works: A Three-Part Ecosystem\nHaithe’s workflow ensures checks and balances between all participants, with smart contracts on Hyperion orchestrating the process.\n1. The Creator: Defining the Claims\nBuild & Register: Developers use the Alith framework to build high-performance AI agents and register them on the Haithe marketplace.\nSubmit the Claim Manifest: Alongside the agent, the Creator submits a structured manifest containing specific, falsifiable claims about the training data. For example:\nSource: “API data from Uniswap v3 on Polygon.”\nDate Range: “All swaps from June 1, 2023, to December 31, 2023.”\nContent: “Dataset contains no personally identifiable information (PII).”\nSchema: “Includes columns for token_pair, amount_in, amount_out, and gas_price.”\n2. The Auditor: Investigating the Substance\nStake & Qualify: Domain experts (in finance, NLP, security, etc.) stake tokens to become eligible Auditors.\nAccept the Task: An Auditor accepts an audit request, which can be funded by the Creator or a Consumer.\nInvestigate Claims: The Auditor is granted secure, time-limited, off-chain access to the private dataset. Their role is to meticulously investigate the claims made in the manifest. This requires genuine domain expertise.\nPublish the Audit Report: The Auditor submits a detailed report to IPFS, with its hash recorded on-chain. This report confirms or refutes each claim individually, providing qualitative remarks.\n3. The Consumer: Making Informed Decisions\nDiscover & Filter: Developers browse the Haithe marketplace for AI agents. They can filter for agents based on their audit status.\nReview Reports: Before subscribing, a Consumer can review the detailed Audit Report for any agent. This allows them to assess if the agent’s verified characteristics fit their specific use case.\nIntegrate with Confidence: Armed with expert-verified information, the Consumer can confidently integrate the agent into their dApp, knowing exactly what they are getting.\nKey Features\nOn-Chain Claim Manifests: Creators make specific, verifiable claims about their AI’s data foundation.\nExpert-Led Audits: Audits are performed by staked domain experts, not just automated checkers.\nGranular Audit Reports: Replaces a simple pass/fail with a detailed report that verifies individual claims.\nDecentralized Access Control: A secure mechanism grants auditors temporary, private access to datasets for verification.\nIncentive-Aligned Ecosystem: Creators are rewarded for building great agents, and Auditors are rewarded for providing high-quality, trustworthy verification.\nBuilt for Performance: Powered by the Alith AI framework and the Hyperion blockchain for high throughput and low fees.\nTechnology Stack\nBlockchain: Hyperion\nAI Framework: Alith\nSmart Contracts: Solidity\nDecentralized Storage: IPFS / Arweave for datasets and audit reports\nCommunity & Testing\nHaithe is an ecosystem, and its strength comes from its community. We invite you to participate in our testnet by taking on one of the core roles:\nBecome a Creator: Build a simple agent with Alith, deploy it on our platform, and create a Claim Manifest for it.\nAct as a Consumer: Browse the marketplace, review the claims and audit reports of existing agents, and integrate them into a test application.\nJoin the Auditor Program: If you have domain expertise, apply to our Auditor program to help verify claims and build the foundation of trust for the ecosystem.",
        "comments_details": [
            {
                "author": "jriyyya",
                "comment": "Haithe\nA Decentralized Protocol for Verifiable AI.\nThe Problem\nThe core challenge for AI in Web3 isn’t just proving that data hasn’t been tampered with; it’s proving the data’s substance. A cryptographic hash can guarantee a dataset’s integrity, but it cannot verify its origin, quality, or content. A creator could claim their AI is trained on financial data when it was actually trained on irrelevant information, and the hash would still be valid.\nThis “semantic gap” creates a trust vacuum, preventing developers from confidently building high-stakes applications that rely on third-party AI agents.\nThe Solution\nHaithe is a trust protocol that solves this problem by creating a transparent, verifiable ecosystem for AI. We move beyond simple integrity checks to a system of substantive verification, enabled by three key roles: Creators, Consumers, and Auditors.\nInstead of just registering a data hash, creators submit a detailed Claim Manifest about their dataset. Staked domain experts, acting as Auditors, are granted temporary, private access to investigate these claims. Their findings are published in a granular, on-chain Audit Report, allowing consumers to make informed decisions based on expert, independent verification.\nHow It Works: A Three-Part Ecosystem\nHaithe’s workflow ensures checks and balances between all participants, with smart contracts on Hyperion orchestrating the process.\n1. The Creator: Defining the Claims\nBuild & Register: Developers use the Alith framework to build high-performance AI agents and register them on the Haithe marketplace.\nSubmit the Claim Manifest: Alongside the agent, the Creator submits a structured manifest containing specific, falsifiable claims about the training data. For example:\nSource: “API data from Uniswap v3 on Polygon.”\nDate Range: “All swaps from June 1, 2023, to December 31, 2023.”\nContent: “Dataset contains no personally identifiable information (PII).”\nSchema: “Includes columns for token_pair, amount_in, amount_out, and gas_price.”\n2. The Auditor: Investigating the Substance\nStake & Qualify: Domain experts (in finance, NLP, security, etc.) stake tokens to become eligible Auditors.\nAccept the Task: An Auditor accepts an audit request, which can be funded by the Creator or a Consumer.\nInvestigate Claims: The Auditor is granted secure, time-limited, off-chain access to the private dataset. Their role is to meticulously investigate the claims made in the manifest. This requires genuine domain expertise.\nPublish the Audit Report: The Auditor submits a detailed report to IPFS, with its hash recorded on-chain. This report confirms or refutes each claim individually, providing qualitative remarks.\n3. The Consumer: Making Informed Decisions\nDiscover & Filter: Developers browse the Haithe marketplace for AI agents. They can filter for agents based on their audit status.\nReview Reports: Before subscribing, a Consumer can review the detailed Audit Report for any agent. This allows them to assess if the agent’s verified characteristics fit their specific use case.\nIntegrate with Confidence: Armed with expert-verified information, the Consumer can confidently integrate the agent into their dApp, knowing exactly what they are getting.\nKey Features\nOn-Chain Claim Manifests: Creators make specific, verifiable claims about their AI’s data foundation.\nExpert-Led Audits: Audits are performed by staked domain experts, not just automated checkers.\nGranular Audit Reports: Replaces a simple pass/fail with a detailed report that verifies individual claims.\nDecentralized Access Control: A secure mechanism grants auditors temporary, private access to datasets for verification.\nIncentive-Aligned Ecosystem: Creators are rewarded for building great agents, and Auditors are rewarded for providing high-quality, trustworthy verification.\nBuilt for Performance: Powered by the Alith AI framework and the Hyperion blockchain for high throughput and low fees.\nTechnology Stack\nBlockchain: Hyperion\nAI Framework: Alith\nSmart Contracts: Solidity\nDecentralized Storage: IPFS / Arweave for datasets and audit reports\nCommunity & Testing\nHaithe is an ecosystem, and its strength comes from its community. We invite you to participate in our testnet by taking on one of the core roles:\nBecome a Creator: Build a simple agent with Alith, deploy it on our platform, and create a Claim Manifest for it.\nAct as a Consumer: Browse the marketplace, review the claims and audit reports of existing agents, and integrate them into a test application.\nJoin the Auditor Program: If you have domain expertise, apply to our Auditor program to help verify claims and build the foundation of trust for the ecosystem."
            },
            {
                "author": "priyankg3",
                "comment": "Hello\n@jriyyya\n,\nI have few Questions to ask :\nIf the dataset is private, how do you ensure Auditors don’t misuse or leak it?\nAre Creators allowed to challenge an audit report if they think it’s unfair or inaccurate?\nWhat kinds of use cases are you targeting first – trading bots, oracles, LLMs?"
            },
            {
                "author": "han",
                "comment": "Thanks for sharing this deep and original approach-Haithe sounds truly exciting! As a consumer, how can I be sure that an AI agent’s data truly comes from the sources claimed? Do the audit reports go into technical detail, and does relying on them require multiple auditors’ perspectives for confidence?"
            },
            {
                "author": "jriyyya",
                "comment": "GM GM, Apologies for the delayed response , I was in the middle of relocating and just got everything settled. Thanks again for your interest in our project and for the thoughtful questions. Let me address each of them below\n1) If the dataset is private, how do you ensure Auditors don’t misuse or leak it?\nGreat question. In our current model, auditors must undergo two layers of validation before they’re granted access:\nFirst, they are verified by us (the platform) based on identity and domain expertise.\nSecond, they are validated by the DAO, ensuring community-level accountability.\nWhile trust in auditors is still required to some extent, just like in real-world auditing , we are actively exploring ways to make this process more trustless.\n2) Are Creators allowed to challenge an audit report if they think it’s unfair or inaccurate?\nYes, it’s a crucial safeguard.\nWe agree that auditors shouldn’t have unchecked authority. Creators will have the ability to challenge audit reports, either by:\nRequesting a re-audit (potentially by a different auditor or group of auditors), or\nSubmitting a formal rebuttal that gets appended to the audit report for transparency.\n3) What kinds of use cases are you targeting first – trading bots, oracles, LLMs?\nOur initial focus is on trading bots and LLMs. These use cases have both high impact and urgent need for trust and verifiability."
            },
            {
                "author": "jriyyya",
                "comment": "Helloo, Apologies for the delayed response, I really appreciate your thoughtful question!\nAs a consumer, audits are exactly what enable trust that an AI agent’s data truly comes from the sources claimed. Each audit report goes into technical detail, verifying every claim made in the agent’s Claim Manifest — like the data source, date range, schema, and more.\nAnd yes, confidence naturally increases when multiple auditors review the same dataset. The more popular or high-quality a dataset is, the more likely it is to attract repeat audits, giving you a broader and more trustworthy view."
            },
            {
                "author": "han",
                "comment": "Thanks for the clear explanation! Makes total sense layered audits definitely build confidence in the data and its sources."
            },
            {
                "author": "priyankg3",
                "comment": "Thanks for the detailed response, and hope the move went smoothly!\nI really like the dual-layer validation approach and the transparency mechanisms for audit disputes.\nWill be following the updates closely!"
            },
            {
                "author": "CrisMetis",
                "comment": "Haithe seems to tackle a real pain point, transparency in AI data verification. Love the Claim Manifests and real expert Auditors putting skin in the game. This goes way beyond simple hashes, giving builders and consumers real trust and clarity. Excited to see how it grows!"
            },
            {
                "author": "jriyyya",
                "comment": "Yes, We are in the building phase as of now, We will surely share the upcoming updates"
            },
            {
                "author": "jriyyya",
                "comment": "Thank you for showing interest in our project! We will share some updates soon, So stay tuned"
            },
            {
                "author": "jriyyya",
                "comment": "Hey Everyone, We’re doing a community research to understand how developers, data scientists, auditors, and Web3 builders think about trust, verification, and integrating third-party AI.\nPlease take 3–5 minutes to fill out this quick questionnaire\nYour input will directly shape Haithe’s early design and testnet launch.\nBasic Info\nWhat’s your background? (Select all that apply)\nAI/ML Developer\nWeb3 Developer\nData Engineer / Analyst\nSecurity Researcher\nDomain Expert (finance, law, etc)\nFounder / Builder\nStudent / learner\nOther technical background\nOther non-technical background\n4\nvoters\nChoose up to 6 options.\nVote now!\nResults\nHow familiar are you with verifiable data or trust protocols?\nNot familiar\nSomewhat familiar\nVery familiar / already using similar tools\n4\nvoters\nResults\nHave you ever used an LLM created by someone else (e.g., from HuggingFace, GitHub, or some DAO)?\nYes, Frequently\nOccasionally\nRarely\nNever\nNot sure\n4\nvoters\nResults\nWhat are your biggest concerns when using external AI models? (Select up to 3)\nNot knowing the source of training data\nPotential misuse of personal or sensitive data\nLegal or ethical issues\nPoor model performance\nIncompatibility with my stack\nLack of transparency in how the model was built\nNo concerns\n4\nvoters\nChoose up to 3 options.\nVote now!\nResults\nWhat would most increase your trust in using someone else’s AI model? (Select up to 3)\nTransparent training data claims\nIndependent third-party audits\nVerifiable source data (e.g., on-chain or timestamped)\nReputation of the creator\nCommunity reviews or ratings\nOpen-source code and training pipeline\nNothing — I already trust most open models\nNothing — I don’t trust external AI models\n4\nvoters\nChoose up to 3 options.\nVote now!\nResults\nHow valuable do you think it is to have expert audits of AI models’ data claims?\nNot valuable\nSlightly useful\nUseful\nVery valuable\nAbsolutely essential for critical applications\n4\nvoters\nResults\nIf you had to choose a role in the Haithe ecosystem, which would you most likely want to try?\nCreator (build and publish AI agents)\nAuditor (verify dataset claims)\nConsumer (use verified agents in dApps)\nNone right now — just observing\n4\nvoters\nResults\nWould you stake tokens or reputation to act as an Auditor in return for rewards?\nYes\nMaybe, depending on how the system works\nNo\nI’m not interested in being an Auditor\n4\nvoters\nResults"
            },
            {
                "author": "jriyyya",
                "comment": "Ping\n@priyankg3\n@han\n@CrisMetis\n@Geographer\n@4ngel\n@ravisharma\n@deadman_xbt\n@Cryptopotato\nWould really appreciate if you all could fill out the above quick questionnaire"
            },
            {
                "author": "priyankg3",
                "comment": "Thanks For sharing, I just checked and filled the entries"
            },
            {
                "author": "Geographer",
                "comment": "jriyyya:\nWould really appreciate if you all could fill out the above quick questionnaire\nSure, happy to help! Just filled it out"
            },
            {
                "author": "Geographer",
                "comment": "If everyone in the ranking fills out the survey, the results will be more accurate.\nhttps://forum.ceg.vote/leaderboard/2"
            },
            {
                "author": "jriyyya",
                "comment": "Agreed, But it is difficult to get everyone vote"
            },
            {
                "author": "Elena",
                "comment": "I shared this research on X to get more responses https://x.com/ElenaCryptoChic/status/1940376001357250759?t=KM-_0234hpeaN1hXlwHy1A&s=19"
            },
            {
                "author": "jriyyya",
                "comment": "Thankk you for the help! I am also creating Haithe X, to start the marketing!"
            },
            {
                "author": "marsian83",
                "comment": "Hey Everyone, Marsian here\nTeammate of Riya in building this decentralized protocol for verifiable AI and I am super excited for it.\nHit me up with any questions you have, Meanwhile are refining our project idea a bit."
            },
            {
                "author": "amardeep",
                "comment": "I went through your proposal and i have some questions to ask:\nHow does the “Rust-based optimization” work for inference, and what kind of performance gains can be expected?\nGiven that Hyperion is a Layer 2 solution for AI execution, what are its specific advantages over other Layer 2s for this use case?\nThe proposal mentions “secure, time-limited, off-chain access to the private dataset.” Can you elaborate on the specific technical mechanisms for this? Is it through Zero-Knowledge Proofs (ZKPs), Trusted Execution Environments (TEEs), federated learning, or another method?\nWhile the hash of the report is on-chain, how can consumers be confident in the truthfulness and completeness of the qualitative remarks within the report, beyond just its integrity?\nThank you,"
            }
        ]
    },
    {
        "id": "ffba66f7529608dc",
        "topic_id": "6109",
        "title": "Could Hyperion Host Its Own “On-Chain ChatGPT”?",
        "url": "https://forum.ceg.vote/t/could-hyperion-host-its-own-on-chain-chatgpt/6109",
        "views": "",
        "comments": "1",
        "created_date": "Jul 2, 2025 1:34 pm",
        "latest_activity": "Jul 3, 2025 12:18 pm",
        "content": "With Hyperion optimized for Al-native workloads, do you think we’re close to seeing a fully on-chain ChatGPT-style app?\nLike, inference happening on-chain + token-gated access + rewardable data contributors via DATs?\nWould love to hear how devs here imagine building that-or if it’s even feasible yet👀",
        "comments_details": [
            {
                "author": "Gann",
                "comment": "With Hyperion optimized for Al-native workloads, do you think we’re close to seeing a fully on-chain ChatGPT-style app?\nLike, inference happening on-chain + token-gated access + rewardable data contributors via DATs?\nWould love to hear how devs here imagine building that-or if it’s even feasible yet👀"
            },
            {
                "author": "Elena",
                "comment": "That’s exactly what LazAI is building. It is amazing to hear that we are on the same page."
            }
        ]
    },
    {
        "id": "6756427e5d9b51ae",
        "topic_id": "6120",
        "title": "Protocol UX is not just UI. What if experience started deeper?",
        "url": "https://forum.ceg.vote/t/protocol-ux-is-not-just-ui-what-if-experience-started-deeper/6120",
        "views": "",
        "comments": "2",
        "created_date": "Jul 3, 2025 10:06 am",
        "latest_activity": "Jul 3, 2025 12:07 pm",
        "content": "Here’s a quick idea:\nWe often say a product has “bad UX” — but what if the problem isn’t the interface…\nIt’s the protocol underneath?\nIf your gas fees are unpredictable — that’s UX.\nIf your wallet flow is clunky — that’s UX.\nIf your governance takes 7 clicks to delegate — yep, that’s UX too.\nUX doesn’t start at the button.\nIt starts at the block.\nDesigning great Web3 UX isn’t just about cleaner front-ends.\nIt’s about making the entire stack feel understandable, predictable, and human.\nCould “protocol-level UX” be the next design challenge we need to solve?",
        "comments_details": [
            {
                "author": "Evelyn",
                "comment": "Here’s a quick idea:\nWe often say a product has “bad UX” — but what if the problem isn’t the interface…\nIt’s the protocol underneath?\nIf your gas fees are unpredictable — that’s UX.\nIf your wallet flow is clunky — that’s UX.\nIf your governance takes 7 clicks to delegate — yep, that’s UX too.\nUX doesn’t start at the button.\nIt starts at the block.\nDesigning great Web3 UX isn’t just about cleaner front-ends.\nIt’s about making the entire stack feel understandable, predictable, and human.\nCould “protocol-level UX” be the next design challenge we need to solve?"
            },
            {
                "author": "Aryanzutshi",
                "comment": "Agreed. UX plays a very important role in anything that we build."
            },
            {
                "author": "Vladimir",
                "comment": "Sometimes the UX of a dApp is so poor that if you’re unfamiliar with it, you’re completely lost and it feels like using an iPhone where you’re forced down a strict path. Developers often build products with overly complicated flows: sign this, approve that, add liquidity here and there, and eventually you’ll get Token X… which you then need to swap for Token Z to finally earn rewards in Token B. It’s exhausting.\nAs a developer, your have to abstract away all these steps, bundle dozens of micro-transactions into a single contract or flow. Make it easy. Respect the user’s time. Deliver a financial tool that works intuitively without requiring deep technical knowledge or jumping through five different pages just to earn a reward.\nThis isn’t about blaming everyone, but the reality is that CEXs are still far more approachable for the average user than most dApps. That should tell us we’re doing something wrong, shouldn’t it?"
            }
        ]
    },
    {
        "id": "9bbf5514ee8ba6ad",
        "topic_id": "6118",
        "title": "Metis Telegram AMA Recap",
        "url": "https://forum.ceg.vote/t/metis-telegram-ama-recap/6118",
        "views": "",
        "comments": "2",
        "created_date": "Jul 3, 2025 5:25 am",
        "latest_activity": "Jul 3, 2025 11:52 am",
        "content": "Introduction\nThe first edition of the Metis Telegram Text AMA launched with a focus on the Hyperion Forum and the ongoing Guilds Campaign. Hosted by Norbert from the Metis community team, the session welcomed Daryl, a member of the Metis Governance group, who unpacked the design, incentives, and future direction of the Forum and Guilds structure.\nHere’s a full recap of the session in chat-style format.\nAMA Transcript\nNorbert: What is the Hyperion Forum and how is it different from other blockchain communities? Who is it designed for?\nDaryl: The Hyperion Forum is a collaborative space for all contributors—builders, marketers, and operators—to work together on dApps within the Metis ecosystem. Unlike many blockchain communities that cater mainly to devs, the Forum offers structured Guilds to support all roles involved in launching successful projects. It’s built on Discourse and includes gamified features like badges and a points system. It’s also the home for HyperHack, our $200K hackathon.\nNorbert: How do Guilds work inside the Forum? Can someone join more than one?\nDaryl: Guilds are like subreddits within the Forum—dedicated spaces for Builders, Marketers, and Operators. Anyone can view content, but to post or comment, you’ll need to officially join a Guild. To do so, click “join here” in the Guilds section, answer a short form, and you’ll be approved within 24–48 hours. You’re free to join multiple Guilds, especially if you wear many hats like a founder.\nNorbert: Tell us about the points and reputation system. How does it work and what do contributors get out of it?\nDaryl: Every meaningful action—posting, replying, helping others, inviting members, etc.—earns you points and badges. These are tracked publicly on the leaderboard. Over time, we’ll introduce onchain benefits tied to these contributions. You can learn more in the Badge and Point System Guide on the forum.\nNorbert: What’s the purpose behind the Guilds Campaign? Why are Guilds so important to the long-term vision?\nDaryl: The goal is to create specialized, high-signal communities where project teams can find support, share challenges, and scale together. The Forum becomes a place where teams can get actual help—like figuring out user needs, audit readiness, or getting testers—directly from peers in the ecosystem.\nNorbert: What does it take to become a Guild Leader? What kind of activity or traits are you looking for?\nDaryl: To qualify, you need a few key badges:\nMember (TL2)\nCampaigner (invited 3 members)\nAppreciated (received 1 like on 20 posts)\nCertified and Licensed (advanced forum knowledge) These metrics prove someone is active, helpful, and understands how to guide others.\nNorbert: What are the rewards for Guild Leaders, both now and in the future?\nDaryl: Immediate rewards include special titles, wallet perks like zero gas, and exclusive badges. Long-term, Guild Leaders could receive METIS token incentives, expanded governance roles, early access to new features, and scaled rewards based on their Guild’s performance.\nNorbert: What responsibilities will Guild Leaders have?\nDaryl: Guild Leaders manage membership, moderate posts, set permissions, and guide their communities. Think of it as collaborative leadership, not admin control. You’re there to help your Guild thrive—not just enforce rules.\nNorbert: Are there long-term incentives tied to leadership performance?\nDaryl: Yes—though we’re not disclosing everything just yet. There’s a real budget set aside, and Guild Leaders who scale their communities meaningfully will be rewarded even more.\nNorbert: Can people create new Guilds beyond the current three?\nDaryl: Not at this stage. We’re focusing on growing the three core Guilds to build critical mass. New Guilds could emerge later once engagement is high enough. We want to avoid early fragmentation.\nCommunity Q&A\nBrownhawks_Degen: Is the Guild initiative open to everyone? What stops users from spamming the system?\nDaryl: Yes, anyone can join Guilds. We use Discourse, which has powerful built-in moderation and spam detection tools. We’ve also enabled AI-assisted moderation for added security.\nDoğukan: What real-world challenges are being used to validate AI-native dApps, and how is success measured?\nDaryl: This is a great topic for the Builders Guild. Feel free to post it there to spark a deeper discussion.\nНафаня: What role will Guilds play in Metis governance in the long term?\nDaryl: Governance will increasingly shift to contribution and reputation-based voting. Guild participation will play a significant role in how influence is earned and applied.\nНафаня (follow-up): How will the effectiveness of different Guilds be measured?\nDaryl: We use internal dashboards and Discourse reports to monitor activity. It’s all about meaningful engagement—Discourse’s systems help surface the most valuable contributions and members.\nKaran Singhania: What will happen to early bird leaderboard points now that that phase is over? Will top scorers be rewarded?\nDaryl: Yes. Early bird points will be rewarded at a higher rate. Those who participated early will receive special recognition.\nHüseyin Tekin: How does the Guild model connect with Metis’ long-term vision for decentralized governance? What metrics are used to assess authenticity and performance?\nDaryl: We combine social and onchain signals—like forum activity, testnet deployments, and contract usage. Different signals contribute to different areas of influence. Governance, ultimately, is about enabling action and Guilds will empower users to do exactly that.\nFinal Note\nThe maiden edition of the Metis Telegram AMA brought rich insights into how the Hyperion Forum and Guilds Campaign are creating a powerful community infrastructure. This isn’t just a discussion space—it’s a contributor economy with real visibility, leadership paths, and long-term rewards.\nBecome a Guild Leader\nWhether you’re a builder, marketer, or operator—Guild leadership is open to all. Metis is selecting three Guild Leaders in the coming weeks. Leaders will shape their Guild’s direction, receive unique rewards, and gain authority in the broader ecosystem.\nApply now:\nforms.clickup.com\nClickUp Forms\nJoin the campaign. Lead your community. Help build what’s next.",
        "comments_details": [
            {
                "author": "Norbert",
                "comment": "Introduction\nThe first edition of the Metis Telegram Text AMA launched with a focus on the Hyperion Forum and the ongoing Guilds Campaign. Hosted by Norbert from the Metis community team, the session welcomed Daryl, a member of the Metis Governance group, who unpacked the design, incentives, and future direction of the Forum and Guilds structure.\nHere’s a full recap of the session in chat-style format.\nAMA Transcript\nNorbert: What is the Hyperion Forum and how is it different from other blockchain communities? Who is it designed for?\nDaryl: The Hyperion Forum is a collaborative space for all contributors—builders, marketers, and operators—to work together on dApps within the Metis ecosystem. Unlike many blockchain communities that cater mainly to devs, the Forum offers structured Guilds to support all roles involved in launching successful projects. It’s built on Discourse and includes gamified features like badges and a points system. It’s also the home for HyperHack, our $200K hackathon.\nNorbert: How do Guilds work inside the Forum? Can someone join more than one?\nDaryl: Guilds are like subreddits within the Forum—dedicated spaces for Builders, Marketers, and Operators. Anyone can view content, but to post or comment, you’ll need to officially join a Guild. To do so, click “join here” in the Guilds section, answer a short form, and you’ll be approved within 24–48 hours. You’re free to join multiple Guilds, especially if you wear many hats like a founder.\nNorbert: Tell us about the points and reputation system. How does it work and what do contributors get out of it?\nDaryl: Every meaningful action—posting, replying, helping others, inviting members, etc.—earns you points and badges. These are tracked publicly on the leaderboard. Over time, we’ll introduce onchain benefits tied to these contributions. You can learn more in the Badge and Point System Guide on the forum.\nNorbert: What’s the purpose behind the Guilds Campaign? Why are Guilds so important to the long-term vision?\nDaryl: The goal is to create specialized, high-signal communities where project teams can find support, share challenges, and scale together. The Forum becomes a place where teams can get actual help—like figuring out user needs, audit readiness, or getting testers—directly from peers in the ecosystem.\nNorbert: What does it take to become a Guild Leader? What kind of activity or traits are you looking for?\nDaryl: To qualify, you need a few key badges:\nMember (TL2)\nCampaigner (invited 3 members)\nAppreciated (received 1 like on 20 posts)\nCertified and Licensed (advanced forum knowledge) These metrics prove someone is active, helpful, and understands how to guide others.\nNorbert: What are the rewards for Guild Leaders, both now and in the future?\nDaryl: Immediate rewards include special titles, wallet perks like zero gas, and exclusive badges. Long-term, Guild Leaders could receive METIS token incentives, expanded governance roles, early access to new features, and scaled rewards based on their Guild’s performance.\nNorbert: What responsibilities will Guild Leaders have?\nDaryl: Guild Leaders manage membership, moderate posts, set permissions, and guide their communities. Think of it as collaborative leadership, not admin control. You’re there to help your Guild thrive—not just enforce rules.\nNorbert: Are there long-term incentives tied to leadership performance?\nDaryl: Yes—though we’re not disclosing everything just yet. There’s a real budget set aside, and Guild Leaders who scale their communities meaningfully will be rewarded even more.\nNorbert: Can people create new Guilds beyond the current three?\nDaryl: Not at this stage. We’re focusing on growing the three core Guilds to build critical mass. New Guilds could emerge later once engagement is high enough. We want to avoid early fragmentation.\nCommunity Q&A\nBrownhawks_Degen: Is the Guild initiative open to everyone? What stops users from spamming the system?\nDaryl: Yes, anyone can join Guilds. We use Discourse, which has powerful built-in moderation and spam detection tools. We’ve also enabled AI-assisted moderation for added security.\nDoğukan: What real-world challenges are being used to validate AI-native dApps, and how is success measured?\nDaryl: This is a great topic for the Builders Guild. Feel free to post it there to spark a deeper discussion.\nНафаня: What role will Guilds play in Metis governance in the long term?\nDaryl: Governance will increasingly shift to contribution and reputation-based voting. Guild participation will play a significant role in how influence is earned and applied.\nНафаня (follow-up): How will the effectiveness of different Guilds be measured?\nDaryl: We use internal dashboards and Discourse reports to monitor activity. It’s all about meaningful engagement—Discourse’s systems help surface the most valuable contributions and members.\nKaran Singhania: What will happen to early bird leaderboard points now that that phase is over? Will top scorers be rewarded?\nDaryl: Yes. Early bird points will be rewarded at a higher rate. Those who participated early will receive special recognition.\nHüseyin Tekin: How does the Guild model connect with Metis’ long-term vision for decentralized governance? What metrics are used to assess authenticity and performance?\nDaryl: We combine social and onchain signals—like forum activity, testnet deployments, and contract usage. Different signals contribute to different areas of influence. Governance, ultimately, is about enabling action and Guilds will empower users to do exactly that.\nFinal Note\nThe maiden edition of the Metis Telegram AMA brought rich insights into how the Hyperion Forum and Guilds Campaign are creating a powerful community infrastructure. This isn’t just a discussion space—it’s a contributor economy with real visibility, leadership paths, and long-term rewards.\nBecome a Guild Leader\nWhether you’re a builder, marketer, or operator—Guild leadership is open to all. Metis is selecting three Guild Leaders in the coming weeks. Leaders will shape their Guild’s direction, receive unique rewards, and gain authority in the broader ecosystem.\nApply now:\nforms.clickup.com\nClickUp Forms\nJoin the campaign. Lead your community. Help build what’s next."
            },
            {
                "author": "4ngel",
                "comment": "Thanks for the recap, couldnt attend unfortunately"
            },
            {
                "author": "priyankg3",
                "comment": "It was a great AMA. i had an doubt but its cleared now..\nHope we can see More AMA like this in future.,"
            }
        ]
    },
    {
        "id": "cbefbee4597dcb8e",
        "topic_id": "6122",
        "title": "Roadmap to Becoming a Web3 Dev",
        "url": "https://forum.ceg.vote/t/roadmap-to-becoming-a-web3-dev/6122",
        "views": "",
        "comments": "0",
        "created_date": "Jul 3, 2025 10:11 am",
        "latest_activity": null,
        "content": "Web3 is an emerging tech trend with massive career opportunities and impressive earning potential. Here’s a practical learning path for beginners:\nUnderstand the Basics of Blockchain\nBlockchain is a decentralized database system where data is stored in blocks linked together.\nLearn about hashing, nodes, and the concept of data immutability.\nExplore DApps (Decentralized Applications)\nDApps run on blockchain networks using:\nFrontend: React / Vue\nBackend: Solidity + Ethereum, or Rust + Solana\nUse cases: payments, record keeping, decentralized escrow, and more.\nWeb Frontend Fundamentals\nGet comfortable with HTML, CSS, JavaScript, and a framework like React or Vue.\nYou can also learn backend tools like NodeJS, Express, and MongoDB for flexibility.\nEthereum & Solidity\nEthereum is the most popular platform for smart contract development.\nSolidity is the main language you’ll need to master.\nEthereum Developer Docs\nLearn Smart Contracts (Solidity)\nTop resources to get hands-on with Solidity:\nBuildspace – Build real Web3 projects, earn NFTs, access job boards\nLearnWeb3DAO – Structured in 4 tiers with hands-on projects\nCryptoZombies – Learn Solidity by building a zombie game\nFreeCodeCamp – Free 16-hour Solidity + Blockchain course\nConnect Smart Contracts to Your Frontend\nUse JavaScript libraries to interact with smart contracts:\nethers.js – Lightweight, beginner-friendly, better docs\nweb3.js – Still widely used in many existing codebases\nweb3 vs ethers comparison\nDeveloper Tools to Know\nAlchemy – Powerful API tools for NFTs, push notifications, and blockchain interaction\nRemix IDE – Browser-based IDE for writing & testing smart contracts instantly\nHardhat – A robust local dev environment, works great with VS Code\nTruffle + Ganache – Full suite for compiling, testing, and simulating blockchain behavior\nStick to the roadmap, build real projects, and practice consistently — that’s the fastest way to break into Web3 development.",
        "comments_details": [
            {
                "author": "Harley",
                "comment": "Web3 is an emerging tech trend with massive career opportunities and impressive earning potential. Here’s a practical learning path for beginners:\nUnderstand the Basics of Blockchain\nBlockchain is a decentralized database system where data is stored in blocks linked together.\nLearn about hashing, nodes, and the concept of data immutability.\nExplore DApps (Decentralized Applications)\nDApps run on blockchain networks using:\nFrontend: React / Vue\nBackend: Solidity + Ethereum, or Rust + Solana\nUse cases: payments, record keeping, decentralized escrow, and more.\nWeb Frontend Fundamentals\nGet comfortable with HTML, CSS, JavaScript, and a framework like React or Vue.\nYou can also learn backend tools like NodeJS, Express, and MongoDB for flexibility.\nEthereum & Solidity\nEthereum is the most popular platform for smart contract development.\nSolidity is the main language you’ll need to master.\nEthereum Developer Docs\nLearn Smart Contracts (Solidity)\nTop resources to get hands-on with Solidity:\nBuildspace – Build real Web3 projects, earn NFTs, access job boards\nLearnWeb3DAO – Structured in 4 tiers with hands-on projects\nCryptoZombies – Learn Solidity by building a zombie game\nFreeCodeCamp – Free 16-hour Solidity + Blockchain course\nConnect Smart Contracts to Your Frontend\nUse JavaScript libraries to interact with smart contracts:\nethers.js – Lightweight, beginner-friendly, better docs\nweb3.js – Still widely used in many existing codebases\nweb3 vs ethers comparison\nDeveloper Tools to Know\nAlchemy – Powerful API tools for NFTs, push notifications, and blockchain interaction\nRemix IDE – Browser-based IDE for writing & testing smart contracts instantly\nHardhat – A robust local dev environment, works great with VS Code\nTruffle + Ganache – Full suite for compiling, testing, and simulating blockchain behavior\nStick to the roadmap, build real projects, and practice consistently — that’s the fastest way to break into Web3 development."
            }
        ]
    },
    {
        "id": "370376d38fbcfe0d",
        "topic_id": "4334",
        "title": "LazaiTrader: AI Multi-Agent Trading Strategies via Telegram",
        "url": "https://forum.ceg.vote/t/lazaitrader-ai-multi-agent-trading-strategies-via-telegram/4334",
        "views": "",
        "comments": "6",
        "created_date": "May 20, 2025 5:57 am",
        "latest_activity": "Jul 3, 2025 9:43 am",
        "content": "Problem Statement\nIn bull markets, crypto asset holders often miss significant opportunities for active trading profits by focusing solely on passive yield strategies. Manual trading is emotionally taxing, requires constant market monitoring, and demands technical analysis skills many users lack. Additionally, traders struggle to maintain consistent strategies, often shifting approaches based on emotion rather than data, leading to suboptimal results.\nSolution Overview\nLazaiTrader is an intelligent multi-agent trading system accessible through Telegram that allows users to select specialized AI trading personas, each with distinct strategies and risk profiles. The system continuously analyzes market conditions and either generates actionable buy/sell signals or automatically executes trades across major DEXs based on user preference. Built on the same robust Alith framework infrastructure, LazaiTrader adapts to market conditions while maintaining the user’s selected trading philosophy, effectively bringing institutional-grade trading strategies to retail users through a familiar messaging interface.\nProject Description\nLazaiTrader transforms crypto trading by allowing users to select from various AI trading personas, each representing different trading philosophies and strategies. Whether you prefer momentum trading, swing trading, technical analysis, or contrarian approaches, LazaiTrader provides a suite of specialized AI agents to match your preferred style.\nCore features include the “Persona Selection” system allowing users to choose trading philosophies that match their temperament, “Strategy Visualization” showing potential entry/exit points before execution, and “Dual-Mode Operation” offering either signal-only notifications or fully automated trade execution. The system leverages Model Context Protocol (MCP) technology and the Alith framework to maintain coherent understanding across interactions, remembering user preferences, portfolio composition, and past decisions.\nThe platform is designed to integrate with major DEXs like Uniswap v3 and can adapt to available liquidity sources. Our algorithms move beyond traditional indicators like moving averages which might not be as reliable in volatile crypto markets. Instead, we use momentum-based strategies that capitalize on emerging trends before they become obvious, volatility-adaptive approaches that dynamically adjust position sizes based on market conditions, and liquidity flow analysis to identify smart money movements before price reacts.\nUsers can select specific asset-focused strategies including Blue Chip Trader (focusing on BTC, ETH, METIS and other established cryptocurrencies) or Micro Cap Trader for those seeking higher-risk, higher-reward opportunities in emerging tokens. Each persona combines these strategy elements differently based on their trading philosophy.\nUsers interact with the system through a natural, conversational interface that explains complex trading strategies in accessible terms tailored to each user’s demonstrated technical understanding. What makes LazaiTrader particularly valuable is its recognition that bull markets favor active trading strategies rather than passive yield farming approaches, allowing users to capitalize on market momentum through their preferred trading style. The system even suggests transitioning to yield strategies when market indicators suggest bearish conditions ahead, providing a complete crypto asset management solution.\nCommunity Engagement Features\nPersona Selection (50 points): Users select their first trading persona and complete the initial risk assessment. No wallet connection required at this stage.\nFirst Trading Signal (100 points): Users receive their first trading signal through the platform. All signals are recorded server-side for performance tracking even without wallet connection.\nWallet Connection (75 points): Users connect their wallet for additional features and functionality.\nRisk Adjustment (50 points): Users modify their risk parameters and observe how their trading persona adapts.\nReferral Program (25 points per referral): Users earn points by inviting others, with bonus points when referred users complete their first trade.\nTrading Performance Achievements (variable points): Users unlock badges and points when their strategies reach specific ROI thresholds.\nThis gamification approach creates clear milestones for users while educating them about different trading methodologies. The points system rewards actions that benefit both the user and the platform ecosystem.\nGetting Involved\nInterested community members can join our project by:\nJoining our Telegram channel at Telegram: View @gmetisio\nFollowing our development updates on Twitter/X @gMetisL2 /\n@smartonstuff\nContributing to our open-source components on Gmetisl2 (gMetis) · GitHub\nAnd SmartOnStuff (Mart) · GitHub\nParticipating in our upcoming beta testing program by signing up at LazaiTrader.gmetis.io (website launching later)\nReaching out directly to our team via dev@gmetis.io for partnership opportunities or technical collaboration\nJoining our open dev sessions (dates to be announced) where we’ll troubleshoot implementation challenges together",
        "comments_details": [
            {
                "author": "SmartOnStuff",
                "comment": "Problem Statement\nIn bull markets, crypto asset holders often miss significant opportunities for active trading profits by focusing solely on passive yield strategies. Manual trading is emotionally taxing, requires constant market monitoring, and demands technical analysis skills many users lack. Additionally, traders struggle to maintain consistent strategies, often shifting approaches based on emotion rather than data, leading to suboptimal results.\nSolution Overview\nLazaiTrader is an intelligent multi-agent trading system accessible through Telegram that allows users to select specialized AI trading personas, each with distinct strategies and risk profiles. The system continuously analyzes market conditions and either generates actionable buy/sell signals or automatically executes trades across major DEXs based on user preference. Built on the same robust Alith framework infrastructure, LazaiTrader adapts to market conditions while maintaining the user’s selected trading philosophy, effectively bringing institutional-grade trading strategies to retail users through a familiar messaging interface.\nProject Description\nLazaiTrader transforms crypto trading by allowing users to select from various AI trading personas, each representing different trading philosophies and strategies. Whether you prefer momentum trading, swing trading, technical analysis, or contrarian approaches, LazaiTrader provides a suite of specialized AI agents to match your preferred style.\nCore features include the “Persona Selection” system allowing users to choose trading philosophies that match their temperament, “Strategy Visualization” showing potential entry/exit points before execution, and “Dual-Mode Operation” offering either signal-only notifications or fully automated trade execution. The system leverages Model Context Protocol (MCP) technology and the Alith framework to maintain coherent understanding across interactions, remembering user preferences, portfolio composition, and past decisions.\nThe platform is designed to integrate with major DEXs like Uniswap v3 and can adapt to available liquidity sources. Our algorithms move beyond traditional indicators like moving averages which might not be as reliable in volatile crypto markets. Instead, we use momentum-based strategies that capitalize on emerging trends before they become obvious, volatility-adaptive approaches that dynamically adjust position sizes based on market conditions, and liquidity flow analysis to identify smart money movements before price reacts.\nUsers can select specific asset-focused strategies including Blue Chip Trader (focusing on BTC, ETH, METIS and other established cryptocurrencies) or Micro Cap Trader for those seeking higher-risk, higher-reward opportunities in emerging tokens. Each persona combines these strategy elements differently based on their trading philosophy.\nUsers interact with the system through a natural, conversational interface that explains complex trading strategies in accessible terms tailored to each user’s demonstrated technical understanding. What makes LazaiTrader particularly valuable is its recognition that bull markets favor active trading strategies rather than passive yield farming approaches, allowing users to capitalize on market momentum through their preferred trading style. The system even suggests transitioning to yield strategies when market indicators suggest bearish conditions ahead, providing a complete crypto asset management solution.\nCommunity Engagement Features\nPersona Selection (50 points): Users select their first trading persona and complete the initial risk assessment. No wallet connection required at this stage.\nFirst Trading Signal (100 points): Users receive their first trading signal through the platform. All signals are recorded server-side for performance tracking even without wallet connection.\nWallet Connection (75 points): Users connect their wallet for additional features and functionality.\nRisk Adjustment (50 points): Users modify their risk parameters and observe how their trading persona adapts.\nReferral Program (25 points per referral): Users earn points by inviting others, with bonus points when referred users complete their first trade.\nTrading Performance Achievements (variable points): Users unlock badges and points when their strategies reach specific ROI thresholds.\nThis gamification approach creates clear milestones for users while educating them about different trading methodologies. The points system rewards actions that benefit both the user and the platform ecosystem.\nGetting Involved\nInterested community members can join our project by:\nJoining our Telegram channel at Telegram: View @gmetisio\nFollowing our development updates on Twitter/X @gMetisL2 /\n@smartonstuff\nContributing to our open-source components on Gmetisl2 (gMetis) · GitHub\nAnd SmartOnStuff (Mart) · GitHub\nParticipating in our upcoming beta testing program by signing up at LazaiTrader.gmetis.io (website launching later)\nReaching out directly to our team via dev@gmetis.io for partnership opportunities or technical collaboration\nJoining our open dev sessions (dates to be announced) where we’ll troubleshoot implementation challenges together"
            },
            {
                "author": "ThalaZikol",
                "comment": "LazaiTrader offers a smart and diverse approach to crypto trading, helping users maximize market opportunities without emotional bias. Love the user-friendly interface and personalized AI trading strategies!"
            },
            {
                "author": "arbilearn",
                "comment": "The concept is good, hope to see it implemented!"
            },
            {
                "author": "Keir",
                "comment": "good concepts and good ınfeematıon"
            },
            {
                "author": "spxctr00m",
                "comment": "Amazing concept !! can’t wait to see it implemented."
            },
            {
                "author": "eddrm7",
                "comment": "Many developers offer solutions to all kinds of problems, but very few, like SmartOnStuff, dare to offer a solution to the most important problem facing most blockchains: fun.\nMany networks lack fun, and fun is what truly attracts users to a network. I’m glad to know that here at Metis, there are still those who dare to solve this problem."
            },
            {
                "author": "SmartOnStuff",
                "comment": "Bit of update here\nThe backend has been running successfully and executing trades on daily basis with every 2-5% sling based on initial input parameters\nAlith implementation is well advanced using secure hyperscaler cloud geo-redundant and auto scaling infrastructure.\nBacktesting of the last 5 years has been performed multiple times with a large number of parameters and token pairs\nThis is critical for relevant and correct suggestions the agent can provide for users when selecting trading strategy. Additionally metis/hyperion in depth knowdledge is part of the agent’s knowdledge base using RAG for up to date and reliable information.\nLet’s Go"
            }
        ]
    },
    {
        "id": "2c152acc5e844c78",
        "topic_id": "4420",
        "title": "EduVerse: AI-Powered Personalized Education Platform",
        "url": "https://forum.ceg.vote/t/eduverse-ai-powered-personalized-education-platform/4420",
        "views": "",
        "comments": "22",
        "created_date": "May 20, 2025 5:45 pm",
        "latest_activity": "Jul 3, 2025 6:45 am",
        "content": "EduVerse: AI-Powered Personalized Education Platform\nProblem Statement\nStandardized education overlooks individual learning styles and paces, leading to disengagement and hindering student potential. Students and educators face the challenge of a rigid system that doesn’t adapt to diverse needs, impacting learning outcomes.\nSolution Overview\nOur AI-Powered Personalized Education Platform offers a dynamic solution by employing a multi-agent system built on the Alith Agentic Framework. Specialized AI agents collaboratively analyze individual learning styles, curate tailored content, provide adaptive tutoring, and track progress in real time. This creates a uniquely personalized learning journey that adjusts to each student’s needs and pace. By integrating diverse educational resources, the platform aims to enhance engagement, improve learning outcomes, and empower both students and educators.\nProject Description\nThis platform is designed to benefit a wide range of users across the educational landscape. Students of all ages, from kindergarten through higher education, can experience a more engaging and effective learning journey tailored to their specific needs. Educators can utilize the platform to enhance their teaching capabilities, gain deeper insights into student progress, and free up time for more individualized support.\nOn-Chain Components: A First-Class Implementation and Core Requirement for Blockchain Deployment\nOur AI-powered personalized education platform is not merely “blockchain-enhanced” — its core functionality and unique value proposition depend fundamentally on blockchain deployment via Hyperion. The decentralized, trustless, and immutable nature of blockchain—particularly Hyperion’s AI-optimized environment—is essential to realizing our vision.\nVerifiable and Immutable Learning Profiles (On-Chain Data Storage)\nWhat’s On-Chain:\nStudent learning profiles—containing hashed learning milestones, verified skills, and personalized path progress—are recorded on Hyperion’s MetisDB. Each profile includes:\nA unique student identifier\nImmutable logs of achievements\nReferences to off-chain AI agent interactions and curated learning content\nWhy It Needs Blockchain:\nTrustless Verification:\nCentralized educational records are prone to tampering and lack transparency. On-chain profiles offer tamper-proof, auditable records of a learner’s journey—verifiable by students, employers, and academic institutions alike.\nData Sovereignty:\nStudents retain full control of their learning data. On-chain metadata ensures ownership and transparency, unlike siloed centralized platforms.\nFoundation for AI Credentialing:\nImmutable learning progress forms the backbone for future AI-driven credentialing systems. AI-generated content, assessments, and learning paths can be reliably tied to a verifiable blockchain record.\nDecentralized Agent Coordination and Trust (Smart Contract Architecture)\nWhat’s On-Chain:\nAgent Registry & Capabilities:\nAll core agents (e.g., Learning Style Analyst, Content Curator, Personalized Tutor) are registered via smart contracts, with:\nUnique IDs\nDefined roles and permissions\nClear scope of data access and processing\nService Agreements & Orchestration Logic:\nSmart contracts manage agent workflows. For example:\nCompletion of a module may trigger the Progress Tracker\nUpon validation, the Personalized Tutor recommends next steps\nIncentive Mechanisms:\nToken-based rewards for learning milestones, community engagement, and future decentralized agent marketplaces.\nWhy It Needs Blockchain:\nTrustless Agent Interaction:\nIn a multi-agent system, blockchain ensures agent behaviors and interactions are transparent, verifiable, and not reliant on a centralized authority.\nGuaranteed Execution:\nSmart contracts enforce the deterministic execution of workflows, ensuring learning paths adapt in real time based on defined rules.\nImmutable Rules:\nEducational logic, access rights, and reward systems are hard-coded and transparent, fostering trust and accountability.\nAI Enablement via the Alith Agentic Framework\nWhat is Alith:\nAlith is a modular, multi-agent framework designed to power personalized learning by simulating human-like reasoning, memory, and collaboration among AI agents. It forms the intelligence layer of our platform, with deep interoperability with blockchain systems like Hyperion.\nKey Features of Alith:\nAgent Management:\nModular deployment of specialized AI agents:\nLearning Style Analyst\nContent Curator\nPersonalized Tutor\nProgress Tracker\nCollaboration Facilitator\nPersistent Memory:\nAgents maintain long-term memory and context across sessions, enhancing personalization.\nInter-Agent Communication:\nSecure and structured communication between agents, enabling dynamic, cooperative behavior.\nToolchain Access:\nSeamless access to external APIs, knowledge bases, and assessments.\nBlockchain Integration with Alith:\nOn-Chain Agent Registry:\nAll Alith agents are registered on-chain, with roles and capabilities enforced via smart contracts.\nCoordinated Workflow Execution:\nAlith agent interactions are triggered and validated by smart contracts, enabling a trustless education logic layer.\nToken-Driven Incentives:\nAgents’ performance and student outcomes can be linked to on-chain reward systems to drive engagement and adaptive learning.\nPlanned Enhancements for Alith\nTo further improve the personalization, decentralization, and performance of the Alith framework, we are planning several critical upgrades:\n1. Decentralized Agent Marketplace\nAllow community developers to contribute new agents (e.g., specialized tutors or regional content curators)\nAgents will be published and authenticated on-chain with verifiable capabilities\nToken-based reputation and staking mechanisms will prevent misuse or malicious behavior\n2. Agent Fine-Tuning via Federated Learning\nSupport for secure, privacy-preserving personalization of agent behavior based on user feedback\nFine-tuning AI agents locally or within federated clusters, without compromising sensitive student data\n3. ZK-Verifiable Inference\nIntegrate zkML (zero-knowledge machine learning) to enable cryptographic verification of off-chain AI outputs\nThis allows validators and institutions to confirm an agent’s decision (e.g., a test score) without exposing the underlying model or input\n4. Composable Agent Workflows\nEnable developers and educators to compose reusable learning workflows by chaining agents together via simple declarative schemas\nBacked by on-chain validation to ensure logical and pedagogical soundness\n5. Multilingual & Accessibility Agents\nCreate plug-and-play AI agents specialized in localization, translation, and neurodiverse learning strategies\nThese agents will leverage both on-chain registries and external toolchains for broader inclusion\nSecure, Real-Time AI Inference (Leveraging Hyperion’s AI-Native Infrastructure)\nWhat’s On-Chain (or Hyperion-enabled):\nWhile most heavy AI workloads (e.g., model training, long-form inference) run off-chain via the Alith framework, Hyperion enables:\nLightweight on-chain AI inferences for rapid adaptation and scoring\nSmart contract–verified AI outputs to ensure compliance with educational standards\nReal-time coordination between on-chain logic and off-chain AI services\nWhy It Needs Blockchain:\nVerifiable AI Outputs:\nAI-driven assessments and tutor recommendations can be validated on-chain, ensuring educational integrity and transparency—unlike opaque, centralized AI systems.\nLow Latency, High Throughput:\nHyperion’s parallel execution environment supports responsive, adaptive AI interactions critical to keeping learners engaged.\nScalable AI Coordination:\nIntegrating real-time AI decision-making into a decentralized, tamper-proof environment offers performance benefits without compromising trust or cost-efficiency.\nConclusion: Blockchain as the Foundation, Not a Feature\nDeploying on Hyperion transforms the platform from an advanced AI education app into a decentralized, verifiable, trust-minimized learning ecosystem. The blockchain is not an add-on — it is the bedrock of:\nTrust in student progress\nTransparency in agent interaction\nRobust, real-time AI performance\nData Sovereignty, Incentives, and Trust in Our Education Platform\nOur AI-Powered Personalized Education Platform leverages Hyperion’s blockchain to give students true control over their learning data and foster a trusted educational environment.\nData Sovereignty\nWe achieve data sovereignty by giving students self-sovereign identities (SSIs) on Hyperion. Critical learning milestones and verified skills are recorded as immutable hashes on-chain (MetisDB), tied to the student’s SSI. While detailed content stays off-chain, access is cryptographically linked to and controlled by the student. This means students decide who sees what data, creating a tamper-proof and verifiable record that’s genuinely theirs, free from central control.\nToken Incentives\nWe use a utility token, LearnPoints ($LP), to drive engagement:\nLearn-to-Earn (L2E): Students earn $LP for completing modules, mastering skills, and consistent engagement.\nContribution Rewards: Educators and community members earn $LP for creating content, providing feedback, or participating in forums.\nStaking & Governance: $LP can be staked for premium features or used to vote on platform decisions, aligning community interests.\nThese tokens incentivize participation, build a strong community, and add tangible value to learning achievements.\nImportance of Trust and Transparency\nIn education, trust and transparency are paramount:\nLearner Trust: Students need to trust that their achievements are real and that AI decisions (like tutoring paths) are fair and unbiased. On-chain verifiable credentials and transparent AI orchestration build this crucial trust.\nEmpowering Educators: Transparent data provides educators with reliable insights into student progress and curriculum effectiveness, reducing administrative burdens and fostering accountability.\nEquity & Accessibility: Blockchain prevents fraud and offers a universal, trusted way for students to showcase skills, democratizing opportunities regardless of background. Auditable AI decisions also help mitigate bias.\nSummary\nDeploying on Hyperion transforms our platform into a decentralized, verifiable, and trust-minimized educational ecosystem. Blockchain is the bedrock enabling trust in student progress, transparency in AI agent interactions, and robust real-time AI capabilities that define our personalized learning experience.\nCommunity Engagement Features\nPeer Study Groups: Connect with others for collaborative discussions and support.\nQ&A Forums: Ask and answer subject-related questions to deepen understanding.\nSimulated Collaboration: Practice teamwork in virtual, project-based learning scenarios.\nOptional Mentorship: Receive guidance from experienced peers and educators.\nProgress Sharing (Privacy-Controlled): Share milestones to motivate peers while maintaining control over visibility.\nCommunity Challenges: Participate in gamified group activities to promote engagement and friendly competition.\nTeam Members\n@amardeep\n@priyankg3",
        "comments_details": [
            {
                "author": "amardeep",
                "comment": "EduVerse: AI-Powered Personalized Education Platform\nProblem Statement\nStandardized education overlooks individual learning styles and paces, leading to disengagement and hindering student potential. Students and educators face the challenge of a rigid system that doesn’t adapt to diverse needs, impacting learning outcomes.\nSolution Overview\nOur AI-Powered Personalized Education Platform offers a dynamic solution by employing a multi-agent system built on the Alith Agentic Framework. Specialized AI agents collaboratively analyze individual learning styles, curate tailored content, provide adaptive tutoring, and track progress in real time. This creates a uniquely personalized learning journey that adjusts to each student’s needs and pace. By integrating diverse educational resources, the platform aims to enhance engagement, improve learning outcomes, and empower both students and educators.\nProject Description\nThis platform is designed to benefit a wide range of users across the educational landscape. Students of all ages, from kindergarten through higher education, can experience a more engaging and effective learning journey tailored to their specific needs. Educators can utilize the platform to enhance their teaching capabilities, gain deeper insights into student progress, and free up time for more individualized support.\nOn-Chain Components: A First-Class Implementation and Core Requirement for Blockchain Deployment\nOur AI-powered personalized education platform is not merely “blockchain-enhanced” — its core functionality and unique value proposition depend fundamentally on blockchain deployment via Hyperion. The decentralized, trustless, and immutable nature of blockchain—particularly Hyperion’s AI-optimized environment—is essential to realizing our vision.\nVerifiable and Immutable Learning Profiles (On-Chain Data Storage)\nWhat’s On-Chain:\nStudent learning profiles—containing hashed learning milestones, verified skills, and personalized path progress—are recorded on Hyperion’s MetisDB. Each profile includes:\nA unique student identifier\nImmutable logs of achievements\nReferences to off-chain AI agent interactions and curated learning content\nWhy It Needs Blockchain:\nTrustless Verification:\nCentralized educational records are prone to tampering and lack transparency. On-chain profiles offer tamper-proof, auditable records of a learner’s journey—verifiable by students, employers, and academic institutions alike.\nData Sovereignty:\nStudents retain full control of their learning data. On-chain metadata ensures ownership and transparency, unlike siloed centralized platforms.\nFoundation for AI Credentialing:\nImmutable learning progress forms the backbone for future AI-driven credentialing systems. AI-generated content, assessments, and learning paths can be reliably tied to a verifiable blockchain record.\nDecentralized Agent Coordination and Trust (Smart Contract Architecture)\nWhat’s On-Chain:\nAgent Registry & Capabilities:\nAll core agents (e.g., Learning Style Analyst, Content Curator, Personalized Tutor) are registered via smart contracts, with:\nUnique IDs\nDefined roles and permissions\nClear scope of data access and processing\nService Agreements & Orchestration Logic:\nSmart contracts manage agent workflows. For example:\nCompletion of a module may trigger the Progress Tracker\nUpon validation, the Personalized Tutor recommends next steps\nIncentive Mechanisms:\nToken-based rewards for learning milestones, community engagement, and future decentralized agent marketplaces.\nWhy It Needs Blockchain:\nTrustless Agent Interaction:\nIn a multi-agent system, blockchain ensures agent behaviors and interactions are transparent, verifiable, and not reliant on a centralized authority.\nGuaranteed Execution:\nSmart contracts enforce the deterministic execution of workflows, ensuring learning paths adapt in real time based on defined rules.\nImmutable Rules:\nEducational logic, access rights, and reward systems are hard-coded and transparent, fostering trust and accountability.\nAI Enablement via the Alith Agentic Framework\nWhat is Alith:\nAlith is a modular, multi-agent framework designed to power personalized learning by simulating human-like reasoning, memory, and collaboration among AI agents. It forms the intelligence layer of our platform, with deep interoperability with blockchain systems like Hyperion.\nKey Features of Alith:\nAgent Management:\nModular deployment of specialized AI agents:\nLearning Style Analyst\nContent Curator\nPersonalized Tutor\nProgress Tracker\nCollaboration Facilitator\nPersistent Memory:\nAgents maintain long-term memory and context across sessions, enhancing personalization.\nInter-Agent Communication:\nSecure and structured communication between agents, enabling dynamic, cooperative behavior.\nToolchain Access:\nSeamless access to external APIs, knowledge bases, and assessments.\nBlockchain Integration with Alith:\nOn-Chain Agent Registry:\nAll Alith agents are registered on-chain, with roles and capabilities enforced via smart contracts.\nCoordinated Workflow Execution:\nAlith agent interactions are triggered and validated by smart contracts, enabling a trustless education logic layer.\nToken-Driven Incentives:\nAgents’ performance and student outcomes can be linked to on-chain reward systems to drive engagement and adaptive learning.\nPlanned Enhancements for Alith\nTo further improve the personalization, decentralization, and performance of the Alith framework, we are planning several critical upgrades:\n1. Decentralized Agent Marketplace\nAllow community developers to contribute new agents (e.g., specialized tutors or regional content curators)\nAgents will be published and authenticated on-chain with verifiable capabilities\nToken-based reputation and staking mechanisms will prevent misuse or malicious behavior\n2. Agent Fine-Tuning via Federated Learning\nSupport for secure, privacy-preserving personalization of agent behavior based on user feedback\nFine-tuning AI agents locally or within federated clusters, without compromising sensitive student data\n3. ZK-Verifiable Inference\nIntegrate zkML (zero-knowledge machine learning) to enable cryptographic verification of off-chain AI outputs\nThis allows validators and institutions to confirm an agent’s decision (e.g., a test score) without exposing the underlying model or input\n4. Composable Agent Workflows\nEnable developers and educators to compose reusable learning workflows by chaining agents together via simple declarative schemas\nBacked by on-chain validation to ensure logical and pedagogical soundness\n5. Multilingual & Accessibility Agents\nCreate plug-and-play AI agents specialized in localization, translation, and neurodiverse learning strategies\nThese agents will leverage both on-chain registries and external toolchains for broader inclusion\nSecure, Real-Time AI Inference (Leveraging Hyperion’s AI-Native Infrastructure)\nWhat’s On-Chain (or Hyperion-enabled):\nWhile most heavy AI workloads (e.g., model training, long-form inference) run off-chain via the Alith framework, Hyperion enables:\nLightweight on-chain AI inferences for rapid adaptation and scoring\nSmart contract–verified AI outputs to ensure compliance with educational standards\nReal-time coordination between on-chain logic and off-chain AI services\nWhy It Needs Blockchain:\nVerifiable AI Outputs:\nAI-driven assessments and tutor recommendations can be validated on-chain, ensuring educational integrity and transparency—unlike opaque, centralized AI systems.\nLow Latency, High Throughput:\nHyperion’s parallel execution environment supports responsive, adaptive AI interactions critical to keeping learners engaged.\nScalable AI Coordination:\nIntegrating real-time AI decision-making into a decentralized, tamper-proof environment offers performance benefits without compromising trust or cost-efficiency.\nConclusion: Blockchain as the Foundation, Not a Feature\nDeploying on Hyperion transforms the platform from an advanced AI education app into a decentralized, verifiable, trust-minimized learning ecosystem. The blockchain is not an add-on — it is the bedrock of:\nTrust in student progress\nTransparency in agent interaction\nRobust, real-time AI performance\nData Sovereignty, Incentives, and Trust in Our Education Platform\nOur AI-Powered Personalized Education Platform leverages Hyperion’s blockchain to give students true control over their learning data and foster a trusted educational environment.\nData Sovereignty\nWe achieve data sovereignty by giving students self-sovereign identities (SSIs) on Hyperion. Critical learning milestones and verified skills are recorded as immutable hashes on-chain (MetisDB), tied to the student’s SSI. While detailed content stays off-chain, access is cryptographically linked to and controlled by the student. This means students decide who sees what data, creating a tamper-proof and verifiable record that’s genuinely theirs, free from central control.\nToken Incentives\nWe use a utility token, LearnPoints ($LP), to drive engagement:\nLearn-to-Earn (L2E): Students earn $LP for completing modules, mastering skills, and consistent engagement.\nContribution Rewards: Educators and community members earn $LP for creating content, providing feedback, or participating in forums.\nStaking & Governance: $LP can be staked for premium features or used to vote on platform decisions, aligning community interests.\nThese tokens incentivize participation, build a strong community, and add tangible value to learning achievements.\nImportance of Trust and Transparency\nIn education, trust and transparency are paramount:\nLearner Trust: Students need to trust that their achievements are real and that AI decisions (like tutoring paths) are fair and unbiased. On-chain verifiable credentials and transparent AI orchestration build this crucial trust.\nEmpowering Educators: Transparent data provides educators with reliable insights into student progress and curriculum effectiveness, reducing administrative burdens and fostering accountability.\nEquity & Accessibility: Blockchain prevents fraud and offers a universal, trusted way for students to showcase skills, democratizing opportunities regardless of background. Auditable AI decisions also help mitigate bias.\nSummary\nDeploying on Hyperion transforms our platform into a decentralized, verifiable, and trust-minimized educational ecosystem. Blockchain is the bedrock enabling trust in student progress, transparency in AI agent interactions, and robust real-time AI capabilities that define our personalized learning experience.\nCommunity Engagement Features\nPeer Study Groups: Connect with others for collaborative discussions and support.\nQ&A Forums: Ask and answer subject-related questions to deepen understanding.\nSimulated Collaboration: Practice teamwork in virtual, project-based learning scenarios.\nOptional Mentorship: Receive guidance from experienced peers and educators.\nProgress Sharing (Privacy-Controlled): Share milestones to motivate peers while maintaining control over visibility.\nCommunity Challenges: Participate in gamified group activities to promote engagement and friendly competition.\nTeam Members\n@amardeep\n@priyankg3"
            },
            {
                "author": "arbilearn",
                "comment": "This is surely a great concept, waiting to see it come to live"
            },
            {
                "author": "ThalaZikol",
                "comment": "Impressive project! The combination of multi-agent AI and Hyperion blockchain creates a personalized, transparent, and trustworthy education platform. Features like SSI, Learn-to-Earn, and zkML show long-term vision and innovation. Looking forward to seeing EduVerse grow!"
            },
            {
                "author": "Keir",
                "comment": "bu özel bilgiler ıcın teşekkürlerrr"
            },
            {
                "author": "ravisharma",
                "comment": "Really like the detailed proposal..\nHope your project select for build.\nBest wishes."
            },
            {
                "author": "Shruti",
                "comment": "education is a very important part of our life, glad you touch the real problem and trying to solve this with the help of AI"
            },
            {
                "author": "arbilearn",
                "comment": "Great idea, Happy Hacking"
            },
            {
                "author": "deadman_xbt",
                "comment": "This is by far the best proposal of hyperhack , right now.\nimpressed by the usage of alith and AI in education category.\nhope it turned out to be a super product and solve the problems.\ngood luck"
            },
            {
                "author": "heromatters",
                "comment": "Hello\n@amardeep\n,\nFirst of all, thank you for presenting the proposal on such an important narrative — education.\nI have few questions :-\nHow does EduVerse plan to balance AI personalization with curriculum standardization, especially for formal education systems that require fixed syllabi and assessments?\nHow does EduVerse ensure a smooth experience for users who are new to both AI and blockchain (students, teachers, or even schools)?"
            },
            {
                "author": "amardeep",
                "comment": "heromatters:\nHello\n@amardeep\n,\nFirst of all, thank you for presenting the proposal on such an important narrative — education.\nThank you so much for your kind words and for taking the time to go through the proposal.\nI would like to answer your both questions\nBalancing Personalization & Standardization:\nEduVerse’s AI works within the set curriculum, not outside it. It helps students learn at their own pace and style while making sure they cover everything required. For teachers, it highlights exactly where students need help, so they can focus their efforts more effectively—without losing control of the classroom.\nHelping New Users Feel at Home:\nWe keep things simple. Instead of talking tech, we show the benefits—like personalized learning and instant feedback. The platform is easy to use, with gamified learning for students and clear dashboards for teachers. Blockchain runs quietly in the background—users just see that their records are secure and portable. Plus, we offer helpful guides and real human support.\nFeel free to ask further.\nThank you."
            },
            {
                "author": "Cryptopotato",
                "comment": "Hello\n@amardeep\nWhy did you choose Hyperion specifically for EduVerse instead of other chains like NEAR or Avalanche that also offer AI integrations and scalability?\nWhat strategies are used to detect and correct AI biases in agent decision-making (e.g., tutoring paths, performance assessments)?"
            },
            {
                "author": "amardeep",
                "comment": "Thanks for your questions.\nWhy Hyperion for EduVerse?\nWe chose Hyperion over other chains like NEAR or Avalanche because it’s built for AI-native Web3 applications, perfectly fitting EduVerse’s needs:\nNative AI Optimization: Hyperion’s MetisVM and AI co-processor are designed to efficiently run and verify AI workloads directly on-chain. This means more trustworthy and cost-effective AI decisions compared to other chains that simply “support” AI.\nDirect Alith Integration: Hyperion has a direct, announced integration with the Alith Agentic Framework, which is the core of our multi-agent system. This makes developing and deploying our AI agents much smoother.\nReal-Time Performance: Its parallel execution and high throughput (with MetisDB for data) ensure a super responsive and scalable learning experience, crucial for instant AI feedback and interactions.\nCost-Efficiency: As a Layer 2, Hyperion offers lower transaction costs, making expensive AI operations more viable for a large educational platform.\nHow We Detect & Correct AI Biases?\nDiverse Training Data: We’ll use very diverse datasets to train our AI, making sure it learns from a wide range of students and backgrounds. We’ll also use techniques like data balancing to prevent underrepresentation.\nFairness-Aware Algorithms: We’ll build our AI models using algorithms specifically designed to reduce performance disparities across different groups, constantly monitoring with fairness metrics.\nHuman Oversight: Educators and experts will review AI-suggested paths and assessments. Their feedback will directly help refine the AI.\nThank you"
            },
            {
                "author": "amardeep",
                "comment": "Project update:\nGithub : GitHub - amardeepio/Eduverse\nproject update:\nHey everyone,\nWhen you click that “Complete Module” button, something really cool happens behind the scenes. Think of it like getting a digital diploma notarized on the blockchain.\nHere’s the simple 3-step process:\nYou Sign the Diploma: Your MetaMask wallet pops up and asks you to “sign” a message. This is like putting your unique, unforgeable signature on the diploma, proving you completed the work. It’s completely free and doesn’t cost any gas.\nA Secure Courier Delivers It: Our server acts as a secure courier. It takes your signed diploma and delivers it to the blockchain to be officially recorded.\nThe Blockchain Notarizes It: The smart contract acts as a public notary. It mathematically verifies that your signature is authentic. Once verified, it permanently stamps your achievement into its public ledger.\nThat’s it! The “Achievement Unlocked” message means your accomplishment is now a permanent, verifiable part of your learning history that you, and only you, control with your wallet.\nThanks\n@pavel\n@t0mcr8se\n@daryl"
            },
            {
                "author": "daryl",
                "comment": "Great update\n@amardeep\n!"
            },
            {
                "author": "CrisMetis",
                "comment": "Really cool idea! I believe putting together multi-agent AI with the Hyperion blockchain makes EduVerse feel both smart and trustworthy. Love the direction with features like Learn-to-Earn. Really exited to see where it goes!"
            },
            {
                "author": "amardeep",
                "comment": "Thanks a lot for the appreciation."
            },
            {
                "author": "sumankr",
                "comment": "Very Nice Idea!\n@amardeep"
            },
            {
                "author": "amardeep",
                "comment": "EduVerse Progress Update\nHey everyone,\nWe’ve made progress on the EduVerse platform, and we’re excited to share what’s now fully functional! We’ve built and integrated the core components of our vision for a personalized, on-chain educational experience.\nFull User Login & Session Management\nUsers can securely Sign-In with Ethereum via MetaMask.\nCreates a verifiable session to track progress — no email/password required!\nDynamic Course & Quiz System\nClean, tile-based layout for all available courses.\nUsers can browse topics, pick a course, and take a multi-question quiz.\nOn-Chain Achievements\nUpon quiz completion, users sign a message via wallet.\nThe ProgressTrackerAgent sends this to our smart contract.\nA verifiable credential (your on-chain diploma) is minted on the Hyperion Testnet.\nUsers receive a transaction link to view their credential instantly!\nMulti-Agent AI Backend (Alith Framework)\nWe’ve evolved into a true multi-agent system, including:\nAPI Gateway – Handles all user requests.\nAgent Service – Coordinates our AI agents.\nTutorChatAgent – Powered by Alith + DeepSeek + Gemini, provides smart, conversational, context-aware help for any course.\nQuizHintAgent – Offers conceptual hints during quizzes (no spoilers!).\nEnhanced User Experience\nAdded typewriter animation to AI responses for a more human-like feel.\nLoading animations enhance responsiveness and polish.\nWe’re proud of how far we’ve come — but this is just the beginning. EduVerse is becoming a living, breathing learning companion for the decentralized world!\nLet us know your thoughts, feedback, or ideas!\nScreen capture of progress till now\nThank you"
            },
            {
                "author": "amardeep",
                "comment": "Screen capture video link in good quality Eduverse screen capture"
            },
            {
                "author": "heromatters",
                "comment": "This is truly amazing amar and thanks for sharing the update.\nThe UI looks so cool."
            }
        ]
    },
    {
        "id": "a5570e1023bb562b",
        "topic_id": "4909",
        "title": "Sentinel: AI Powered Smart Contract Analyzer",
        "url": "https://forum.ceg.vote/t/sentinel-ai-powered-smart-contract-analyzer/4909",
        "views": "",
        "comments": "18",
        "created_date": "May 29, 2025 6:24 am",
        "latest_activity": "Jul 3, 2025 6:22 am",
        "content": "Sentinel: Real-Time Smart Contract Defense Layer for Metis Hyperion\nProblem Statement\nSmart contract exploits are costing the ecosystem billions — and it’s not because developers don’t care about security. It’s because the tools to proactively defend against live attacks simply don’t exist. Audits are static, expensive, and quickly outdated. Most teams are forced to choose between shipping fast or staying safe. That’s the real tradeoff we want to destroy.\nSolution Overview\nSentinel is a real-time smart contract defense layer built natively for the Metis Hyperion stack. Think of it like a firewall and AI auditor for your dApps — detecting threats, scoring risks, and rerouting execution before exploits drain your contracts. It’s modular, trustless, and privacy-preserving by design.\nWhat makes Sentinel different is it doesn’t just audit contracts after they’re built — it actively protects them while they run, leveraging encrypted mempools, ZK proofs, and a self-healing mechanism that respects immutability.\nArchitecture Overview\nProject Description\nSentinel is a Web3-native security layer that plugs into smart contracts without requiring devs to rewrite them. Its core features include:\nAI-Powered Audit Engine trained on datasets from Quill Audits, ScrawID, and public audit corpora.\nSmart Contract Firewall that inspects and filters transaction behaviors in real time.\nSelf-Healing Contracts that redirect execution to patched logic without mutating on-chain state.\nOn-Chain Security Score to build user trust and prove protocol integrity.\nWe’re building on Metis Hyperion because of its:\nEncrypted mempool and zkVM execution environment\nParallel execution support\nModular, developer-friendly architecture\nDevelopers interact with Sentinel via CLI tools, SDKs, or dashboards — making it easy to integrate security into existing workflows.\nWhat excites us? We’re flipping the paradigm — from audits as a checkbox to security as a continuous, runtime service.\nCommunity Engagement Features\nWe’re turning smart contract security into a game.\nPoints System\nEarn points on-chain\nRedeem them for Sentinel access, merch, NFTs, or governance perks\nLeaderboard for most secure builders\nWhy It Works\nThis incentivizes adoption through a feedback loop:\nTeams secure their projects\nUsers learn by testing\nCommunities gain trust\nGetting Involved\nSentinel is more than a tool — it’s a movement to make Web3 safer by default.\nHere’s how you can contribute:\nDevelopers: Build the CLI, SDK, and score dashboard\nAI Hackers: Train and tune models with audit data\nSecurity Experts: Join our DAO to review patches and audit logic\nCommunity Creators: Educate, test, promote — be part of the mission\nInterested? DM me\nDiagram Space\nWhat’s Next?\nFor this hackathon, we’re focusing on shipping an AI-powered audit engine with 1–2 of the above features. Long-term, Sentinel will evolve into a full-blown security operating layer for Metis and beyond.\nTogether, we can make Web3 unbreakable.",
        "comments_details": [
            {
                "author": "Aryanzutshi",
                "comment": "Sentinel: Real-Time Smart Contract Defense Layer for Metis Hyperion\nProblem Statement\nSmart contract exploits are costing the ecosystem billions — and it’s not because developers don’t care about security. It’s because the tools to proactively defend against live attacks simply don’t exist. Audits are static, expensive, and quickly outdated. Most teams are forced to choose between shipping fast or staying safe. That’s the real tradeoff we want to destroy.\nSolution Overview\nSentinel is a real-time smart contract defense layer built natively for the Metis Hyperion stack. Think of it like a firewall and AI auditor for your dApps — detecting threats, scoring risks, and rerouting execution before exploits drain your contracts. It’s modular, trustless, and privacy-preserving by design.\nWhat makes Sentinel different is it doesn’t just audit contracts after they’re built — it actively protects them while they run, leveraging encrypted mempools, ZK proofs, and a self-healing mechanism that respects immutability.\nArchitecture Overview\nProject Description\nSentinel is a Web3-native security layer that plugs into smart contracts without requiring devs to rewrite them. Its core features include:\nAI-Powered Audit Engine trained on datasets from Quill Audits, ScrawID, and public audit corpora.\nSmart Contract Firewall that inspects and filters transaction behaviors in real time.\nSelf-Healing Contracts that redirect execution to patched logic without mutating on-chain state.\nOn-Chain Security Score to build user trust and prove protocol integrity.\nWe’re building on Metis Hyperion because of its:\nEncrypted mempool and zkVM execution environment\nParallel execution support\nModular, developer-friendly architecture\nDevelopers interact with Sentinel via CLI tools, SDKs, or dashboards — making it easy to integrate security into existing workflows.\nWhat excites us? We’re flipping the paradigm — from audits as a checkbox to security as a continuous, runtime service.\nCommunity Engagement Features\nWe’re turning smart contract security into a game.\nPoints System\nEarn points on-chain\nRedeem them for Sentinel access, merch, NFTs, or governance perks\nLeaderboard for most secure builders\nWhy It Works\nThis incentivizes adoption through a feedback loop:\nTeams secure their projects\nUsers learn by testing\nCommunities gain trust\nGetting Involved\nSentinel is more than a tool — it’s a movement to make Web3 safer by default.\nHere’s how you can contribute:\nDevelopers: Build the CLI, SDK, and score dashboard\nAI Hackers: Train and tune models with audit data\nSecurity Experts: Join our DAO to review patches and audit logic\nCommunity Creators: Educate, test, promote — be part of the mission\nInterested? DM me\nDiagram Space\nWhat’s Next?\nFor this hackathon, we’re focusing on shipping an AI-powered audit engine with 1–2 of the above features. Long-term, Sentinel will evolve into a full-blown security operating layer for Metis and beyond.\nTogether, we can make Web3 unbreakable."
            },
            {
                "author": "zuzuzu",
                "comment": "its amazing how the way you craft and explain it.."
            },
            {
                "author": "Aryanzutshi",
                "comment": "@zuzuzu\n\nThanks a lot, that really means a lot to me! I’m just trying to explain things clearly and honestly. Glad it came through"
            },
            {
                "author": "zuzuzu",
                "comment": "yep, i kinda like your vision.. keep it up man"
            },
            {
                "author": "han",
                "comment": "How does the self-healing mechanism work, and how does it provide security without conflicting with the immutability of smart contracts?\nWhat benefits could this bring to the Hyperion and broader Metis ecosystem?"
            },
            {
                "author": "Aryanzutshi",
                "comment": "@han\n\nThe self-healing method only redirects to a secure smart contract, similar to a checkpoint, that does not conflict with immutability. It will never alter the contract state or have an impact on local storage.\nThe advantages, in my opinion, are enormous since smart contracts always require security. whether it’s a fledgling business or an established one. Additionally, I intended to attend tech presentations and workshops, which will boost Metis’s population and Sentinel’s appeal."
            },
            {
                "author": "ThalaZikol",
                "comment": "You mentioned ZK Proofs, but it’s not clear exactly where they are applied in the pipeline — audit validation? Proof of patch? Proof of no tampering?"
            },
            {
                "author": "Aryanzutshi",
                "comment": "Hi\n@ThalaZikol\n, sorry for the confusion.\nI’m using ZK proofs in the auditing process to cryptographically prove that the smart contract hasn’t been tampered with after audit and validation."
            },
            {
                "author": "priyankg3",
                "comment": "How is the smart contract firewall implemented at the protocol level?\nHow does the AI-powered audit engine determine threat severity?"
            },
            {
                "author": "ubinhash",
                "comment": "How are the threat identified? Is it from previously known issues or does the engine detect potential logic flaw?\nIt would be cool if the analyzer can generate POC for the exploit."
            },
            {
                "author": "Aryanzutshi",
                "comment": "Hi\n@priyankg3\n, sorry for the late reply\nAt the protocol level, a smart contract firewall hooks into the execution engine (like EVM) to inspect critical operations in real time, enforcing security rules before state changes occur. On Metis, it can integrate with the Optimistic Rollup’s fraud-proof system to catch and challenge malicious transactions, with optional ZK proofs to verify integrity without revealing contract internals.\nThreat severity will be determined using multiple sources, primarily ScrawID, a repository of known smart contract exploits used by tools like Slither and Mythril. Enriched with data scraped from public audit reports such as those from Quill Audits, disclosed vulnerabilities, and any verifiable security findings available across the ecosystem."
            },
            {
                "author": "Aryanzutshi",
                "comment": "Hi\n@ubinhash\nI want to incorporate data from sources like ScrawID and various audit report findings into my platform. To keep this native and reliable, I’m planning to build a master database that aggregates these findings, but only by following strict policies that require explicit user consent before storing any audit data.\nThis way, the database remains accurate, compliant, and user-trusted.\nWould love your thoughts on this approach!"
            },
            {
                "author": "ubinhash",
                "comment": "That’s interesting and it sounds like a pretty ambitious project (in a good way)!\nTraining on scrawlID will probably be very helpful at identifying existing bugs! Do you plan on incorporating some non-AI method (eg fuzzing & taint analysis) to aid the process for discovering potentially new issues?"
            },
            {
                "author": "Aryanzutshi",
                "comment": "Hey\n@ubinhash\n, not at the moment. This project is proving to be pretty time-intensive. But definitely down to explore it after HyperHack."
            },
            {
                "author": "nidhinakranii",
                "comment": "@Aryanzutshi\nThis is\none idea that might boost Sentinel’s privacy layer is using Alith’s TEE module to run your AI audit logic securely — like detecting threats or scoring risks inside a secure enclave\nmakes your defense engine more trustless & keeps sensitive detection logic private — fits cleanly with your zkVM + encrypted mempool setup\nworth a peek: Trusted Execution Environment (TEE) - Alith\nLet me know if you have more questions."
            },
            {
                "author": "Aryanzutshi",
                "comment": "Hi\n@nidhinakranii\n,\nThank you so much for your Input. I will make sure to include Trusted Execution Environment (TEE) in the architecture of Sentinel."
            },
            {
                "author": "nidhinakranii",
                "comment": "Would love to see this integration. Please reach out to me for more support.\n@EchoPabli on tele."
            },
            {
                "author": "han",
                "comment": "Thank you for the clear explanation. self-healing checkpoints sound like a smart way to enhance security without compromising immutability.\nJust one question: How do you envision the user experience when a contract triggers a self-healing redirect? Will it be seamless or require any manual intervention?"
            },
            {
                "author": "Aryanzutshi",
                "comment": "Hey guys,\njust an update I just finished the whitepaper for Sentinel and would love for everyone to throw some suggestions as to how to structure it according to both developers and normal users.\nHere is the link: Whitepaper and documentation site\nGuilds > Marketing Guild\nGuilds > Builders Guild\nGuilds > Operators Guild\nHyperHack > Ideathon"
            }
        ]
    },
    {
        "id": "c42b7a5a3f95cfc2",
        "topic_id": "5975",
        "title": "Are We Talking to People or Bots? Finding the Balance with AI in Community Management",
        "url": "https://forum.ceg.vote/t/are-we-talking-to-people-or-bots-finding-the-balance-with-ai-in-community-management/5975",
        "views": "",
        "comments": "10",
        "created_date": "Jun 26, 2025 4:37 am",
        "latest_activity": "Jul 3, 2025 3:40 am",
        "content": "Are We Talking to People or Bots? Finding the Balance with AI in Community Management\nAs AI tools continue to get sharper, faster, and more integrated into workflows, one area that’s seeing heavy adoption is community management. From Discord bots handling roles to Telegram assistants catching spam and answering FAQs, automation has made communities more scalable—but also a bit more… robotic.\nAnd that’s where the tension sits.\nOn one hand, AI improves efficiency. Response times drop. Repetitive questions are handled without stress. Moderators aren’t stretched thin chasing every notification. You can run lean and still look active. Tools like custom GPTs, auto-tagging bots, and AI-powered sentiment trackers offer real value.\nBut here’s the question. Are users still feeling heard? Or are we building community experiences that feel like talking into a wall of scripts and auto-replies?\nIn fast-moving ecosystems like crypto, this balance matters more than ever. We want scale, but we also want soul. We want speed, but we also want warmth. A community can have hundreds of messages a day, but if none of it feels human, people leave.\nSo what does a healthy mix look like?\nAI bots that provide answers should be trained with community tone, not just facts\nMods can use AI to surface important messages, but still follow up with real replies\nWelcome messages can be automated, but should lead to live community pathways\nAutomated responses should trigger human handoffs when needed—not loop forever\nUse AI to enable human interaction, not replace it\nIn some cases, AI can even improve how humans show up. Imagine a tool that identifies overlooked questions or recommends which mods should handle what. AI can boost presence—it shouldn’t eliminate it.\nBut we also have to be real. Some users prefer the speed of a quick automated answer. Not everyone wants a conversation. And for global communities, AI helps cover time zones, filter spam, and make sure nothing gets lost. That’s useful.\nSo let’s have the conversation\nHave you ever felt like a community was too AI and bot-heavy? What made it feel that way?",
        "comments_details": [
            {
                "author": "Norbert",
                "comment": "Are We Talking to People or Bots? Finding the Balance with AI in Community Management\nAs AI tools continue to get sharper, faster, and more integrated into workflows, one area that’s seeing heavy adoption is community management. From Discord bots handling roles to Telegram assistants catching spam and answering FAQs, automation has made communities more scalable—but also a bit more… robotic.\nAnd that’s where the tension sits.\nOn one hand, AI improves efficiency. Response times drop. Repetitive questions are handled without stress. Moderators aren’t stretched thin chasing every notification. You can run lean and still look active. Tools like custom GPTs, auto-tagging bots, and AI-powered sentiment trackers offer real value.\nBut here’s the question. Are users still feeling heard? Or are we building community experiences that feel like talking into a wall of scripts and auto-replies?\nIn fast-moving ecosystems like crypto, this balance matters more than ever. We want scale, but we also want soul. We want speed, but we also want warmth. A community can have hundreds of messages a day, but if none of it feels human, people leave.\nSo what does a healthy mix look like?\nAI bots that provide answers should be trained with community tone, not just facts\nMods can use AI to surface important messages, but still follow up with real replies\nWelcome messages can be automated, but should lead to live community pathways\nAutomated responses should trigger human handoffs when needed—not loop forever\nUse AI to enable human interaction, not replace it\nIn some cases, AI can even improve how humans show up. Imagine a tool that identifies overlooked questions or recommends which mods should handle what. AI can boost presence—it shouldn’t eliminate it.\nBut we also have to be real. Some users prefer the speed of a quick automated answer. Not everyone wants a conversation. And for global communities, AI helps cover time zones, filter spam, and make sure nothing gets lost. That’s useful.\nSo let’s have the conversation\nHave you ever felt like a community was too AI and bot-heavy? What made it feel that way?"
            },
            {
                "author": "han",
                "comment": "Absolutely some communities feel too artificial. Template replies, generic welcome messages, and lack of real interaction make it obvious.\nAI is helpful, but it should stay in a supporting role. Use bots for scale, people for connection.\nA great question to ask the community:\nHave you ever felt like you were only talking to bots in a community? When did that happen?"
            },
            {
                "author": "Norbert",
                "comment": "I agree with this, AI is here to help not takeover"
            },
            {
                "author": "CrisMetis",
                "comment": "Great topic Norbert, and it feels to me that too many new communities in web3, but also in web2 are becoming more often some kind of talking to a wall, where not really meaningful interaction is created, but more kind of a bullet point/list answer is given.\nSo the healthy mix is definetely helpful, and I totally agree on most of them, underlining the importance of * Use AI to enable human interaction, not replace it. Well said."
            },
            {
                "author": "Norbert",
                "comment": "In as much as these AI tools are improving efficiency, i still have this odd feeling when customer service of any web 2 company, and even in web3, pops up with an AI chat bot. Maybe i need time to find the balance, i still prefer human interactions."
            },
            {
                "author": "irinaina",
                "comment": "Interesting question — and yes, you can immediately sense when a community feels too bot-heavy.\nIt shows up when you join the chat and get restricted or banned for asking completely natural questions instead of receiving real answers.\nHaving an AI agent in the chat isn’t necessarily the problem. AI can be helpful — answering frequently asked questions, sharing official links, or providing updated project information. But the presence of human admins is always crucial.\nWhat often makes it worse is when humans start mimicking bots themselves, replying with scripted, impersonal messages. Authentic, organic communication matters. It’s about speaking not just on behalf of the project or the team but on behalf of the community too.\nIt means sharing your ups and downs, asking for support when you need it, and offering support when others do.\nEmpathy, compassion, and authenticity are what make any interaction feel real — and what ultimately builds trust."
            },
            {
                "author": "David",
                "comment": "Norbert:\nAre We Talking to People or Bots? Finding the Balance with AI in Community Management\nAs AI tools continue to get sharper, faster, and more integrated into workflows, one area that’s seeing heavy adoption is community management. From Discord bots handling roles to Telegram assistants catching spam and answering FAQs, automation has made communities more scalable—but also a bit more… robotic.\nAnd that’s where the tension sits.\nOn one hand, AI improves efficiency. Response times drop. Repetitive questions are handled without stress. Moderators aren’t stretched thin chasing every notification. You can run lean and still look active. Tools like custom GPTs, auto-tagging bots, and AI-powered sentiment trackers offer real value.\nBut here’s the question. Are users still feeling heard? Or are we building community experiences that feel like talking into a wall of scripts and auto-replies?\nIn fast-moving ecosystems like crypto, this balance matters more than ever. We want scale, but we also want soul. We want speed, but we also want warmth. A community can have hundreds of messages a day, but if none of it feels human, people leave.\nSo what does a healthy mix look like?\nAI bots that provide answers should be trained with community tone, not just facts\nMods can use AI to surface important messages, but still follow up with real replies\nWelcome messages can be automated, but should lead to live community pathways\nAutomated responses should trigger human handoffs when needed—not loop forever\nUse AI to enable human interaction, not replace it\nIn some cases, AI can even improve how humans show up. Imagine a tool that identifies overlooked questions or recommends which mods should handle what. AI can boost presence—it shouldn’t eliminate it.\nBut we also have to be real. Some users prefer the speed of a quick automated answer. Not everyone wants a conversation. And for global communities, AI helps cover time zones, filter spam, and make sure nothing gets lost. That’s useful.\nSo let’s have the conversation\nHave you ever felt like a community was too AI and bot-heavy? What made it feel that way?\nOne approach I’ve seen work well: AI handles the first layer (like FAQs or tagging), but mods jump in for nuance or follow-up. Also love the point about training bots in the community’s tone,makes a huge difference in how “seen” people feel."
            },
            {
                "author": "Elenaisplaying",
                "comment": "Totally agree with this. AI is great for scaling, but when overused, it risks making communities feel cold or transactional. I’ve seen the best results when AI handles surface-level tasks (FAQs, spam), while real humans jump in for context and care.\nCurious has anyone tried fine-tuning bots specifically on community culture or tone? Did it work?"
            },
            {
                "author": "Elena",
                "comment": "I think it would be great to have an AI agent moderator that \"knows\"it’s community and can tag and involve into the conversation community members based on their previous questions and discussions. Not just answering questions, but enable the interaction and communication between community members."
            },
            {
                "author": "han",
                "comment": "BTW, A voice-enabled AI helper could be a game-changer imagine it actively participating in Spaces, answering community questions in real-time, or even recapping key points afterward. It could also assist in chat by offering context-aware answers, guiding newcomers, and keeping the convo on track. Basically, an AI moderator with a voice and a brain."
            },
            {
                "author": "priyankg3",
                "comment": "Norbert:\nSo what does a healthy mix look like?\nI think we should use AI as a tool to make our work easier and faster. It can save us a lot of time and effort, but we shouldn’t rely on it too much.\nWhile AI can handle a lot of tasks, depending entirely on it isn’t the best option. If we reduce human involvement too much, it could have negative effects, both economically and socially. We still need humans to control and guide the technology. If tech ends up completely in the hands of machines, the future could be unpredictable. The key is to find the right balance between using AI and keeping human oversight."
            }
        ]
    },
    {
        "id": "2e061fa21a4f32cc",
        "topic_id": "6084",
        "title": "Public vs Private Web: A New Layered Approach to Web3 Marketing",
        "url": "https://forum.ceg.vote/t/public-vs-private-web-a-new-layered-approach-to-web3-marketing/6084",
        "views": "",
        "comments": "4",
        "created_date": "Jul 1, 2025 7:38 am",
        "latest_activity": "Jul 3, 2025 3:38 am",
        "content": "I recently watched a TikTok video describing a shift I think a lot of us are feeling even if we haven’t put it into words yet: The internet is splitting into two layers - the public and the private.\nOn the public web, content is everywhere, often AI-generated, fast, and recycled. It’s noisy, but still powerful for reach.\nOn the private web, people are leaning into closed communities like Discord, Telegram, Substack, and group chats where they trust the source, not the algorithm.\nThis doesn’t mean the public internet is dead. Far from it. It’s still where discovery happens. But the trust? The real conversations? The long-term belief? - They’re increasingly moving behind the curtain.\nWhat This Means for Web3 Marketing\nWeb3 is all about community, but we often default to a single layer of strategy:\nPost on X\nAirdrop for engagement\nTry to go viral\nWhat if we added layers instead of relying on one shot?\nPublic web layer => Spark curiosity, build surface-level awareness\nPrivate spaces layer => Nurture trust, convert belief into belonging\nOnchain layer => Align actions with value in a provable, transparent way\nInstead of choosing between the two, the most effective strategies embrace both: Use threads or videos to spark ideas… Then guide people into Telegrams, forums, or token-gated spaces where they can go deeper.\nThe internet is changing. Not collapsing. Not breaking. Just layering. And Web3 is uniquely positioned to design for that. My concern: How do we balance public reach with private trust in our marketing efforts? Are we doing enough to design high-signal spaces people want to stay in? Would love to hear from others",
        "comments_details": [
            {
                "author": "Elenaisplaying",
                "comment": "I recently watched a TikTok video describing a shift I think a lot of us are feeling even if we haven’t put it into words yet: The internet is splitting into two layers - the public and the private.\nOn the public web, content is everywhere, often AI-generated, fast, and recycled. It’s noisy, but still powerful for reach.\nOn the private web, people are leaning into closed communities like Discord, Telegram, Substack, and group chats where they trust the source, not the algorithm.\nThis doesn’t mean the public internet is dead. Far from it. It’s still where discovery happens. But the trust? The real conversations? The long-term belief? - They’re increasingly moving behind the curtain.\nWhat This Means for Web3 Marketing\nWeb3 is all about community, but we often default to a single layer of strategy:\nPost on X\nAirdrop for engagement\nTry to go viral\nWhat if we added layers instead of relying on one shot?\nPublic web layer => Spark curiosity, build surface-level awareness\nPrivate spaces layer => Nurture trust, convert belief into belonging\nOnchain layer => Align actions with value in a provable, transparent way\nInstead of choosing between the two, the most effective strategies embrace both: Use threads or videos to spark ideas… Then guide people into Telegrams, forums, or token-gated spaces where they can go deeper.\nThe internet is changing. Not collapsing. Not breaking. Just layering. And Web3 is uniquely positioned to design for that. My concern: How do we balance public reach with private trust in our marketing efforts? Are we doing enough to design high-signal spaces people want to stay in? Would love to hear from others"
            },
            {
                "author": "Harley",
                "comment": "So true!! Public gets the spark, private keeps the flame.\nBig question now: are we building spaces people actually want to stay in?"
            },
            {
                "author": "nidhinakranii",
                "comment": "The layered approach makes a ton of sense"
            },
            {
                "author": "Elenaisplaying",
                "comment": "Glad the layered approach resonates with you. It’s something I’ve found helps balance clarity with flexibility, especially in fast-moving spaces. If you’ve used a similar structure or have thoughts on where it could be improved, I’d love to hear more!"
            },
            {
                "author": "Elenaisplaying",
                "comment": "Totally agree. That question hits hard. It’s not just about driving people in anymore, it’s about designing spaces where they feel seen, safe, and curious enough to stick around. I think the future of community will hinge on that, not just reach, but resonance."
            }
        ]
    },
    {
        "id": "a588ef262157116c",
        "topic_id": "5966",
        "title": "HyperHack Spotlight Campaign is Live",
        "url": "https://forum.ceg.vote/t/hyperhack-spotlight-campaign-is-live/5966",
        "views": "",
        "comments": "19",
        "created_date": "Jun 25, 2025 2:10 pm",
        "latest_activity": "Jul 3, 2025 1:20 am",
        "content": "Gm Metisians, the Spotlight Campaign is here to supercharge your HyperHack journey!\nWe are giving selected project teams a chance at the $7500 bonus prize pool, $500 in marketing credit, access to guild talent, and the chance to earn tiered ecosystem rewards. The goal is to boost your visibility and help you grow real users.\nApply here\nCampaign Objective\nTo empower HyperHack teams to market their projects using a real budget. This is about helping builders grow their audience, activate users, and showcase their dApps across the Metis ecosystem.\nHow It Works\n$500 marketing credit for each project, 50 projects at maximum\n$7500 extra prize pool for top projects\nEach selected project will receive $500 in marketing credit, split into:\n$300 upfront to start your campaign\n$200 unlocked later if performance goals are met by August 1\n$500 Marketing Credit\nEach project must create a dedicated X account for their HyperHack product and have at least one marketer (internal or from the Forum Marketing Guild) who will:\nLead the project’s marketing strategy\nUse the $500 to drive short-term traffic\nJoin a Vibe Session to introduce the dapp\nShare referral links via X posts to their forum showcase\nApproved Marketing Tactics:\nQuest Campaigns (TaskOn, Zealy, Magic Square): e.g. “Follow + Retweet + Test dapp + Join Forum”\nAMA Airdrops: Host AMAs on X and airdrop to the Metis community\nTwitter Ads: Use paid ads to boost visibility (marketer must help set this up)\nCustom Strategies: Teams are also encouraged to try any other creative ideas tailored to their product and audience\nNote: Marketer’s name and focus must be listed in the application (e.g., Marketing Lead: @Handle – Focus: Memes & Spaces).\nHow We Track Performance\nProjects will be scored across three categories during July 15 to August 1:\n75% X account growth and quality (verified via TwitterAudit)\n20% user activity on your dApp (measured onchain)\n5% users driven to your Forum thread using referral links\nRewards for Top Projects\nTotal Prize Pool: $7500\nTier 1: HyperHack Spotlight Champion\n$3000 bonus for the top project\nForum pin for 14 days\nPriority DevRel support for 6 months\nNewsletter spotlight\n25 bonus points for the final judging phase\nTier 2: Growth Catalysts\n$3000 prize pool\nForum pin for 7 days\nDevRel support for 3 months\nNewsletter spotlight\n15 bonus points\nTier 3: Community Stars\n$1500 prize pool\nDevRel support for 1 month\nNewsletter spotlight\n10 bonus points\nKey Dates\nApplication period: June 25-July 8\nApplication review: July 9- 15\nCampaign period: July 15- August 1\nRules\nFunds must be used for approved marketing activities only\nBot traffic is not allowed and will be checked\nYour marketing strategy must be made public in your Forum thread\nThe Spotlight Campaign is designed to help real builders grow real audiences.\nApply here\nFor questions, reply below.\nGL to all!",
        "comments_details": [
            {
                "author": "Liametis",
                "comment": "Gm Metisians, the Spotlight Campaign is here to supercharge your HyperHack journey!\nWe are giving selected project teams a chance at the $7500 bonus prize pool, $500 in marketing credit, access to guild talent, and the chance to earn tiered ecosystem rewards. The goal is to boost your visibility and help you grow real users.\nApply here\nCampaign Objective\nTo empower HyperHack teams to market their projects using a real budget. This is about helping builders grow their audience, activate users, and showcase their dApps across the Metis ecosystem.\nHow It Works\n$500 marketing credit for each project, 50 projects at maximum\n$7500 extra prize pool for top projects\nEach selected project will receive $500 in marketing credit, split into:\n$300 upfront to start your campaign\n$200 unlocked later if performance goals are met by August 1\n$500 Marketing Credit\nEach project must create a dedicated X account for their HyperHack product and have at least one marketer (internal or from the Forum Marketing Guild) who will:\nLead the project’s marketing strategy\nUse the $500 to drive short-term traffic\nJoin a Vibe Session to introduce the dapp\nShare referral links via X posts to their forum showcase\nApproved Marketing Tactics:\nQuest Campaigns (TaskOn, Zealy, Magic Square): e.g. “Follow + Retweet + Test dapp + Join Forum”\nAMA Airdrops: Host AMAs on X and airdrop to the Metis community\nTwitter Ads: Use paid ads to boost visibility (marketer must help set this up)\nCustom Strategies: Teams are also encouraged to try any other creative ideas tailored to their product and audience\nNote: Marketer’s name and focus must be listed in the application (e.g., Marketing Lead: @Handle – Focus: Memes & Spaces).\nHow We Track Performance\nProjects will be scored across three categories during July 15 to August 1:\n75% X account growth and quality (verified via TwitterAudit)\n20% user activity on your dApp (measured onchain)\n5% users driven to your Forum thread using referral links\nRewards for Top Projects\nTotal Prize Pool: $7500\nTier 1: HyperHack Spotlight Champion\n$3000 bonus for the top project\nForum pin for 14 days\nPriority DevRel support for 6 months\nNewsletter spotlight\n25 bonus points for the final judging phase\nTier 2: Growth Catalysts\n$3000 prize pool\nForum pin for 7 days\nDevRel support for 3 months\nNewsletter spotlight\n15 bonus points\nTier 3: Community Stars\n$1500 prize pool\nDevRel support for 1 month\nNewsletter spotlight\n10 bonus points\nKey Dates\nApplication period: June 25-July 8\nApplication review: July 9- 15\nCampaign period: July 15- August 1\nRules\nFunds must be used for approved marketing activities only\nBot traffic is not allowed and will be checked\nYour marketing strategy must be made public in your Forum thread\nThe Spotlight Campaign is designed to help real builders grow real audiences.\nApply here\nFor questions, reply below.\nGL to all!"
            },
            {
                "author": "4ngel",
                "comment": "This is huge !!! Good luck to every participant, let’s get it"
            },
            {
                "author": "Elenaisplaying",
                "comment": "Such a great news. Good luck everyone"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "I got a hiccup in the marketers forum ID and the Project owner forum ID. I don’t really know how to find that, any form of assistance would be greatly appreciated."
            },
            {
                "author": "Ghostt",
                "comment": "You will see that on your profile, and your own forum id is\n@i_am_supaman_lj\n. If you click the @ sign you will get it."
            },
            {
                "author": "priyankg3",
                "comment": "Thats wonderful, this is the golden chance for developers to build and polish with your project with marketing as well.."
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "Thanks a lot, I was actually hoping I would work with you. Since you are one of the first that saw the potential of Fracturepoint as a solution to the recent web3 gaming failure trends."
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "Thanks for the help, we can go on with the plan already now right ?"
            },
            {
                "author": "Sheyda",
                "comment": "Fantastic, do you have a list of Marketers?"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "List?\nI thought only one ."
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "Specified one marketer on the form Thats why I sort for one"
            },
            {
                "author": "mrwagmicto",
                "comment": "Hey everyone!\nI’m looking for a marketing partner to join me on an exciting crypto project and help drive this campaign forward.\nIf you’re passionate about Web3 marketing, community building, or growth hacking — let’s talk!\nFeel free to DM me. Would love to connect!"
            },
            {
                "author": "Ghostt",
                "comment": "I have teamed up with him and applied to the campaign. Looking forward to the result."
            },
            {
                "author": "0xdellwatson",
                "comment": "is it possible to also co-join with other campaign ?\nDM for more exposure with our team!"
            },
            {
                "author": "arbilearn",
                "comment": "This is great opportunity"
            },
            {
                "author": "Invnex",
                "comment": "Excited, and we’ve applied for Invnex."
            },
            {
                "author": "sagarjethi",
                "comment": "Such a great news. Good luck everyone"
            },
            {
                "author": "metapay_gyuha",
                "comment": "Hi! I’m one of the Spotlight Campaign applicants and already submitted my form.\nI’d like to submit my detailed marketing strategy as an additional document.\nCan I upload it to Google Drive and share the link here? Or should I send it via email?\nThanks a lot for this opportunity!\n–\n@metapay_gyuha"
            }
        ]
    },
    {
        "id": "1eebd291f7797254",
        "topic_id": "6115",
        "title": "Looking for a Team Member to Join Consentra",
        "url": "https://forum.ceg.vote/t/looking-for-a-team-member-to-join-consentra/6115",
        "views": "",
        "comments": "0",
        "created_date": "Jul 2, 2025 9:01 pm",
        "latest_activity": null,
        "content": "Hi Metis community!\nWe’re excited to share that Consentra — our AI-powered, cross-chain decentralized governance platform — is growing fast! To accelerate our development and strengthen our team, we’re looking for an enthusiastic new collaborator.\nWho We’re Looking For\nWe are seeking a Blockchain Developer with AI integration understanding, who can help us build smarter, more secure governance tools.\nIdeal skills:\nSolid understanding of smart contract development (Solidity or similar for EVM chains)\nFamiliarity with blockchain architectures and cross-chain functionalities\nGeneral understanding of integrating AI assistants or automation tools\nPassion for DAOs, decentralized governance, and community-driven projects\nAbout Consentra\nConsentra is designed to make DAO participation easier and more transparent by combining intelligent AI agents, soulbound identity verification, and seamless cross-chain support. Our vision is to empower communities to govern smarter and more inclusively.\nYou can learn more about our project here in our Consentra topic.\nWhy Join Us?\nBe part of an innovative project pushing the boundaries of AI and decentralized governance\nCollaborate with a passionate, supportive, and forward-thinking team\nGain hands-on experience in AI-assisted blockchain tools\nContribute to open-source development and shape the future of DAOs\nHow to Apply\nIf you’re interested or would like to learn more, please reply in this thread or reach out to us directly on Telegram.\nLet’s build the future of decentralized governance together!\nThanks for your support!",
        "comments_details": [
            {
                "author": "arjuncreator",
                "comment": "Hi Metis community!\nWe’re excited to share that Consentra — our AI-powered, cross-chain decentralized governance platform — is growing fast! To accelerate our development and strengthen our team, we’re looking for an enthusiastic new collaborator.\nWho We’re Looking For\nWe are seeking a Blockchain Developer with AI integration understanding, who can help us build smarter, more secure governance tools.\nIdeal skills:\nSolid understanding of smart contract development (Solidity or similar for EVM chains)\nFamiliarity with blockchain architectures and cross-chain functionalities\nGeneral understanding of integrating AI assistants or automation tools\nPassion for DAOs, decentralized governance, and community-driven projects\nAbout Consentra\nConsentra is designed to make DAO participation easier and more transparent by combining intelligent AI agents, soulbound identity verification, and seamless cross-chain support. Our vision is to empower communities to govern smarter and more inclusively.\nYou can learn more about our project here in our Consentra topic.\nWhy Join Us?\nBe part of an innovative project pushing the boundaries of AI and decentralized governance\nCollaborate with a passionate, supportive, and forward-thinking team\nGain hands-on experience in AI-assisted blockchain tools\nContribute to open-source development and shape the future of DAOs\nHow to Apply\nIf you’re interested or would like to learn more, please reply in this thread or reach out to us directly on Telegram.\nLet’s build the future of decentralized governance together!\nThanks for your support!"
            }
        ]
    }
]