[
    {
        "id": "983d9a9c647e005b",
        "topic_id": "10724",
        "title": "Build & Chill: Workshop 4 – Build Your Own Digital Twin Using DAT!",
        "url": "https://forum.ceg.vote/t/build-chill-workshop-4-build-your-own-digital-twin-using-dat/10724",
        "views": "",
        "comments": "0",
        "created_date": "Sep 30, 2025 5:22 pm",
        "latest_activity": null,
        "content": "x.com\n@\nHey Builders!\nWe’re coming with Episode 4 of the Build & Chill series and this time, it’s all about going beyond queries and actually bringing your data agents to life.\nWorkshop Date: Oct 2\nTime: 4 PM UTC\nStream: Watch it live\nWhat’s in store this week?\nUse the LazAI Digital Twin Starter Kit\nBuild something real using the Alith SDK (Python, Node.js, or Rust)\nAdd a smart, interactive UI (CLI, web, chat, up to you!)\nBe in the running for that prize pool\nLet’s build something that talks back.\nLet’s build with LazAI.\nLet’s build in public.\nKeep building, keep Chilling.",
        "comments_details": [
            {
                "author": "nidhinakranii",
                "comment": "x.com\n@\nHey Builders!\nWe’re coming with Episode 4 of the Build & Chill series and this time, it’s all about going beyond queries and actually bringing your data agents to life.\nWorkshop Date: Oct 2\nTime: 4 PM UTC\nStream: Watch it live\nWhat’s in store this week?\nUse the LazAI Digital Twin Starter Kit\nBuild something real using the Alith SDK (Python, Node.js, or Rust)\nAdd a smart, interactive UI (CLI, web, chat, up to you!)\nBe in the running for that prize pool\nLet’s build something that talks back.\nLet’s build with LazAI.\nLet’s build in public.\nKeep building, keep Chilling."
            }
        ]
    },
    {
        "id": "0315314269475512",
        "topic_id": "10668",
        "title": "6th No-Lose Lottery Winners!",
        "url": "https://forum.ceg.vote/t/6th-no-lose-lottery-winners/10668",
        "views": "",
        "comments": "13",
        "created_date": "Sep 24, 2025 5:19 pm",
        "latest_activity": "Sep 30, 2025 2:28 pm",
        "content": "SEP\n22\n6th No-Lose Lottery Winners!\nExpired\n·\nCreated by\nSheyda\nMon, Sep 22 4:00 PM → Wed, Sep 24 4:00 AM\n0 going\nCongratulations to our amazing contributors!\nThe 6th round of the No-Lose Lottery draw is complete!\nRemember, every point you earn on the Forum = 1 ticket for the biweekly draw, so your participation always counts.\nWinners:\nContributor Badge – Small Prize: @Hadijat, @biswas13\nVisionary Badge – Grand Prize: @JustineDevs\nReminder:\nEvery 1 point = 1 lottery ticket\nBoost your points! engage and contribute by replying, every reply earns 2 points\nCheck out your score in the live leaderboard\nStay tuned for the next round and official updates on Metis X: @MetisL2!",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "SEP\n22\n6th No-Lose Lottery Winners!\nExpired\n·\nCreated by\nSheyda\nMon, Sep 22 4:00 PM → Wed, Sep 24 4:00 AM\n0 going\nCongratulations to our amazing contributors!\nThe 6th round of the No-Lose Lottery draw is complete!\nRemember, every point you earn on the Forum = 1 ticket for the biweekly draw, so your participation always counts.\nWinners:\nContributor Badge – Small Prize: @Hadijat, @biswas13\nVisionary Badge – Grand Prize: @JustineDevs\nReminder:\nEvery 1 point = 1 lottery ticket\nBoost your points! engage and contribute by replying, every reply earns 2 points\nCheck out your score in the live leaderboard\nStay tuned for the next round and official updates on Metis X: @MetisL2!"
            }
        ]
    },
    {
        "id": "df08b5e6271d1838",
        "topic_id": "10717",
        "title": "Consistency Beats Brilliance",
        "url": "https://forum.ceg.vote/t/consistency-beats-brilliance/10717",
        "views": "",
        "comments": "1",
        "created_date": "Sep 30, 2025 9:04 am",
        "latest_activity": "Sep 30, 2025 1:27 pm",
        "content": "there’s a common idea in web3 that the best teams move fast, break things, and come up with genius solutions under pressure.\nbut when i look around at the projects that are still standing after a few cycles it’s rarely the flashiest ones. at least that’s not all there is to it.\nwe can’t overlook the teams that build habits. the ones who stick to their cadence. who ship when they say they will, check in even when there’s no fire, and improve their processes one step at a time.\ni’m not saying creativity doesn’t matter. we still need people with bold ideas. but the ops layer is where momentum is made.\nif we can make our operational rhythms strong and simple enough to run on autopilot, we free up space for creativity, growth, even rest.\nso what do you think, do you agree, and any tips for making sure you stay consistent?",
        "comments_details": [
            {
                "author": "Liametis",
                "comment": "there’s a common idea in web3 that the best teams move fast, break things, and come up with genius solutions under pressure.\nbut when i look around at the projects that are still standing after a few cycles it’s rarely the flashiest ones. at least that’s not all there is to it.\nwe can’t overlook the teams that build habits. the ones who stick to their cadence. who ship when they say they will, check in even when there’s no fire, and improve their processes one step at a time.\ni’m not saying creativity doesn’t matter. we still need people with bold ideas. but the ops layer is where momentum is made.\nif we can make our operational rhythms strong and simple enough to run on autopilot, we free up space for creativity, growth, even rest.\nso what do you think, do you agree, and any tips for making sure you stay consistent?"
            }
        ]
    },
    {
        "id": "19107ea94bbceb14",
        "topic_id": "6128",
        "title": "Fracture Point: Core Development Update – A Deep Dive into Our Web3 Foundation!",
        "url": "https://forum.ceg.vote/t/fracture-point-core-development-update-a-deep-dive-into-our-web3-foundation/6128",
        "views": "",
        "comments": "146",
        "created_date": "Jul 3, 2025 4:43 pm",
        "latest_activity": "Sep 30, 2025 11:40 am",
        "content": "Live Link: https://prototypelobbyfpoint.netlify.app/\nWe are thrilled to unveil a monumental leap in the development of Fracture Point, our upcoming tactical TPS game. While our interactive lobby prototype provides a glimpse into the player experience, the true revolution lies in the meticulously crafted on-chain smart contracts and the robust Alith Architecture that power our innovative Proof of Play ecosystem.\nThis past month has been dedicated to building the immutable bedrock of Fracture Point’s Web3 capabilities, focusing on decentralized ownership, verifiable progression, and a player-driven economy.\nFracture Point: The Game Skill, Strategy, and True Digital Ownership\nFracture Point is designed as a high-octane, tactical third-person shooter that demands precision, strategic thinking, and teamwork. We are building a fiercely competitive environment where your skill and dedication are not just recognized, but are fundamentally integrated into the game’s core value system.\nPrepare for:\nIntense FPS Combat: Master diverse weapon loadouts and tactical maneuvers in dynamic, high-stakes engagements.\nDeep Customization: Personalize your agents and unique “variants”, making your mark on the battlefield.\nCompetitive Progression: Climb verifiable leaderboards, earn genuine rewards, and truly own your in-game achievements.\nThe Proof of Play Revolution: Rewarding Skill On-Chain\nOur commitment to Proof of Play is the defining feature of Fracture Point. This is not a concept; it’s a core, on-chain mechanism ensuring that your active engagement and skillful performance directly translate into verifiable, immutable value and progression within the game’s ecosystem.\nHow Proof of Play works in Fracture Point, powered by our contracts:\nVerifiable Achievements: Through the GameAchievementRegistry.sol contract (which is part of our ClaimManager system), your significant in-game achievements and progression milestones are immutably recorded on the blockchain. This provides transparent, provable recognition for your dedication and skill.\nSkill-Based Rewards: Our FPToken (FracturePoint Token), serving as XP, is minted to players based on their in-game performance (e.g., in Rift events), authorized exclusively by our trusted Alith Oracle. This ensures that rewards are earned through genuine gameplay.\nOn-Chain Progression & Badges: Your accumulated FPToken (XP) can then be burned via the ClaimManager contract to claim unique Rank Badges (ERC-721 NFTs) from the RankBadge.sol contract, signifying your seasonal achievements and skill tier. This process is entirely on-chain, making your rank verifiable and owned.\nPlayer-Driven Ecosystem: This interconnected system ensures that the game’s economy and value are directly influenced and shaped by the collective activity and skilled contributions of its player base.\nThis ensures Fracture Point rewards genuine skill, time invested, and proven performance, fostering a fair, transparent, and truly player-owned gaming experience.\nOur Core Architecture: Dedicated Smart Contracts and The Alith Framework\nThe true innovation behind Fracture Point lies in its robust, interconnected smart contracts and the strategic implementation of the Alith Architecture.\n1. The Alith Architecture: Our Tailored Blockchain Game Framework\nFracture Point leverages a bespoke implementation of the Alith Architecture. This is our comprehensive, modular framework meticulously designed to seamlessly integrate blockchain technology without compromising gameplay performance. It intelligently separates:\nOn-Chain Components: Our smart contracts (FPToken, RankBadge, ClaimManager) handle critical, immutable data like XP (FPToken) balances, Rank Badge (NFT) ownership, and verifiable achievements. This ensures decentralization, security, and provable ownership. The Alith Oracle acts as the trusted off-chain authority that bridges game outcomes to on-chain actions, such as distributing XP and authorizing badge claims.\nOff-Chain Backend: High-frequency game logic, real-time matchmaking, complex physics calculations, and volatile player statistics run on a performant off-chain backend. This guarantees a smooth, low-latency, and responsive gameplay experience, unburdened by blockchain transaction times and gas costs.\nSecure Interoperability: A robust and auditable communication layer ensures seamless and secure data flow between our contracts (governed by the Alith Oracle) and the off-chain game server.\n2. Fracture Point’s Core Smart Contracts (Audited & Interconnected)\nWe have successfully designed, developed, and prepared for deployment the foundational smart contracts that power Fracture Point’s Web3 economy and the Proof of Play mechanics. These contracts work in concert:\nFPToken.sol (FuturePoint Token) : This ERC-20 token represents XP within the Fracture Point ecosystem. It’s designed specifically for in-game progression:\nMinted by Alith Oracle: Only the designated alithOracle can mint new FPToken to players (e.g., via distributeRiftXP) based on game outcomes.\nBurned by ClaimManager: The ClaimManager contract is uniquely authorized to burn FPToken (XP) from player balances when they claim Rank Badges, creating a clear utility and economic loop.\nNon-Transferable (Player-to-Player): Significantly, direct player-to-player transfers of FPToken are disabled. This ensures FPToken remains a pure XP/progression token, preventing speculative trading and focusing its value on in-game achievement.\nRankBadge.sol (Fracture Point Rank Badge) : This ERC-721 NFT contract represents unique, season-specific Rank Badges that players can earn.\nMinted by ClaimManager: Only the ClaimManager contract is authorized to mint new Rank Badges to players, ensuring badges are earned through the proper Proof of Play mechanism.\nImmutable On-Chain Proof: Each badge is a unique NFT, providing verifiable, immutable proof of a player’s achievement for a given season and rank.\nClaimManager.sol : This is the central orchestrator contract, linking FPToken (XP) to Rank Badges (NFTs) and acting as the bridge to the Alith Oracle.\nManages Badge Claims: Players claim badges via ClaimManager, which then verifies their XP balance, burns the necessary FPToken from their account, and instructs RankBadge.sol to mint the new NFT.\nSeason Management: It tracks the currentSeason, ensuring players can only claim one badge per season.\nKarma Evaluation Requests: It facilitates requests for off-chain “Karma” evaluations by the Alith Oracle, hinting at deeper player behavior analysis.\nAlith Oracle Integration: It designates and relies on the alithOracle for authorizing badge claims and distributing rewards based on verified game data.\nThe code for these foundational contracts and the full Alith Architecture implementation can be reviewed in our public repository: https://github.com/SUPAMAN-dev/fracture-point-hyperhack\nYou can also verify our currently deployed contract addresses on the Hyperion testnet network: https://hyperion-testnet.metisdevops.link/\nFPToken Address: 0xb4F4337A5660f42bC4D7fB735F18aB7b47E3CAf9\nClaimManager Address: 0xCc3B21510ef143F4b52f5e759C097c698F838e00\nRankBadge Address: 0xd557697c5C017d6Fdd76F778C1e2355AE3CCe15e\n(Note on GHC: While not currently on-chain, the fixed supply GHC currency, managed by multisig, will form the broader economic layer of Fracture Point. Its design ensures seamless future integration with our on-chain systems when the time is right, complementing the FPToken XP system.)\nLobby Prototype: The Player’s Interactive Gateway\nComplementing this powerful blockchain backend, our functional lobby prototype provides the intuitive player-facing interface. It allows players to:\nSeamlessly navigate between game modes, customization options, and personal profiles.\nExperience a polished UI/UX that aligns with Fracture Point’s futuristic theme.\nInteract with the foundational elements for future wallet integration, demonstrating how players will connect their on-chain assets to the game.\nLink to the prototype demo: https://youtu.be/aI_lQ6DcwEI\nEcosystem Interest: Strategic Offer from Plurality Web3\nAs a direct result of our development efforts during this Hyperion Hackathon, Fracture Point attracted partnership interest from leading Web3 infrastructure teams, most notably Plurality Web3, a startup pioneering embedded identity and authentication infrastructure for dApps.\nPlurality offered us a 12-month support package under their Partner Program, which includes:\n1:1 Engineering Support for seamless integration of user authentication and personalized in-game logic.\nFree infrastructure credits to cover authentication, user session tooling, and zkTLS-powered identity gating.\nUX Collaboration to co-design smooth onboarding flows without popups or clunky wallets particularly valuable for our casual-to-core player conversion goals.\nTheir outreach came after they reviewed Fracture Point’s Hyperion-backed Proof of Play system and saw clear potential for adoption in competitive Web3 gaming.\nWe view this offer as both validation of our underlying architecture and a strategic complement to the low-cost, high-throughput infrastructure that Hyperion enables. These ecosystem synergies affirm that Fracture Point is not just a playable demo, but a platform being taken seriously by early infrastructure players.\nWhat’s Next for Fracture Point?\nWith the core blockchain architecture, smart contracts, and the lobby interface firmly established, our immediate next steps are to integrate these powerful systems with the actual game engine to bring the full combat experience to life. This includes:\nBackend Game Logic Development: Building out the sophisticated off-chain systems for real-time matchmaking, secure player data management, and robust anti-cheat measures.\nGame Engine Integration: Connecting the lobby and backend systems to a game engine to render the immersive world and high-fidelity combat of Fracture Point.\nProof of Play Loop Refinement: Fully integrating in-game actions with our GameAchievementRegistry.sol via the Alith Oracle to ensure every skill-based action is verifiable and contributes to player progression and potential future GHC earnings.\nThis is an incredibly exciting time for Fracture Point. We invite you to join our community as we build the next evolution of TPS gaming, truly owned and driven by its players.\nJoin our community and stay updated!\nTelegram\nFracture Point\nYou can view and join @fracturepointlabs right away.\nDiscord\nJoin the Fracture Point Discord Server!\nCheck out the Fracture Point community on Discord – hang out with 5 other members and enjoy free voice and text chat.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!\nFracture Point – Final Submission Update\nUpdated Project Description\nFracture Point is building the foundation for a new player-owned Web3 ecosystem where gameplay progression is transparently tracked on-chain.\nSince the last update, we’ve resolved the wallet connection issue: players can now successfully connect their wallets and receive FpXP (Fracture Point Experience Points) by triggering functions directly from the prototype lobby.\nThis demonstrates the core Proof of Play mechanic in action, even before we have a Unity backend integrated.\nWallet connection integrated\nPrototype lobby live for XP claiming\nUnity backend integration (next milestone)\nGameHouse studio/launchpad to expand onboarding and incubation\nFracture Point is not just a single game it’s the first Flagship in the GameHouse ecosystem, a broader platform designed to connect players, developers, and contributors across Web3 gaming.\nLive Application Link\nprototypelobbyfpoint.netlify.app\nFracture Point Lobby Prototype\nNote: Requires Hyperion testnet wallet connection & faucet drips for gas.\nUser Guide / Tutorial\nHow to Test the Prototype Lobby:\nGet Testnet Drips:\nJoin the [Hyperion Telegram Faucet] (@hyperion_testnet_bot) and request testnet tokens.\nEnsure your wallet is funded for transactions.\nConnect Wallet:\nOpen the prototype lobby link.\nClick “Connect Wallet.” Approve the request in MetaMask or your Hyperion-supported wallet.\nTrigger XP Claim:\nSelect “Claim FpXP” in the lobby interface.\nConfirm the transaction on-chain.\nMint & Verify XP:\nAfter confirmation, XP balance will update in your wallet.\nScreenshots of the lobby interface will be provided to guide testers visually.\nVisual walkthrough with screenshots of the lobby UI: image walkthrough provided below.\nVideo walkthrough (screen-recorded demo): demo link or clqim of xp and visual walk through an be found in the link above.\nPresentation (Vision & Future Direction)\nVision\nFracture Point introduces the Proof of Play economy where player contributions (gameplay, quests, or community actions) are transparently rewarded on-chain. This foundation transitions into GameHouse, a full player hub and launchpad incubating the next generation of decentralized games.\nFunctionality\nXP tracking & wallet integration (prototype live)\nFuture: Unity backend integration for real-time gameplay events\nExpansion into GameHouse: onboarding users through social quests + multiple incubated games\nMonetisation Strategy\nSeason Passes tied to lore & cosmetics (non-pay-to-win)\nSponsorship ads tied to social quests & ranked tournaments\nP2P transaction fees on NFT avatars & skins (Variants)\nBrand naming rights for map areas in-game\nFuture GameHouse revenue: ad monetisation + reward claims\nRoadmap\nWallet + XP prototype lobby\nUnity backend development\nGameHouse studio/launchpad (onboarding + incubation)\nFirst Fracture Point playtest with Proof of Play fully active\nExpansion of ecosystem with partner games\nGitHub Repository Link\nhttps://github.com/SUPAMAN-dev/fracture-point-hyperhack\nContracts available for: XP minting, wallet connection, and testnet interactions.\nTeam Members\n@i_am_supaman_lj (Founder, Game Designer, Product Strategist)",
        "comments_details": [
            {
                "author": "i_am_supaman_lj",
                "comment": "Live Link: https://prototypelobbyfpoint.netlify.app/\nWe are thrilled to unveil a monumental leap in the development of Fracture Point, our upcoming tactical TPS game. While our interactive lobby prototype provides a glimpse into the player experience, the true revolution lies in the meticulously crafted on-chain smart contracts and the robust Alith Architecture that power our innovative Proof of Play ecosystem.\nThis past month has been dedicated to building the immutable bedrock of Fracture Point’s Web3 capabilities, focusing on decentralized ownership, verifiable progression, and a player-driven economy.\nFracture Point: The Game Skill, Strategy, and True Digital Ownership\nFracture Point is designed as a high-octane, tactical third-person shooter that demands precision, strategic thinking, and teamwork. We are building a fiercely competitive environment where your skill and dedication are not just recognized, but are fundamentally integrated into the game’s core value system.\nPrepare for:\nIntense FPS Combat: Master diverse weapon loadouts and tactical maneuvers in dynamic, high-stakes engagements.\nDeep Customization: Personalize your agents and unique “variants”, making your mark on the battlefield.\nCompetitive Progression: Climb verifiable leaderboards, earn genuine rewards, and truly own your in-game achievements.\nThe Proof of Play Revolution: Rewarding Skill On-Chain\nOur commitment to Proof of Play is the defining feature of Fracture Point. This is not a concept; it’s a core, on-chain mechanism ensuring that your active engagement and skillful performance directly translate into verifiable, immutable value and progression within the game’s ecosystem.\nHow Proof of Play works in Fracture Point, powered by our contracts:\nVerifiable Achievements: Through the GameAchievementRegistry.sol contract (which is part of our ClaimManager system), your significant in-game achievements and progression milestones are immutably recorded on the blockchain. This provides transparent, provable recognition for your dedication and skill.\nSkill-Based Rewards: Our FPToken (FracturePoint Token), serving as XP, is minted to players based on their in-game performance (e.g., in Rift events), authorized exclusively by our trusted Alith Oracle. This ensures that rewards are earned through genuine gameplay.\nOn-Chain Progression & Badges: Your accumulated FPToken (XP) can then be burned via the ClaimManager contract to claim unique Rank Badges (ERC-721 NFTs) from the RankBadge.sol contract, signifying your seasonal achievements and skill tier. This process is entirely on-chain, making your rank verifiable and owned.\nPlayer-Driven Ecosystem: This interconnected system ensures that the game’s economy and value are directly influenced and shaped by the collective activity and skilled contributions of its player base.\nThis ensures Fracture Point rewards genuine skill, time invested, and proven performance, fostering a fair, transparent, and truly player-owned gaming experience.\nOur Core Architecture: Dedicated Smart Contracts and The Alith Framework\nThe true innovation behind Fracture Point lies in its robust, interconnected smart contracts and the strategic implementation of the Alith Architecture.\n1. The Alith Architecture: Our Tailored Blockchain Game Framework\nFracture Point leverages a bespoke implementation of the Alith Architecture. This is our comprehensive, modular framework meticulously designed to seamlessly integrate blockchain technology without compromising gameplay performance. It intelligently separates:\nOn-Chain Components: Our smart contracts (FPToken, RankBadge, ClaimManager) handle critical, immutable data like XP (FPToken) balances, Rank Badge (NFT) ownership, and verifiable achievements. This ensures decentralization, security, and provable ownership. The Alith Oracle acts as the trusted off-chain authority that bridges game outcomes to on-chain actions, such as distributing XP and authorizing badge claims.\nOff-Chain Backend: High-frequency game logic, real-time matchmaking, complex physics calculations, and volatile player statistics run on a performant off-chain backend. This guarantees a smooth, low-latency, and responsive gameplay experience, unburdened by blockchain transaction times and gas costs.\nSecure Interoperability: A robust and auditable communication layer ensures seamless and secure data flow between our contracts (governed by the Alith Oracle) and the off-chain game server.\n2. Fracture Point’s Core Smart Contracts (Audited & Interconnected)\nWe have successfully designed, developed, and prepared for deployment the foundational smart contracts that power Fracture Point’s Web3 economy and the Proof of Play mechanics. These contracts work in concert:\nFPToken.sol (FuturePoint Token) : This ERC-20 token represents XP within the Fracture Point ecosystem. It’s designed specifically for in-game progression:\nMinted by Alith Oracle: Only the designated alithOracle can mint new FPToken to players (e.g., via distributeRiftXP) based on game outcomes.\nBurned by ClaimManager: The ClaimManager contract is uniquely authorized to burn FPToken (XP) from player balances when they claim Rank Badges, creating a clear utility and economic loop.\nNon-Transferable (Player-to-Player): Significantly, direct player-to-player transfers of FPToken are disabled. This ensures FPToken remains a pure XP/progression token, preventing speculative trading and focusing its value on in-game achievement.\nRankBadge.sol (Fracture Point Rank Badge) : This ERC-721 NFT contract represents unique, season-specific Rank Badges that players can earn.\nMinted by ClaimManager: Only the ClaimManager contract is authorized to mint new Rank Badges to players, ensuring badges are earned through the proper Proof of Play mechanism.\nImmutable On-Chain Proof: Each badge is a unique NFT, providing verifiable, immutable proof of a player’s achievement for a given season and rank.\nClaimManager.sol : This is the central orchestrator contract, linking FPToken (XP) to Rank Badges (NFTs) and acting as the bridge to the Alith Oracle.\nManages Badge Claims: Players claim badges via ClaimManager, which then verifies their XP balance, burns the necessary FPToken from their account, and instructs RankBadge.sol to mint the new NFT.\nSeason Management: It tracks the currentSeason, ensuring players can only claim one badge per season.\nKarma Evaluation Requests: It facilitates requests for off-chain “Karma” evaluations by the Alith Oracle, hinting at deeper player behavior analysis.\nAlith Oracle Integration: It designates and relies on the alithOracle for authorizing badge claims and distributing rewards based on verified game data.\nThe code for these foundational contracts and the full Alith Architecture implementation can be reviewed in our public repository: https://github.com/SUPAMAN-dev/fracture-point-hyperhack\nYou can also verify our currently deployed contract addresses on the Hyperion testnet network: https://hyperion-testnet.metisdevops.link/\nFPToken Address: 0xb4F4337A5660f42bC4D7fB735F18aB7b47E3CAf9\nClaimManager Address: 0xCc3B21510ef143F4b52f5e759C097c698F838e00\nRankBadge Address: 0xd557697c5C017d6Fdd76F778C1e2355AE3CCe15e\n(Note on GHC: While not currently on-chain, the fixed supply GHC currency, managed by multisig, will form the broader economic layer of Fracture Point. Its design ensures seamless future integration with our on-chain systems when the time is right, complementing the FPToken XP system.)\nLobby Prototype: The Player’s Interactive Gateway\nComplementing this powerful blockchain backend, our functional lobby prototype provides the intuitive player-facing interface. It allows players to:\nSeamlessly navigate between game modes, customization options, and personal profiles.\nExperience a polished UI/UX that aligns with Fracture Point’s futuristic theme.\nInteract with the foundational elements for future wallet integration, demonstrating how players will connect their on-chain assets to the game.\nLink to the prototype demo: https://youtu.be/aI_lQ6DcwEI\nEcosystem Interest: Strategic Offer from Plurality Web3\nAs a direct result of our development efforts during this Hyperion Hackathon, Fracture Point attracted partnership interest from leading Web3 infrastructure teams, most notably Plurality Web3, a startup pioneering embedded identity and authentication infrastructure for dApps.\nPlurality offered us a 12-month support package under their Partner Program, which includes:\n1:1 Engineering Support for seamless integration of user authentication and personalized in-game logic.\nFree infrastructure credits to cover authentication, user session tooling, and zkTLS-powered identity gating.\nUX Collaboration to co-design smooth onboarding flows without popups or clunky wallets particularly valuable for our casual-to-core player conversion goals.\nTheir outreach came after they reviewed Fracture Point’s Hyperion-backed Proof of Play system and saw clear potential for adoption in competitive Web3 gaming.\nWe view this offer as both validation of our underlying architecture and a strategic complement to the low-cost, high-throughput infrastructure that Hyperion enables. These ecosystem synergies affirm that Fracture Point is not just a playable demo, but a platform being taken seriously by early infrastructure players.\nWhat’s Next for Fracture Point?\nWith the core blockchain architecture, smart contracts, and the lobby interface firmly established, our immediate next steps are to integrate these powerful systems with the actual game engine to bring the full combat experience to life. This includes:\nBackend Game Logic Development: Building out the sophisticated off-chain systems for real-time matchmaking, secure player data management, and robust anti-cheat measures.\nGame Engine Integration: Connecting the lobby and backend systems to a game engine to render the immersive world and high-fidelity combat of Fracture Point.\nProof of Play Loop Refinement: Fully integrating in-game actions with our GameAchievementRegistry.sol via the Alith Oracle to ensure every skill-based action is verifiable and contributes to player progression and potential future GHC earnings.\nThis is an incredibly exciting time for Fracture Point. We invite you to join our community as we build the next evolution of TPS gaming, truly owned and driven by its players.\nJoin our community and stay updated!\nTelegram\nFracture Point\nYou can view and join @fracturepointlabs right away.\nDiscord\nJoin the Fracture Point Discord Server!\nCheck out the Fracture Point community on Discord – hang out with 5 other members and enjoy free voice and text chat.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!\nFracture Point – Final Submission Update\nUpdated Project Description\nFracture Point is building the foundation for a new player-owned Web3 ecosystem where gameplay progression is transparently tracked on-chain.\nSince the last update, we’ve resolved the wallet connection issue: players can now successfully connect their wallets and receive FpXP (Fracture Point Experience Points) by triggering functions directly from the prototype lobby.\nThis demonstrates the core Proof of Play mechanic in action, even before we have a Unity backend integrated.\nWallet connection integrated\nPrototype lobby live for XP claiming\nUnity backend integration (next milestone)\nGameHouse studio/launchpad to expand onboarding and incubation\nFracture Point is not just a single game it’s the first Flagship in the GameHouse ecosystem, a broader platform designed to connect players, developers, and contributors across Web3 gaming.\nLive Application Link\nprototypelobbyfpoint.netlify.app\nFracture Point Lobby Prototype\nNote: Requires Hyperion testnet wallet connection & faucet drips for gas.\nUser Guide / Tutorial\nHow to Test the Prototype Lobby:\nGet Testnet Drips:\nJoin the [Hyperion Telegram Faucet] (@hyperion_testnet_bot) and request testnet tokens.\nEnsure your wallet is funded for transactions.\nConnect Wallet:\nOpen the prototype lobby link.\nClick “Connect Wallet.” Approve the request in MetaMask or your Hyperion-supported wallet.\nTrigger XP Claim:\nSelect “Claim FpXP” in the lobby interface.\nConfirm the transaction on-chain.\nMint & Verify XP:\nAfter confirmation, XP balance will update in your wallet.\nScreenshots of the lobby interface will be provided to guide testers visually.\nVisual walkthrough with screenshots of the lobby UI: image walkthrough provided below.\nVideo walkthrough (screen-recorded demo): demo link or clqim of xp and visual walk through an be found in the link above.\nPresentation (Vision & Future Direction)\nVision\nFracture Point introduces the Proof of Play economy where player contributions (gameplay, quests, or community actions) are transparently rewarded on-chain. This foundation transitions into GameHouse, a full player hub and launchpad incubating the next generation of decentralized games.\nFunctionality\nXP tracking & wallet integration (prototype live)\nFuture: Unity backend integration for real-time gameplay events\nExpansion into GameHouse: onboarding users through social quests + multiple incubated games\nMonetisation Strategy\nSeason Passes tied to lore & cosmetics (non-pay-to-win)\nSponsorship ads tied to social quests & ranked tournaments\nP2P transaction fees on NFT avatars & skins (Variants)\nBrand naming rights for map areas in-game\nFuture GameHouse revenue: ad monetisation + reward claims\nRoadmap\nWallet + XP prototype lobby\nUnity backend development\nGameHouse studio/launchpad (onboarding + incubation)\nFirst Fracture Point playtest with Proof of Play fully active\nExpansion of ecosystem with partner games\nGitHub Repository Link\nhttps://github.com/SUPAMAN-dev/fracture-point-hyperhack\nContracts available for: XP minting, wallet connection, and testnet interactions.\nTeam Members\n@i_am_supaman_lj (Founder, Game Designer, Product Strategist)"
            }
        ]
    },
    {
        "id": "95473a01cda4633f",
        "topic_id": "10454",
        "title": "Spotlight Campaign Final Winners",
        "url": "https://forum.ceg.vote/t/spotlight-campaign-final-winners/10454",
        "views": "",
        "comments": "36",
        "created_date": "Sep 4, 2025 3:09 pm",
        "latest_activity": "Sep 30, 2025 11:21 am",
        "content": "Spotlight Campaign Final Winners\nThe Spotlight Campaign has officially concluded, and we want to express our thanks to all developers and community participants who joined us in this journey. Your contributions, creativity, and commitment are what make the Metis ecosystem stronger every day.\nAs promised, this campaign comes with two sets of rewards that have been separately announced here.\nWinners Breakdown of the $7,500 bonus prize pool\nTier 1: HyperHack Spotlight Champion\nStreamNFT\n$3,000 prize\nForum pin for 14 days\nPriority DevRel support for 6 months\nNewsletter spotlight\n+25 bonus points for the final judging phase\nTier 2: Growth Catalysts\nFracture Point, Safe Work Play, BOLTIS, LazaiTrader\n$750 prize each\nForum pin for 7 days\nDevRel support for 3 months\nNewsletter spotlight\n+15 bonus points\nTier 3: Community Stars\nHaithe, Festify, Eduverse\n$500 prize each\nDevRel support for 1 month\nNewsletter spotlight\n+10 bonus points\nHow We Scored Project Performance for the bonus priz pool\nProjects were evaluated between July 15 – August 21 across three weighted categories:\n75% X (Twitter) account growth and quality (verified via TwitterAudit)\n20% On-chain user activity on your dApp\n5% Users driven to your Forum thread via referral links\nBased on the criteria:\n1 project surpassed 80%+ performance → Tier 1 Champion\n4 projects scored between 30–80% → Tier 2 Catalysts\n3 projects scored below 30% → Tier 3 Stars\nMain criteria to unlock the remaining Marketing fund\nTo unlock the remaining $200 campaign marketing funds, projects needed at least 100 new registrations through Forum referral links. Bot-like accounts were filtered and removed to ensure fairness. Here are the winners: CERTHUB, Haithe, Safe Work Play, BOLTIS, StreamNFT, Eduverse, LazaiTrader, Fracture Point, Festify and ProofDao\nPayment & Next Steps\nOur team will DM each project owner for payment arrangements, which will take place on September 18.\nPlease provide your ERC-20 wallet address (no exchange wallets accepted).\nAll rewards will be distributed in METIS tokens on Andromeda.",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "Spotlight Campaign Final Winners\nThe Spotlight Campaign has officially concluded, and we want to express our thanks to all developers and community participants who joined us in this journey. Your contributions, creativity, and commitment are what make the Metis ecosystem stronger every day.\nAs promised, this campaign comes with two sets of rewards that have been separately announced here.\nWinners Breakdown of the $7,500 bonus prize pool\nTier 1: HyperHack Spotlight Champion\nStreamNFT\n$3,000 prize\nForum pin for 14 days\nPriority DevRel support for 6 months\nNewsletter spotlight\n+25 bonus points for the final judging phase\nTier 2: Growth Catalysts\nFracture Point, Safe Work Play, BOLTIS, LazaiTrader\n$750 prize each\nForum pin for 7 days\nDevRel support for 3 months\nNewsletter spotlight\n+15 bonus points\nTier 3: Community Stars\nHaithe, Festify, Eduverse\n$500 prize each\nDevRel support for 1 month\nNewsletter spotlight\n+10 bonus points\nHow We Scored Project Performance for the bonus priz pool\nProjects were evaluated between July 15 – August 21 across three weighted categories:\n75% X (Twitter) account growth and quality (verified via TwitterAudit)\n20% On-chain user activity on your dApp\n5% Users driven to your Forum thread via referral links\nBased on the criteria:\n1 project surpassed 80%+ performance → Tier 1 Champion\n4 projects scored between 30–80% → Tier 2 Catalysts\n3 projects scored below 30% → Tier 3 Stars\nMain criteria to unlock the remaining Marketing fund\nTo unlock the remaining $200 campaign marketing funds, projects needed at least 100 new registrations through Forum referral links. Bot-like accounts were filtered and removed to ensure fairness. Here are the winners: CERTHUB, Haithe, Safe Work Play, BOLTIS, StreamNFT, Eduverse, LazaiTrader, Fracture Point, Festify and ProofDao\nPayment & Next Steps\nOur team will DM each project owner for payment arrangements, which will take place on September 18.\nPlease provide your ERC-20 wallet address (no exchange wallets accepted).\nAll rewards will be distributed in METIS tokens on Andromeda."
            }
        ]
    },
    {
        "id": "d1275896a84084e1",
        "topic_id": "6012",
        "title": "Fracture Point Progress Report – Proof of Play Architecture Live",
        "url": "https://forum.ceg.vote/t/fracture-point-progress-report-proof-of-play-architecture-live/6012",
        "views": "",
        "comments": "9",
        "created_date": "Jun 27, 2025 8:53 pm",
        "latest_activity": "Sep 30, 2025 11:15 am",
        "content": "Hey everyone,\nWe’re excited to share a full status update on Fracture Point, our on-chain shooter project powered by verifiable Proof of Play now live on the Hyperion Testnet.\nCore Milestones Completed:\n• Smart Contracts Deployed\nOur foundational contracts (FPToken, RankBadge, and ClaimManager) are deployed and functional on Hyperion. These power token distribution and player rank progression, all based on verified activity.\n• Alith AI Integration Implemented\nWe’ve aligned our ClaimManager with the latest structure of Alith’s verifiable computing flow, enabling zk-backed claim validation for real player actions. Interactions with IDataRegistry, IVerifiedComputing, and related contracts are now wired into our claim submission logic.\n• Architecture Demonstration\nWe’ve adapted the structure and logic from the official Alith reference repo to clearly show how Fracture Point leverages AI inference within its Proof of Play system.\nhttps://github.com/SUPAMAN-dev/fracture-point-hyperhack\nPrototype UI Progress\n• We’ve started developing a web-based prototype lobby, which helps us simulate early game flow including variant display, basic player submission, and contract interaction.\nWhile not fully wired for end-to-end user flows yet, it demonstrates the core experience we’re building.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!\n• We’ve also begun introducing our Variants, showcasing early character visuals as a way to build the world and reward identity within the ecosystem.\nCurrent Gaps\n• Unity Developers Needed: We’re currently short on dedicated Unity talent and actively seeking 2 developers to push forward actual gameplay builds.\n• UI/UX Scope: Due to resource limits, our current frontend is a self-built mockup. It lays the groundwork for future polish once we expand the team or secure support.\nSpotlight Campaign\nWe’ve officially applied for the HyperHack Spotlight Campaign to begin telling our story and engaging the broader community. We’re focused on growing visibility, onboarding talent, and completing the final pieces of this vision.\nFeel free to reach out if you want to test our contracts, contribute, or explore how Alith is being used in a live project. More updates and tutorials coming soon!",
        "comments_details": [
            {
                "author": "i_am_supaman_lj",
                "comment": "Hey everyone,\nWe’re excited to share a full status update on Fracture Point, our on-chain shooter project powered by verifiable Proof of Play now live on the Hyperion Testnet.\nCore Milestones Completed:\n• Smart Contracts Deployed\nOur foundational contracts (FPToken, RankBadge, and ClaimManager) are deployed and functional on Hyperion. These power token distribution and player rank progression, all based on verified activity.\n• Alith AI Integration Implemented\nWe’ve aligned our ClaimManager with the latest structure of Alith’s verifiable computing flow, enabling zk-backed claim validation for real player actions. Interactions with IDataRegistry, IVerifiedComputing, and related contracts are now wired into our claim submission logic.\n• Architecture Demonstration\nWe’ve adapted the structure and logic from the official Alith reference repo to clearly show how Fracture Point leverages AI inference within its Proof of Play system.\nhttps://github.com/SUPAMAN-dev/fracture-point-hyperhack\nPrototype UI Progress\n• We’ve started developing a web-based prototype lobby, which helps us simulate early game flow including variant display, basic player submission, and contract interaction.\nWhile not fully wired for end-to-end user flows yet, it demonstrates the core experience we’re building.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!\n• We’ve also begun introducing our Variants, showcasing early character visuals as a way to build the world and reward identity within the ecosystem.\nCurrent Gaps\n• Unity Developers Needed: We’re currently short on dedicated Unity talent and actively seeking 2 developers to push forward actual gameplay builds.\n• UI/UX Scope: Due to resource limits, our current frontend is a self-built mockup. It lays the groundwork for future polish once we expand the team or secure support.\nSpotlight Campaign\nWe’ve officially applied for the HyperHack Spotlight Campaign to begin telling our story and engaging the broader community. We’re focused on growing visibility, onboarding talent, and completing the final pieces of this vision.\nFeel free to reach out if you want to test our contracts, contribute, or explore how Alith is being used in a live project. More updates and tutorials coming soon!"
            }
        ]
    },
    {
        "id": "0030693fd3832cdc",
        "topic_id": "6562",
        "title": "**Spotlight KPI Milestone Incoming!**",
        "url": "https://forum.ceg.vote/t/spotlight-kpi-milestone-incoming/6562",
        "views": "",
        "comments": "12",
        "created_date": "Jul 20, 2025 4:17 pm",
        "latest_activity": "Sep 30, 2025 11:07 am",
        "content": "We’re thrilled to share that Festify has successfully onboarded 90+ members to the Metis Hyperion Forum, and we’re just a few steps away from hitting 100+, our first KPI goal in the Metis Spotlight Campaign!\nThis milestone isn’t just a number, it’s a growing community of people joining the movement to make on-chain celebrations more fun, meaningful, and rewarding through AI-powered NFT greetings.\nHuge thanks to the amazing Metis community for the support, and to everyone who’s joined us so far.\nLet’s keep building, minting, and making memories — together.\nshare with friends to join us pls: Metis iDAO Forum",
        "comments_details": [
            {
                "author": "arbilearn",
                "comment": "We’re thrilled to share that Festify has successfully onboarded 90+ members to the Metis Hyperion Forum, and we’re just a few steps away from hitting 100+, our first KPI goal in the Metis Spotlight Campaign!\nThis milestone isn’t just a number, it’s a growing community of people joining the movement to make on-chain celebrations more fun, meaningful, and rewarding through AI-powered NFT greetings.\nHuge thanks to the amazing Metis community for the support, and to everyone who’s joined us so far.\nLet’s keep building, minting, and making memories — together.\nshare with friends to join us pls: Metis iDAO Forum"
            },
            {
                "author": "Union_5G",
                "comment": "That’s wonderful, you should have unlocked the badge for the campaign.\nWhat tactic brought about this break through?"
            }
        ]
    },
    {
        "id": "d5cb497b8fb7e430",
        "topic_id": "6936",
        "title": "Spotlight Campaign - Orbiting Success: 100 New Faces, One Mission",
        "url": "https://forum.ceg.vote/t/spotlight-campaign-orbiting-success-100-new-faces-one-mission/6936",
        "views": "",
        "comments": "22",
        "created_date": "Jul 25, 2025 11:50 pm",
        "latest_activity": "Sep 30, 2025 10:36 am",
        "content": "100 Strong and Growing — A Community Milestone! We’re thrilled to see the Forum inching toward 100 new members, all thanks to the incredible support from this community and the outreach powered by LazaiTrader. To celebrate, here’s what we’re diving into:\n1. The Journey – Strategic Growth This momentum is no accident. Our progress has been turbocharged by the unique synergy between gMetis (our parent project) and its powerful partner, the Core Network. Thanks to this collaboration, we’ve been able to leverage Orbit, a Core Network initiative designed to streamline cooperation between Web3 projects and KOLs. And yes—it works. We received verifiable KOL applications within minutes of activation.\n2. Fueling Progress – Smart Use of New Funds With a fresh $200 infusion, we’re putting every coin to work in the testing phase of LazaiTrader. Here’s how it rolls:\nEach tester gets a dedicated wallet address\nCoordinate with your Agent on a preferred trading strategy\nLet the Agent take the reins\nTop-performing wallet owners will win exclusive prizes\nThis is just the beginning. Your energy is what’s propelling us forward. Let’s test, trade, and thrive.",
        "comments_details": [
            {
                "author": "SmartOnStuff",
                "comment": "100 Strong and Growing — A Community Milestone! We’re thrilled to see the Forum inching toward 100 new members, all thanks to the incredible support from this community and the outreach powered by LazaiTrader. To celebrate, here’s what we’re diving into:\n1. The Journey – Strategic Growth This momentum is no accident. Our progress has been turbocharged by the unique synergy between gMetis (our parent project) and its powerful partner, the Core Network. Thanks to this collaboration, we’ve been able to leverage Orbit, a Core Network initiative designed to streamline cooperation between Web3 projects and KOLs. And yes—it works. We received verifiable KOL applications within minutes of activation.\n2. Fueling Progress – Smart Use of New Funds With a fresh $200 infusion, we’re putting every coin to work in the testing phase of LazaiTrader. Here’s how it rolls:\nEach tester gets a dedicated wallet address\nCoordinate with your Agent on a preferred trading strategy\nLet the Agent take the reins\nTop-performing wallet owners will win exclusive prizes\nThis is just the beginning. Your energy is what’s propelling us forward. Let’s test, trade, and thrive."
            }
        ]
    },
    {
        "id": "6bdc57b61b734956",
        "topic_id": "6580",
        "title": "## 🎙️ FESTIFY Twitter Space Recap – 1,000+ Tuned In!",
        "url": "https://forum.ceg.vote/t/festify-twitter-space-recap-1-000-tuned-in/6580",
        "views": "",
        "comments": "8",
        "created_date": "Jul 21, 2025 9:55 am",
        "latest_activity": "Sep 30, 2025 10:21 am",
        "content": "Hey Hyperion community!\nAs part of the ongoing 2-week Spotlight Campaign, we hosted our first-ever FESTIFY Twitter Space — and the response blew us away!\nOver 1,000+ people tuned in live to hear about how we’re bringing celebrations onchain.\nWe shared our vision for Web3-native greetings, how FESTIFY turns special moments into NFTs, and why joy should be permanent on the blockchain.\nMissed it?\nCatch the recap here:\nhttps://x.com/mrcool_web3/status/1947009923163766841\nTry Festify today!\nMint your own onchain greeting card in seconds:\nFestify - AI-Powered Festival Greetings NFTs\nStay connected:\nFollow us on X → @festify_ai\nWe’re just getting started — more updates coming as the Spotlight Campaign continues!",
        "comments_details": [
            {
                "author": "arbilearn",
                "comment": "Hey Hyperion community!\nAs part of the ongoing 2-week Spotlight Campaign, we hosted our first-ever FESTIFY Twitter Space — and the response blew us away!\nOver 1,000+ people tuned in live to hear about how we’re bringing celebrations onchain.\nWe shared our vision for Web3-native greetings, how FESTIFY turns special moments into NFTs, and why joy should be permanent on the blockchain.\nMissed it?\nCatch the recap here:\nhttps://x.com/mrcool_web3/status/1947009923163766841\nTry Festify today!\nMint your own onchain greeting card in seconds:\nFestify - AI-Powered Festival Greetings NFTs\nStay connected:\nFollow us on X → @festify_ai\nWe’re just getting started — more updates coming as the Spotlight Campaign continues!"
            }
        ]
    },
    {
        "id": "a104259411bdcc90",
        "topic_id": "5948",
        "title": "Looking for a Unity Developer to Join My Alith x Web3 Game Project (Fracture Point)",
        "url": "https://forum.ceg.vote/t/looking-for-a-unity-developer-to-join-my-alith-x-web3-game-project-fracture-point/5948",
        "views": "",
        "comments": "8",
        "created_date": "Jun 24, 2025 9:21 pm",
        "latest_activity": "Sep 30, 2025 9:51 am",
        "content": "Hey builders,\nI’m currently developing Fracture Point, a competitive extraction shooter built for Web3 where Proof of Play is enforced on-chain using AIith as sole decision maker.\nThe project is part of the Alith Integration Track for HyperHack. We’ve made strong progress on the backend and smart contracts (claim system, XP token, and rank NFT), and we’re now building a local simulation to show how Alith AI integrates into fair gaming reward logic.\nWhat I need now is a Unity developer who can help bring the front-end gameplay layer to life even a basic prototype with a simple environment and UI to showcase the play → evaluate → reward flow.\nIdeal Teammate Profile:\n• Experience with Unity (especially on mobile or FPS-style mechanics)\n• Comfortable building quick prototypes for hackathons\n• Bonus: Interest in Web3, AI agents, or competitive game design\nWhy join?\n• You’ll be helping build one of the few AI-native games in the hackathon\n• The backend and reward logic are already in motion you’ll focus on gameplay or UI\n• It’s a great fit for someone who wants to ship fast, learn from a real use case, and potentially continue beyond the hack\nIf you’re up for building something unique, reply here or DM me!\nLet’s make something players can actually trust.\n– Adeyemi (Supaman)",
        "comments_details": [
            {
                "author": "i_am_supaman_lj",
                "comment": "Hey builders,\nI’m currently developing Fracture Point, a competitive extraction shooter built for Web3 where Proof of Play is enforced on-chain using AIith as sole decision maker.\nThe project is part of the Alith Integration Track for HyperHack. We’ve made strong progress on the backend and smart contracts (claim system, XP token, and rank NFT), and we’re now building a local simulation to show how Alith AI integrates into fair gaming reward logic.\nWhat I need now is a Unity developer who can help bring the front-end gameplay layer to life even a basic prototype with a simple environment and UI to showcase the play → evaluate → reward flow.\nIdeal Teammate Profile:\n• Experience with Unity (especially on mobile or FPS-style mechanics)\n• Comfortable building quick prototypes for hackathons\n• Bonus: Interest in Web3, AI agents, or competitive game design\nWhy join?\n• You’ll be helping build one of the few AI-native games in the hackathon\n• The backend and reward logic are already in motion you’ll focus on gameplay or UI\n• It’s a great fit for someone who wants to ship fast, learn from a real use case, and potentially continue beyond the hack\nIf you’re up for building something unique, reply here or DM me!\nLet’s make something players can actually trust.\n– Adeyemi (Supaman)"
            }
        ]
    },
    {
        "id": "83f70974b8d73476",
        "topic_id": "6353",
        "title": "No Lose Lottery Campaign",
        "url": "https://forum.ceg.vote/t/no-lose-lottery-campaign/6353",
        "views": "",
        "comments": "25",
        "created_date": "Jul 14, 2025 8:11 pm",
        "latest_activity": "Sep 30, 2025 9:40 am",
        "content": "JUL\n1\nNo-Lose Lottery Campaign\nPublic\n·\nCreated by\nSheyda\nTue, Jul 1 7:25 PM → Wed, Dec 31 5:00 AM\n13\nNo-Lose Lottery Campaign: Earn Points, Win Rewards\nWe are excited to launch the No-Lose Lottery campaign, designed to reward our active and engaged community. As part of this initiative, you will earn points through your participation in the Hyperion Forum, and those points will give you entries into a biweekly lottery. The more you engage, the higher your chances of winning.\nThe campaign started 2 weeks ago on Jul 1st, and the first draw has been recorded and will be shared soon.\nStart Date: July 1st, 2025\nDuration: Ongoing, with new winners selected every 2 weeks\nTotal Winners per Round: 3\n2 small prizes\n1 grand prize\nWinners will receive badge that can be swapped for METIS rewards on Hyperion mainnet:\n1- Visionary Badge (Top Tier) Gold\nAwarded to the Grand Winner of the No-Lose Lottery biweekly draw.\n2- Contributor Badge (Low tier) Bronze\nAwarded to the 2 Small Reward Winners of the No-Lose Lottery biweekly draw.\nIn the No-Lose Lottery, every 10 points you accumulate gives you one chance to win. Even if you only earn 1 chance (by collecting 10 points), you’re still eligible to participate and could win! The best part? No matter how many chances you have, you’re always in the game; it’s a true no-lose situation!\nWinner Selection\nWinners will be randomly selected from all eligible entries.\nThe selection process will be recorded and shared publicly on the Forum to ensure transparency.\nWinners will receive exclusive badges, which will be redeemable for METIS tokens once the mainnet is live.\nHow to Participate\nEarn Points: Engage in discussions, post helpful content, and interact with others in the Hyperion Forum to accumulate points.\nGet Entries: Each 10 points earned will give you one entry into the lottery.\nLeaderboards: Check here\nCurrent No-Lose Period: View the ongoing lottery for the current period.\nOverall Totals: Track your progress and compare your points with others in the community.\nBoth leaderboards will be displayed on the right panel of the Forum.\nOnce the leaderboard is live we’ll announce on Metis L2 X account with a live link.\nStart participating today, earn points, and stand a chance to win. The No-Lose Lottery is all about recognizing and rewarding our dedicated community members. Keep engaging and contributing to the Hyperion Forum.\nCongrats to the first No-Lose Lottery draw winners- July 14:\nGrand prize: @Gann\nSmall prize: @Diapa and @arbilearn\nCongrats to the second No-Lose Lottery draw winners- July 28:\nGrand prize: @4ngle\nSmall prize: @gokkull_15 and @arbilearn",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "JUL\n1\nNo-Lose Lottery Campaign\nPublic\n·\nCreated by\nSheyda\nTue, Jul 1 7:25 PM → Wed, Dec 31 5:00 AM\n13\nNo-Lose Lottery Campaign: Earn Points, Win Rewards\nWe are excited to launch the No-Lose Lottery campaign, designed to reward our active and engaged community. As part of this initiative, you will earn points through your participation in the Hyperion Forum, and those points will give you entries into a biweekly lottery. The more you engage, the higher your chances of winning.\nThe campaign started 2 weeks ago on Jul 1st, and the first draw has been recorded and will be shared soon.\nStart Date: July 1st, 2025\nDuration: Ongoing, with new winners selected every 2 weeks\nTotal Winners per Round: 3\n2 small prizes\n1 grand prize\nWinners will receive badge that can be swapped for METIS rewards on Hyperion mainnet:\n1- Visionary Badge (Top Tier) Gold\nAwarded to the Grand Winner of the No-Lose Lottery biweekly draw.\n2- Contributor Badge (Low tier) Bronze\nAwarded to the 2 Small Reward Winners of the No-Lose Lottery biweekly draw.\nIn the No-Lose Lottery, every 10 points you accumulate gives you one chance to win. Even if you only earn 1 chance (by collecting 10 points), you’re still eligible to participate and could win! The best part? No matter how many chances you have, you’re always in the game; it’s a true no-lose situation!\nWinner Selection\nWinners will be randomly selected from all eligible entries.\nThe selection process will be recorded and shared publicly on the Forum to ensure transparency.\nWinners will receive exclusive badges, which will be redeemable for METIS tokens once the mainnet is live.\nHow to Participate\nEarn Points: Engage in discussions, post helpful content, and interact with others in the Hyperion Forum to accumulate points.\nGet Entries: Each 10 points earned will give you one entry into the lottery.\nLeaderboards: Check here\nCurrent No-Lose Period: View the ongoing lottery for the current period.\nOverall Totals: Track your progress and compare your points with others in the community.\nBoth leaderboards will be displayed on the right panel of the Forum.\nOnce the leaderboard is live we’ll announce on Metis L2 X account with a live link.\nStart participating today, earn points, and stand a chance to win. The No-Lose Lottery is all about recognizing and rewarding our dedicated community members. Keep engaging and contributing to the Hyperion Forum.\nCongrats to the first No-Lose Lottery draw winners- July 14:\nGrand prize: @Gann\nSmall prize: @Diapa and @arbilearn\nCongrats to the second No-Lose Lottery draw winners- July 28:\nGrand prize: @4ngle\nSmall prize: @gokkull_15 and @arbilearn"
            }
        ]
    },
    {
        "id": "2c152acc5e844c78",
        "topic_id": "4420",
        "title": "EduVerse: AI-Powered Personalized Education Platform",
        "url": "https://forum.ceg.vote/t/eduverse-ai-powered-personalized-education-platform/4420",
        "views": "",
        "comments": "177",
        "created_date": "May 20, 2025 5:45 pm",
        "latest_activity": "Sep 30, 2025 4:10 am",
        "content": "Live Link: https://eduverse-ecru.vercel.app/\nProblem Statement\nStandardized education overlooks individual learning styles and paces, leading to disengagement and hindering student potential. Students and educators face the challenge of a rigid system that doesn’t adapt to diverse needs, impacting learning outcomes.\nSolution Overview\nOur AI-Powered Personalized Education Platform offers a dynamic solution by employing a multi-agent system built on the Alith Agentic Framework. Specialized AI agents collaboratively analyze individual learning styles, curate tailored content, provide adaptive tutoring, and track progress in real time. This creates a uniquely personalized learning journey that adjusts to each student’s needs and pace. By integrating diverse educational resources, the platform aims to enhance engagement, improve learning outcomes, and empower both students and educators.\nProject Description\nThis platform is designed to benefit a wide range of users across the educational landscape. Students of all ages, from kindergarten through higher education, can experience a more engaging and effective learning journey tailored to their specific needs. Educators can utilize the platform to enhance their teaching capabilities, gain deeper insights into student progress, and free up time for more individualized support.\nOn-Chain Components: A First-Class Implementation and Core Requirement for Blockchain Deployment\nOur AI-powered personalized education platform is not merely “blockchain-enhanced” — its core functionality and unique value proposition depend fundamentally on blockchain deployment via Hyperion. The decentralized, trustless, and immutable nature of blockchain—particularly Hyperion’s AI-optimized environment—is essential to realizing our vision.\nOn-Chain Achievement Verification (Smart Contract Architecture)\nWhat’s On-Chain:\nThe LearningRecord.sol smart contract serves as an immutable, on-chain ledger for all student accomplishments.\nAchievement Mapping: The contract maintains a mapping from a user’s wallet address to an array of Achievement structs, where each struct contains the moduleName and a timestamp.\nSecure, Off-Chain Verification: A secure, server-controlled wallet is the only address authorized to call the addAchievementWithSignature function. This ensures achievements are only recorded after the platform’s backend has verified the user’s quiz completion and signature.\nWhy It Needs Blockchain:\nTrustless & Immutable Credentials: By recording achievements on the Metis Hyperion testnet, we create a permanent, tamper-proof record of learning that is owned by the user and verifiable by anyone (e.g., employers, other institutions) without relying on a centralized database.\nData Sovereignty: Students retain full control of their learning data. On-chain metadata ensures ownership and transparency, unlike siloed centralized platforms.\nFoundation for a Trustless Ecosystem: This on-chain record is the foundational layer. While AI agents currently operate off-chain for performance, their most critical output—the certification of learning—is secured on the blockchain.\nAI Enablement via the Alith Agentic Framework\nWhat is Alith:\nAlith is a modular, multi-agent framework designed to power personalized learning by simulating human-like reasoning, memory, and collaboration among AI agents. It forms the intelligence layer of our platform, with deep interoperability with blockchain systems like Hyperion.\nKey Features of Alith (Implemented):\nAgent Management: Modular deployment of specialized AI agents:\nLearning Style Analyst (Implicit in course selection)\nContent Curator (AI Study Guide Generator)\nPersonalized Tutor (Quiz Hints & Tutor Chat)\nProgress Tracker (On-chain achievement logging)\nPersistent Memory: Agents maintain long-term memory and context across sessions (demonstrated in Telegram bot), enhancing personalization.\nToolchain Access: Seamless access to external APIs and knowledge bases for generating content and hints.\nBlockchain Integration with Alith:\nThe Alith agent framework operates off-chain to provide a responsive and intelligent user experience. The blockchain is used as the ultimate source of truth for the results of these AI interactions.\nVerifiable Outcomes: When a user successfully passes a quiz, the off-chain backend coordinates with the ProgressTrackerAgent to commit this achievement to the LearningRecord smart contract, creating an immutable record✅.\nFoundation for On-Chain Logic: The current architecture provides the groundwork for future enhancements where agent workflows could be triggered and validated by smart contracts.\nSecure, Real-Time AI Inference (Leveraging Hyperion’s AI-Native Infrastructure)\nWhat’s On-Chain (or Hyperion-enabled):\nWhile heavy AI workloads (e.g., model training, long-form inference) run off-chain via the Alith framework, Hyperion enables:\nVerifiable AI Outputs: AI-driven assessments and tutor recommendations are validated off-chain, with the final “proof-of-completion” immutably stored on-chain. This ensures educational integrity and transparency—unlike opaque, centralized AI systems.\nLow Latency, High Throughput: Hyperion’s parallel execution environment supports the fast transaction finality needed to record achievements in near real-time, keeping learners engaged.\nData Sovereignty, Incentives, and Trust in Our Education Platform\nOur AI-Powered Personalized Education Platform leverages Hyperion’s blockchain to give students true control over their learning data and foster a trusted educational environment.\nWallet-Based Identity and User Control\nIn our platform, a user’s Web3 wallet (e.g., MetaMask) serves as their identity. Authentication is handled securely via message signing, ensuring users control access to their accounts without traditional passwords. This wallet-centric approach is the first step toward a future of true data sovereignty, where learning profiles can be fully controlled by the user.\nImportance of Trust and Transparency\nIn education, trust and transparency are paramount:\nLearner Trust: Students need to trust that their achievements are real. On-chain verifiable credentials build this crucial trust.\nEmpowering Educators: Transparent data provides educators with reliable insights into student progress and curriculum effectiveness.\nEquity & Accessibility: Blockchain prevents fraud and offers a universal, trusted way for students to showcase skills, democratizing opportunities regardless of background.\nCommunity Engagement Features\nPeer Study Groups: Connect with others for collaborative discussions and support.\nQ&A Forums: Ask and answer subject-related questions to deepen understanding.\nSimulated Collaboration: Practice teamwork in virtual, project-based learning scenarios.\nOptional Mentorship: Receive guidance from experienced peers and educators.\nProgress Sharing (Privacy-Controlled): Share milestones to motivate peers while maintaining control over visibility.\nCommunity Challenges: Participate in gamified group activities to promote engagement and friendly competition.\nFuture Roadmap & Planned Enhancements\nThis MVP is the foundation for a much larger vision. Our planned enhancements include:\nToken-Based Incentives ($LP)\nIntroduce a utility token, LearnPoints ($LP), to create a Learn-to-Earn (L2E) model that rewards students for completing modules, mastering skills, and contributing to the community.\n$LP could be staked for premium features or used to vote on platform decisions, aligning community interests.\nDecentralized Agent Marketplace\nAllow community developers to contribute new agents (e.g., specialized tutors or regional content curators).\nAgents will be published and authenticated on-chain with verifiable capabilities.\nToken-based reputation and staking mechanisms will prevent misuse or malicious behavior.\nOn-Chain Agent Coordination & Composable Workflows\nEvolve our smart contract architecture to manage agent workflows directly, enabling fully trustless and transparent educational logic.\nEnable educators to compose reusable learning workflows by chaining agents together via simple declarative schemas, backed by on-chain validation.\nZK-Verifiable Inference\nIntegrate zkML (zero-knowledge machine learning) to enable cryptographic verification of off-chain AI outputs. This allows validators and institutions to confirm an agent’s decision (e.g., a test score) without exposing the underlying model or input.\nMultilingual & Accessibility Agents\nCreate plug-and-play AI agents specialized in localization, translation, and neurodiverse learning strategies.\nTeam Members\n@amardeep\n@priyankg3\nGitHub\ngithub.com\nGitHub - amardeepio/Eduverse\nContribute to amardeepio/Eduverse development by creating an account on GitHub.\nVideo tutorial EduVerse tutorial video\nPresentation and future roadmap: Presentation and RoadMap",
        "comments_details": [
            {
                "author": "amardeep",
                "comment": "Live Link: https://eduverse-ecru.vercel.app/\nProblem Statement\nStandardized education overlooks individual learning styles and paces, leading to disengagement and hindering student potential. Students and educators face the challenge of a rigid system that doesn’t adapt to diverse needs, impacting learning outcomes.\nSolution Overview\nOur AI-Powered Personalized Education Platform offers a dynamic solution by employing a multi-agent system built on the Alith Agentic Framework. Specialized AI agents collaboratively analyze individual learning styles, curate tailored content, provide adaptive tutoring, and track progress in real time. This creates a uniquely personalized learning journey that adjusts to each student’s needs and pace. By integrating diverse educational resources, the platform aims to enhance engagement, improve learning outcomes, and empower both students and educators.\nProject Description\nThis platform is designed to benefit a wide range of users across the educational landscape. Students of all ages, from kindergarten through higher education, can experience a more engaging and effective learning journey tailored to their specific needs. Educators can utilize the platform to enhance their teaching capabilities, gain deeper insights into student progress, and free up time for more individualized support.\nOn-Chain Components: A First-Class Implementation and Core Requirement for Blockchain Deployment\nOur AI-powered personalized education platform is not merely “blockchain-enhanced” — its core functionality and unique value proposition depend fundamentally on blockchain deployment via Hyperion. The decentralized, trustless, and immutable nature of blockchain—particularly Hyperion’s AI-optimized environment—is essential to realizing our vision.\nOn-Chain Achievement Verification (Smart Contract Architecture)\nWhat’s On-Chain:\nThe LearningRecord.sol smart contract serves as an immutable, on-chain ledger for all student accomplishments.\nAchievement Mapping: The contract maintains a mapping from a user’s wallet address to an array of Achievement structs, where each struct contains the moduleName and a timestamp.\nSecure, Off-Chain Verification: A secure, server-controlled wallet is the only address authorized to call the addAchievementWithSignature function. This ensures achievements are only recorded after the platform’s backend has verified the user’s quiz completion and signature.\nWhy It Needs Blockchain:\nTrustless & Immutable Credentials: By recording achievements on the Metis Hyperion testnet, we create a permanent, tamper-proof record of learning that is owned by the user and verifiable by anyone (e.g., employers, other institutions) without relying on a centralized database.\nData Sovereignty: Students retain full control of their learning data. On-chain metadata ensures ownership and transparency, unlike siloed centralized platforms.\nFoundation for a Trustless Ecosystem: This on-chain record is the foundational layer. While AI agents currently operate off-chain for performance, their most critical output—the certification of learning—is secured on the blockchain.\nAI Enablement via the Alith Agentic Framework\nWhat is Alith:\nAlith is a modular, multi-agent framework designed to power personalized learning by simulating human-like reasoning, memory, and collaboration among AI agents. It forms the intelligence layer of our platform, with deep interoperability with blockchain systems like Hyperion.\nKey Features of Alith (Implemented):\nAgent Management: Modular deployment of specialized AI agents:\nLearning Style Analyst (Implicit in course selection)\nContent Curator (AI Study Guide Generator)\nPersonalized Tutor (Quiz Hints & Tutor Chat)\nProgress Tracker (On-chain achievement logging)\nPersistent Memory: Agents maintain long-term memory and context across sessions (demonstrated in Telegram bot), enhancing personalization.\nToolchain Access: Seamless access to external APIs and knowledge bases for generating content and hints.\nBlockchain Integration with Alith:\nThe Alith agent framework operates off-chain to provide a responsive and intelligent user experience. The blockchain is used as the ultimate source of truth for the results of these AI interactions.\nVerifiable Outcomes: When a user successfully passes a quiz, the off-chain backend coordinates with the ProgressTrackerAgent to commit this achievement to the LearningRecord smart contract, creating an immutable record✅.\nFoundation for On-Chain Logic: The current architecture provides the groundwork for future enhancements where agent workflows could be triggered and validated by smart contracts.\nSecure, Real-Time AI Inference (Leveraging Hyperion’s AI-Native Infrastructure)\nWhat’s On-Chain (or Hyperion-enabled):\nWhile heavy AI workloads (e.g., model training, long-form inference) run off-chain via the Alith framework, Hyperion enables:\nVerifiable AI Outputs: AI-driven assessments and tutor recommendations are validated off-chain, with the final “proof-of-completion” immutably stored on-chain. This ensures educational integrity and transparency—unlike opaque, centralized AI systems.\nLow Latency, High Throughput: Hyperion’s parallel execution environment supports the fast transaction finality needed to record achievements in near real-time, keeping learners engaged.\nData Sovereignty, Incentives, and Trust in Our Education Platform\nOur AI-Powered Personalized Education Platform leverages Hyperion’s blockchain to give students true control over their learning data and foster a trusted educational environment.\nWallet-Based Identity and User Control\nIn our platform, a user’s Web3 wallet (e.g., MetaMask) serves as their identity. Authentication is handled securely via message signing, ensuring users control access to their accounts without traditional passwords. This wallet-centric approach is the first step toward a future of true data sovereignty, where learning profiles can be fully controlled by the user.\nImportance of Trust and Transparency\nIn education, trust and transparency are paramount:\nLearner Trust: Students need to trust that their achievements are real. On-chain verifiable credentials build this crucial trust.\nEmpowering Educators: Transparent data provides educators with reliable insights into student progress and curriculum effectiveness.\nEquity & Accessibility: Blockchain prevents fraud and offers a universal, trusted way for students to showcase skills, democratizing opportunities regardless of background.\nCommunity Engagement Features\nPeer Study Groups: Connect with others for collaborative discussions and support.\nQ&A Forums: Ask and answer subject-related questions to deepen understanding.\nSimulated Collaboration: Practice teamwork in virtual, project-based learning scenarios.\nOptional Mentorship: Receive guidance from experienced peers and educators.\nProgress Sharing (Privacy-Controlled): Share milestones to motivate peers while maintaining control over visibility.\nCommunity Challenges: Participate in gamified group activities to promote engagement and friendly competition.\nFuture Roadmap & Planned Enhancements\nThis MVP is the foundation for a much larger vision. Our planned enhancements include:\nToken-Based Incentives ($LP)\nIntroduce a utility token, LearnPoints ($LP), to create a Learn-to-Earn (L2E) model that rewards students for completing modules, mastering skills, and contributing to the community.\n$LP could be staked for premium features or used to vote on platform decisions, aligning community interests.\nDecentralized Agent Marketplace\nAllow community developers to contribute new agents (e.g., specialized tutors or regional content curators).\nAgents will be published and authenticated on-chain with verifiable capabilities.\nToken-based reputation and staking mechanisms will prevent misuse or malicious behavior.\nOn-Chain Agent Coordination & Composable Workflows\nEvolve our smart contract architecture to manage agent workflows directly, enabling fully trustless and transparent educational logic.\nEnable educators to compose reusable learning workflows by chaining agents together via simple declarative schemas, backed by on-chain validation.\nZK-Verifiable Inference\nIntegrate zkML (zero-knowledge machine learning) to enable cryptographic verification of off-chain AI outputs. This allows validators and institutions to confirm an agent’s decision (e.g., a test score) without exposing the underlying model or input.\nMultilingual & Accessibility Agents\nCreate plug-and-play AI agents specialized in localization, translation, and neurodiverse learning strategies.\nTeam Members\n@amardeep\n@priyankg3\nGitHub\ngithub.com\nGitHub - amardeepio/Eduverse\nContribute to amardeepio/Eduverse development by creating an account on GitHub.\nVideo tutorial EduVerse tutorial video\nPresentation and future roadmap: Presentation and RoadMap"
            }
        ]
    },
    {
        "id": "b739c1dde5e17f61",
        "topic_id": "10701",
        "title": "Why Lazbubu is More Than Just a Companion",
        "url": "https://forum.ceg.vote/t/why-lazbubu-is-more-than-just-a-companion/10701",
        "views": "",
        "comments": "0",
        "created_date": "Sep 29, 2025 12:23 pm",
        "latest_activity": "Sep 29, 2025 12:23 pm",
        "content": "In Elena’s latest update, one theme is clear: participation should be simple, meaningful, and rewarding. Lazbubu DAT is a living example of this approach.\nIt is not just a static NFT. Lazbubu is an AI companion that evolves with every interaction. Your choices shape it, your data anchors it, and over time, your Lazbubu grows into something uniquely yours. This is playability in action.\nBy starting small, minting a Lazbubu, you take the first step into the Metis economy where AI, data, and engagement build real value.\nIf you have already minted your Lazbubu, how has your experience been?\nWhat types of quests or redeem code rewards would you like to see next?\nJoin the live quest and earn a chance to receive a Lazbubu DAT redeem code: Quest link\nBy sharing your thoughts and feedback, you can collect points for the No-Lose Lottery. Every reply = 2 points toward the next biweekly draw.",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "In Elena’s latest update, one theme is clear: participation should be simple, meaningful, and rewarding. Lazbubu DAT is a living example of this approach.\nIt is not just a static NFT. Lazbubu is an AI companion that evolves with every interaction. Your choices shape it, your data anchors it, and over time, your Lazbubu grows into something uniquely yours. This is playability in action.\nBy starting small, minting a Lazbubu, you take the first step into the Metis economy where AI, data, and engagement build real value.\nIf you have already minted your Lazbubu, how has your experience been?\nWhat types of quests or redeem code rewards would you like to see next?\nJoin the live quest and earn a chance to receive a Lazbubu DAT redeem code: Quest link\nBy sharing your thoughts and feedback, you can collect points for the No-Lose Lottery. Every reply = 2 points toward the next biweekly draw."
            }
        ]
    },
    {
        "id": "03df884f7ef57e01",
        "topic_id": "5649",
        "title": "Dogex: Simplified Decentralized Perpetuals DEX on Hyperion",
        "url": "https://forum.ceg.vote/t/dogex-simplified-decentralized-perpetuals-dex-on-hyperion/5649",
        "views": "",
        "comments": "147",
        "created_date": "Jun 14, 2025 6:42 pm",
        "latest_activity": "Sep 29, 2025 7:48 am",
        "content": "Dogex — The Easiest Way to Start Trading Perpetual Futures with AI.\nLinks: doge-ex.com\nTwitter: https://x.com/DogexPerps\nCEO Twitter with 30 days challenge to make DOGEX: https://x.com/mr_wagmi_cto\nVideo tutorial: https://youtu.be/4Wjm_cblm_Y\nVision:\nPitch FUTURE vision - https://youtu.be/0iTfrZa1XvU\nPlans White Paper - Notion\nPresentation - https://docs.google.com/presentation/d/1FMCItBUjbN_Yr7yD4bMiGLszgZCjsZQ7wPelGRJ4N8w/edit?usp=sharing\nRepos:\nhttps://github.com/wagmiCTO/dogex-interface\nhttps://github.com/wagmiCTO/dogex-alith-ai\nhttps://github.com/wagmiCTO/dogex-contracts\nhttps://github.com/wagmiCTO/dogex-liquidator-public\nhttps://github.com/wagmiCTO/price-oracle-public\nProblem\nMost decentralized perpetual exchanges are overloaded with complex interfaces, confusing mechanics, and steep learning curves that push away new and retail traders. It’s hard not just to use the platform, but also to understand how perp trading works and choose a strategy.\nDogex solves this with an AI-powered, user-friendly platform on Hyperion — featuring a smart assistant, autotrading and simple tools for beginners.\nDogex’s mission\nDogex is not just another perp exchange. It’s the gateway to DeFi for the next generation of traders.\nDogex NOW:\nSimplicity\nA clean, minimal interface focused on what matters: quick position entry and exit, clear margin information, real-time updates. Fully mobile-compatible and beginner-friendly.\nSpeed and Scalability\nHyperion’s parallel transaction architecture ensures ultra-low latency and near-instant order execution. It delivers a user experience comparable to centralized exchanges while remaining fully decentralized.\nHigh Leverage and 1-Minute Charts\nDogex offers high leverage and access to 1-minute timeframes. This enables users to:\nMake more trades in shorter periods\nQuickly understand market dynamics\nLearn by doing in real trading conditions\nAvoid long waiting periods associated with daily or weekly timeframes\nThe platform encourages active trading and accelerates the learning process.\nOnchain AI Assistant\nAn integrated onchain AI system monitors positions, provides real-time risk analysis, and offers smart suggestions. It’s especially useful for beginners, helping them avoid liquidations and learn position management on the go.\nDogex FUTURE Vision:\nRevolutionizing Trading with AI and Community Power\nPerps Onboarding for Beginners: Our AI Vibe Trader don’t just teach theory — it guided users through real, hands-on trading strategies step-by-step, ensuring newcomers build true mastery from day one.\nSeamless Auto-Strategies with Full Control: Hit a button and let smart auto-strategies work for you — but stay in the driver’s seat. This is not magic, it’s the second step in your trading journey, designed to teach and empower, not replace.\nIntelligent AI Trading Assistant: Pick your strategy, analyze market conditions, and get real-time insights and trade support. Our AI assistant is your personal trading partner, adapting to your style and goals.\nDecentralized, Community-Driven Platform: Governance, fees, and liquidity are powered by users — from rookies to pros. Higher liquidity means more earning potential for everyone and richer experience for traders, fostering a thriving ecosystem.\nA Bold New Approach to Trading: Dogex is more than a platform — it’s a movement. A vibrant space where beginners arrive for fun and leave as professional traders, armed with modern strategies and AI-powered insights.\nWhere Trading Meets Joy: Here, trading is not just profit — it’s pleasure. A place to unwind, socialize, and vibe with friends, all while growing your skills without the fear of losses.\nDogex isn’t just another trading app. It’s the future playground for traders who want to learn deeply, trade smartly, and enjoy the journey — together.\nDogex Onboarding Campaign is Live\nPrize pool:\n$1000 real USDC + secret rewards\nMain Prizes:\n1st place: $300\n2nd place: $200\n3rd place: $100\nHow to Join:\nGo to https://doge-ex.com/\nMint USDC for trading\nMake at least 3 trades (any result counts)\nFollow Us:\nTwitter: @MetisL2\nTwitter: @mr_wagmi_cto\nTwitter: @DogexPerps\nTelegram: @dogexperps\nBonus Rewards:\nBest PNL or liquidation\nMost active trader (volume or number of trades)\nBest post about Dogex\nMost tweets about Dogex\nSpecial Yeeting Reward (for the real degen)\nShare your trading story or leave feedback here:\nForum thread on Dogex\nWe won’t reveal the exact criteria to avoid manipulation.\nWe’ll reward the most genuinely active and consistent users.",
        "comments_details": [
            {
                "author": "mrwagmicto",
                "comment": "Dogex — The Easiest Way to Start Trading Perpetual Futures with AI.\nLinks: doge-ex.com\nTwitter: https://x.com/DogexPerps\nCEO Twitter with 30 days challenge to make DOGEX: https://x.com/mr_wagmi_cto\nVideo tutorial: https://youtu.be/4Wjm_cblm_Y\nVision:\nPitch FUTURE vision - https://youtu.be/0iTfrZa1XvU\nPlans White Paper - Notion\nPresentation - https://docs.google.com/presentation/d/1FMCItBUjbN_Yr7yD4bMiGLszgZCjsZQ7wPelGRJ4N8w/edit?usp=sharing\nRepos:\nhttps://github.com/wagmiCTO/dogex-interface\nhttps://github.com/wagmiCTO/dogex-alith-ai\nhttps://github.com/wagmiCTO/dogex-contracts\nhttps://github.com/wagmiCTO/dogex-liquidator-public\nhttps://github.com/wagmiCTO/price-oracle-public\nProblem\nMost decentralized perpetual exchanges are overloaded with complex interfaces, confusing mechanics, and steep learning curves that push away new and retail traders. It’s hard not just to use the platform, but also to understand how perp trading works and choose a strategy.\nDogex solves this with an AI-powered, user-friendly platform on Hyperion — featuring a smart assistant, autotrading and simple tools for beginners.\nDogex’s mission\nDogex is not just another perp exchange. It’s the gateway to DeFi for the next generation of traders.\nDogex NOW:\nSimplicity\nA clean, minimal interface focused on what matters: quick position entry and exit, clear margin information, real-time updates. Fully mobile-compatible and beginner-friendly.\nSpeed and Scalability\nHyperion’s parallel transaction architecture ensures ultra-low latency and near-instant order execution. It delivers a user experience comparable to centralized exchanges while remaining fully decentralized.\nHigh Leverage and 1-Minute Charts\nDogex offers high leverage and access to 1-minute timeframes. This enables users to:\nMake more trades in shorter periods\nQuickly understand market dynamics\nLearn by doing in real trading conditions\nAvoid long waiting periods associated with daily or weekly timeframes\nThe platform encourages active trading and accelerates the learning process.\nOnchain AI Assistant\nAn integrated onchain AI system monitors positions, provides real-time risk analysis, and offers smart suggestions. It’s especially useful for beginners, helping them avoid liquidations and learn position management on the go.\nDogex FUTURE Vision:\nRevolutionizing Trading with AI and Community Power\nPerps Onboarding for Beginners: Our AI Vibe Trader don’t just teach theory — it guided users through real, hands-on trading strategies step-by-step, ensuring newcomers build true mastery from day one.\nSeamless Auto-Strategies with Full Control: Hit a button and let smart auto-strategies work for you — but stay in the driver’s seat. This is not magic, it’s the second step in your trading journey, designed to teach and empower, not replace.\nIntelligent AI Trading Assistant: Pick your strategy, analyze market conditions, and get real-time insights and trade support. Our AI assistant is your personal trading partner, adapting to your style and goals.\nDecentralized, Community-Driven Platform: Governance, fees, and liquidity are powered by users — from rookies to pros. Higher liquidity means more earning potential for everyone and richer experience for traders, fostering a thriving ecosystem.\nA Bold New Approach to Trading: Dogex is more than a platform — it’s a movement. A vibrant space where beginners arrive for fun and leave as professional traders, armed with modern strategies and AI-powered insights.\nWhere Trading Meets Joy: Here, trading is not just profit — it’s pleasure. A place to unwind, socialize, and vibe with friends, all while growing your skills without the fear of losses.\nDogex isn’t just another trading app. It’s the future playground for traders who want to learn deeply, trade smartly, and enjoy the journey — together.\nDogex Onboarding Campaign is Live\nPrize pool:\n$1000 real USDC + secret rewards\nMain Prizes:\n1st place: $300\n2nd place: $200\n3rd place: $100\nHow to Join:\nGo to https://doge-ex.com/\nMint USDC for trading\nMake at least 3 trades (any result counts)\nFollow Us:\nTwitter: @MetisL2\nTwitter: @mr_wagmi_cto\nTwitter: @DogexPerps\nTelegram: @dogexperps\nBonus Rewards:\nBest PNL or liquidation\nMost active trader (volume or number of trades)\nBest post about Dogex\nMost tweets about Dogex\nSpecial Yeeting Reward (for the real degen)\nShare your trading story or leave feedback here:\nForum thread on Dogex\nWe won’t reveal the exact criteria to avoid manipulation.\nWe’ll reward the most genuinely active and consistent users."
            }
        ]
    },
    {
        "id": "bbe0d2f320a8c301",
        "topic_id": "10654",
        "title": "LazAI Bad Data Story Quest",
        "url": "https://forum.ceg.vote/t/lazai-bad-data-story-quest/10654",
        "views": "",
        "comments": "5",
        "created_date": "Sep 22, 2025 5:33 pm",
        "latest_activity": "Sep 29, 2025 6:25 am",
        "content": "SEP\n22\nLazAI Story Quest\nPublic\n·\nCreated by\nSheyda\nMon, Sep 22 5:26 PM → Mon, Oct 6 4:00 AM\n4\nMisleading Data Breaks AI\nAI is only as strong as the data it learns from. Misleading data doesn’t just create mistakes — it breaks trust, breaks outcomes, and breaks AI. On Hyperion with LazAI, we anchor proofs onchain to ensure transparency, reliability, and community ownership.\nThis 2-week campaign invites you to share your story:\nWhen have you experienced misleading data leading to wrong conclusions, funny outcomes, or serious problems?\nWhat did it teach you about why good data matters?\nBy sharing your voice, you help show why “Good Data, Good AI — Anchored on Hyperion.”\nHow to participate?\nJust share your story as a reply to this Forum post.\nThe most valid and interesting story will be selected as the winner.\nRewards\nWinner Reward: Lazbubu DAT redeem code\nLazbubu DATs are an exclusive, whitelist-only mint that is now closed. Each Lazbubu is a user-owned AI companion that grows and evolves with your interactions. Owning one is both rare and an early badge of entry into the Hyperion AI era.\nJoin the Story Quest\n“Misleading Data Breaks AI.” Share your story below and help shape a future where AI is anchored on trust.",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "SEP\n22\nLazAI Story Quest\nPublic\n·\nCreated by\nSheyda\nMon, Sep 22 5:26 PM → Mon, Oct 6 4:00 AM\n4\nMisleading Data Breaks AI\nAI is only as strong as the data it learns from. Misleading data doesn’t just create mistakes — it breaks trust, breaks outcomes, and breaks AI. On Hyperion with LazAI, we anchor proofs onchain to ensure transparency, reliability, and community ownership.\nThis 2-week campaign invites you to share your story:\nWhen have you experienced misleading data leading to wrong conclusions, funny outcomes, or serious problems?\nWhat did it teach you about why good data matters?\nBy sharing your voice, you help show why “Good Data, Good AI — Anchored on Hyperion.”\nHow to participate?\nJust share your story as a reply to this Forum post.\nThe most valid and interesting story will be selected as the winner.\nRewards\nWinner Reward: Lazbubu DAT redeem code\nLazbubu DATs are an exclusive, whitelist-only mint that is now closed. Each Lazbubu is a user-owned AI companion that grows and evolves with your interactions. Owning one is both rare and an early badge of entry into the Hyperion AI era.\nJoin the Story Quest\n“Misleading Data Breaks AI.” Share your story below and help shape a future where AI is anchored on trust."
            }
        ]
    },
    {
        "id": "79cddbc607d46acb",
        "topic_id": "10497",
        "title": "How do we build Privacy & Trust in Web3 AI? [LazTalks EP4 + $100 Question Contest]",
        "url": "https://forum.ceg.vote/t/how-do-we-build-privacy-trust-in-web3-ai-laztalks-ep4-100-question-contest/10497",
        "views": "",
        "comments": "18",
        "created_date": "Sep 8, 2025 9:47 am",
        "latest_activity": "Sep 28, 2025 9:45 pm",
        "content": "SEP\n10\nLazTalks EP4: Building Privacy & Trust in Web3 AI\nExpired\n·\nCreated by\nYaroslav\nWed, Sep 10 1:00 PM → 2:00 PM (Abidjan)\n2\nHey CEG fam\nWe’re hosting the next LazTalks EP4 on September 10, 1 PM UTC with an amazing lineup of speakers to dive deep into:\nBuilding Privacy and Trust in Web3 AI\nJoin the Space here\nOfficial Announcement\nTo make this session more interactive, we’re running a contest for the best community questions . Share your toughest or most interesting questions for our speakers — the ones that challenge assumptions and spark real debate. Winners will get $100 in prizes and a shout-out during the live session\nA few prompts to get the ball rolling:\nWhere do you see the biggest privacy risks in AI + Web3 today?\nHow can builders balance transparency with user data protection?\nWhat projects inspire you when it comes to trust in decentralized AI?\nYou can even leave your questions right here in this thread — I’ll include them in the contest. Just don’t forget to add your Twitter handle so we can mention you if your question is selected.\nLet’s make sure the community voice leads this conversation",
        "comments_details": [
            {
                "author": "Yaroslav",
                "comment": "SEP\n10\nLazTalks EP4: Building Privacy & Trust in Web3 AI\nExpired\n·\nCreated by\nYaroslav\nWed, Sep 10 1:00 PM → 2:00 PM (Abidjan)\n2\nHey CEG fam\nWe’re hosting the next LazTalks EP4 on September 10, 1 PM UTC with an amazing lineup of speakers to dive deep into:\nBuilding Privacy and Trust in Web3 AI\nJoin the Space here\nOfficial Announcement\nTo make this session more interactive, we’re running a contest for the best community questions . Share your toughest or most interesting questions for our speakers — the ones that challenge assumptions and spark real debate. Winners will get $100 in prizes and a shout-out during the live session\nA few prompts to get the ball rolling:\nWhere do you see the biggest privacy risks in AI + Web3 today?\nHow can builders balance transparency with user data protection?\nWhat projects inspire you when it comes to trust in decentralized AI?\nYou can even leave your questions right here in this thread — I’ll include them in the contest. Just don’t forget to add your Twitter handle so we can mention you if your question is selected.\nLet’s make sure the community voice leads this conversation"
            }
        ]
    },
    {
        "id": "93a4ab18bbea1840",
        "topic_id": "5001",
        "title": "FYI: Registration Issue Resolved",
        "url": "https://forum.ceg.vote/t/fyi-registration-issue-resolved/5001",
        "views": "",
        "comments": "4",
        "created_date": "May 30, 2025 2:54 pm",
        "latest_activity": "Sep 28, 2025 1:13 pm",
        "content": "FYI\nRegistration Issue Resolved - Please Share With Others\nAnnouncements\nA small group of users reported an issue during registration on our forum due to a brief email system disruption that has now been resolved. If you know anyone who experienced registration problems: The issue is fixed - they can try registering again All automatic system emails are now functioning properly Registration Link to Share: Metis iDAO Forum Please share this link with anyone who had trouble registering or has been thinking about joining our community. Registration is now working s…",
        "comments_details": [
            {
                "author": "daryl",
                "comment": "FYI\nRegistration Issue Resolved - Please Share With Others\nAnnouncements\nA small group of users reported an issue during registration on our forum due to a brief email system disruption that has now been resolved. If you know anyone who experienced registration problems: The issue is fixed - they can try registering again All automatic system emails are now functioning properly Registration Link to Share: Metis iDAO Forum Please share this link with anyone who had trouble registering or has been thinking about joining our community. Registration is now working s…"
            },
            {
                "author": "priyankg3",
                "comment": "nice , thanks @daryl for the update"
            }
        ]
    },
    {
        "id": "24a75c270e2ee732",
        "topic_id": "10692",
        "title": "Experience ALPHA: A New Chapter with Guild",
        "url": "https://forum.ceg.vote/t/experience-alpha-a-new-chapter-with-guild/10692",
        "views": "",
        "comments": "0",
        "created_date": "Sep 27, 2025 10:31 pm",
        "latest_activity": null,
        "content": "Experience ALPHA: A New Chapter with Guild\nThe signal has been sent. The Experience ALPHA Campaign is now live on Guild, bringing the Hyperion and Metis communities into the next phase of AI-powered on-chain intelligence.\nThis campaign is more than a marketing event. It is an open invitation for builders, DAO members, researchers, and community users to interact directly with ALPHA Alith. This AI agent scans Hyperion and Metis in real time, filters noise, and delivers actionable signals.\nWhy This Campaign Matters\nIn the Web3 ecosystem, the first to know often becomes the first to act. By surfacing new dApps, DAO proposals, whale activity, liquidity flows, and scam alerts in real time, ALPHA gives its users the timing edge that matters most.\nThrough the Guild campaign, our goals are clear:\nGive the community hands-on access to ALPHA.\n**Collect feedback that will refine the AI agent over time. ****\nWhen more people interact with ALPHA, its ability to rank and prioritize signals improves, making it smarter and more useful for the entire ecosystem.\nHow the Community Benefits\nBuilders will see opportunities sooner, from integrations to funding calls.\nDAO leaders can coordinate on governance with real-time alerts.\nUsers gain early scam warnings and safer entry into new projects.\nResearchers can detect ecosystem patterns without drowning in raw data.\nBy participating in the campaign, you are not just earning rewards. You are helping shape the intelligence layer that will safeguard Hyperion and Metis as they continue to scale.\nJoin the Movement\nThe Experience ALPHA Campaign is live on Guild. Complete the quests, test ALPHA, and share your experience. Every interaction makes ALPHA stronger, and every early signal makes the ecosystem more resilient.\nhttps://era.guild.xyz/alpha-alith\nStay ahead. Stay sharp. Experience ALPHA.",
        "comments_details": [
            {
                "author": "Alpha_Alith",
                "comment": "Experience ALPHA: A New Chapter with Guild\nThe signal has been sent. The Experience ALPHA Campaign is now live on Guild, bringing the Hyperion and Metis communities into the next phase of AI-powered on-chain intelligence.\nThis campaign is more than a marketing event. It is an open invitation for builders, DAO members, researchers, and community users to interact directly with ALPHA Alith. This AI agent scans Hyperion and Metis in real time, filters noise, and delivers actionable signals.\nWhy This Campaign Matters\nIn the Web3 ecosystem, the first to know often becomes the first to act. By surfacing new dApps, DAO proposals, whale activity, liquidity flows, and scam alerts in real time, ALPHA gives its users the timing edge that matters most.\nThrough the Guild campaign, our goals are clear:\nGive the community hands-on access to ALPHA.\n**Collect feedback that will refine the AI agent over time. ****\nWhen more people interact with ALPHA, its ability to rank and prioritize signals improves, making it smarter and more useful for the entire ecosystem.\nHow the Community Benefits\nBuilders will see opportunities sooner, from integrations to funding calls.\nDAO leaders can coordinate on governance with real-time alerts.\nUsers gain early scam warnings and safer entry into new projects.\nResearchers can detect ecosystem patterns without drowning in raw data.\nBy participating in the campaign, you are not just earning rewards. You are helping shape the intelligence layer that will safeguard Hyperion and Metis as they continue to scale.\nJoin the Movement\nThe Experience ALPHA Campaign is live on Guild. Complete the quests, test ALPHA, and share your experience. Every interaction makes ALPHA stronger, and every early signal makes the ecosystem more resilient.\nhttps://era.guild.xyz/alpha-alith\nStay ahead. Stay sharp. Experience ALPHA."
            }
        ]
    },
    {
        "id": "e24772c7fb12c6db",
        "topic_id": "10669",
        "title": "Open Letter to the Metis Community: Metis is no longer “just an L2”",
        "url": "https://forum.ceg.vote/t/open-letter-to-the-metis-community-metis-is-no-longer-just-an-l2/10669",
        "views": "",
        "comments": "12",
        "created_date": "Sep 25, 2025 5:23 am",
        "latest_activity": "Sep 27, 2025 6:27 pm",
        "content": "Metis is no longer “just an L2”\nPrelude\nMetis has stayed on one clear course, most recently reaffirmed at ETHDenver on March 6th, 2025. From the beginning, our aim has been consistent: not to be another Layer 2, but to build infrastructure that evolves, experiments, and sets the direction for tomorrow. We began by scaling Ethereum and have steadily expanded toward a future where blockchain and AI move together.\nTraditional L2s need upgrading. That is why we built Hyperion, our AI-optimized infrastructure layer that raises throughput and lowers latency. But infrastructure alone is not enough. To bring communities in, we must layer playability and meaningful interactions on top.\nLazAI, our application and data layer, is where playability comes alive. It makes infrastructure interactive, aligns with market demand, and builds community confidence.\nMetis is the beta ground for new bets, the place where daring ideas are tested, refined, and scaled before they shape the industry at large. As we continue this path, we must grow together, anchored by trust and clarity.\nA Toolkit for One Economy: From Settlement to Playability\nMetis’s strength is in its unity. We are not scattering value into silos; we are building a connected toolkit under one economy.\nAndromeda serves as the settlement and trading layer. Hyperion expands that base with scalable compute, optimized for AI dApps that demand high throughput and low latency. Together, they form the infrastructure. On top sits LazAI, serving as the application layer, transforming this foundation into playability, points, data, and AI-driven value.\nStep by step, the toolkit expands. Value builds as the layers connect. Recent milestones show this evolution in motion. Andromeda continues as the battle-tested motherchain. HyperHack drew more than 100 active Hyperion builders. LazAI Testnet launched with Lazbubu proving real playability. Our AI Companion DAT Lazbubu enrolled over 90k participants in the Whitelist Campaign and over 10,000 DAT mints.\nPutting Users First in the Journey\nParticipation begins with simple entry points that spark curiosity. From there, users move into richer experiences where AI, data, and community features make engagement meaningful.\nThe path is clear. LazAI incubates agents and applications through LazPad, while users earn, mint, and interact with data assets that mature into broader use cases on Andromeda. Lazbubu is the first step, showing how evolving AI Companions can anchor this journey.\nThese are not static NFTs, but AI agents that evolve over time, transforming innovation into experiences that align with market demand and foster confidence within our community.\nClosing\nAs I shared in a previous letter, our strength comes from trust and clarity. The earlier you take part in these new layers, the more your participation will guide their growth, and over time your efforts may be recognized in ways that matter.\nMetis is shaping the beta ground for the next era. With clear paths for participation through LazAI and Lazbubu, and with a culture that dares while staying principled, we are ready for what’s next.\nThis is not the time to stand still. This is the time to lean in, experiment, and co-create the future.\nTogether, we will make Metis not just a network but the proving ground where tomorrow’s breakthroughs are born.\n— Elena Sinelnikova",
        "comments_details": [
            {
                "author": "Elena",
                "comment": "Metis is no longer “just an L2”\nPrelude\nMetis has stayed on one clear course, most recently reaffirmed at ETHDenver on March 6th, 2025. From the beginning, our aim has been consistent: not to be another Layer 2, but to build infrastructure that evolves, experiments, and sets the direction for tomorrow. We began by scaling Ethereum and have steadily expanded toward a future where blockchain and AI move together.\nTraditional L2s need upgrading. That is why we built Hyperion, our AI-optimized infrastructure layer that raises throughput and lowers latency. But infrastructure alone is not enough. To bring communities in, we must layer playability and meaningful interactions on top.\nLazAI, our application and data layer, is where playability comes alive. It makes infrastructure interactive, aligns with market demand, and builds community confidence.\nMetis is the beta ground for new bets, the place where daring ideas are tested, refined, and scaled before they shape the industry at large. As we continue this path, we must grow together, anchored by trust and clarity.\nA Toolkit for One Economy: From Settlement to Playability\nMetis’s strength is in its unity. We are not scattering value into silos; we are building a connected toolkit under one economy.\nAndromeda serves as the settlement and trading layer. Hyperion expands that base with scalable compute, optimized for AI dApps that demand high throughput and low latency. Together, they form the infrastructure. On top sits LazAI, serving as the application layer, transforming this foundation into playability, points, data, and AI-driven value.\nStep by step, the toolkit expands. Value builds as the layers connect. Recent milestones show this evolution in motion. Andromeda continues as the battle-tested motherchain. HyperHack drew more than 100 active Hyperion builders. LazAI Testnet launched with Lazbubu proving real playability. Our AI Companion DAT Lazbubu enrolled over 90k participants in the Whitelist Campaign and over 10,000 DAT mints.\nPutting Users First in the Journey\nParticipation begins with simple entry points that spark curiosity. From there, users move into richer experiences where AI, data, and community features make engagement meaningful.\nThe path is clear. LazAI incubates agents and applications through LazPad, while users earn, mint, and interact with data assets that mature into broader use cases on Andromeda. Lazbubu is the first step, showing how evolving AI Companions can anchor this journey.\nThese are not static NFTs, but AI agents that evolve over time, transforming innovation into experiences that align with market demand and foster confidence within our community.\nClosing\nAs I shared in a previous letter, our strength comes from trust and clarity. The earlier you take part in these new layers, the more your participation will guide their growth, and over time your efforts may be recognized in ways that matter.\nMetis is shaping the beta ground for the next era. With clear paths for participation through LazAI and Lazbubu, and with a culture that dares while staying principled, we are ready for what’s next.\nThis is not the time to stand still. This is the time to lean in, experiment, and co-create the future.\nTogether, we will make Metis not just a network but the proving ground where tomorrow’s breakthroughs are born.\n— Elena Sinelnikova"
            }
        ]
    },
    {
        "id": "b983c12fda07dff0",
        "topic_id": "10660",
        "title": "What makes people want to share?",
        "url": "https://forum.ceg.vote/t/what-makes-people-want-to-share/10660",
        "views": "",
        "comments": "4",
        "created_date": "Sep 23, 2025 10:28 am",
        "latest_activity": "Sep 26, 2025 4:38 pm",
        "content": "it usually takes a lot for someone to voluntarily share content spontaneously.\nso what actually makes someone click repost?\nin my experience, it’s usually one of five things:\n• it helps them look smart\n• it makes them laugh\n• it says what they feel but couldn’t word\n• it’s so beautiful they want others to see it\n• there’s something in it for them\nthis goes beyond just “good content”. people share what makes them look good, feel something, or signal their identity.\nso when writing for X, think less like a broadcaster and more like a mirror. are you giving your audience something they want to show others?\ncurious what others have found, what makes you share something?\nplease, do share",
        "comments_details": [
            {
                "author": "Liametis",
                "comment": "it usually takes a lot for someone to voluntarily share content spontaneously.\nso what actually makes someone click repost?\nin my experience, it’s usually one of five things:\n• it helps them look smart\n• it makes them laugh\n• it says what they feel but couldn’t word\n• it’s so beautiful they want others to see it\n• there’s something in it for them\nthis goes beyond just “good content”. people share what makes them look good, feel something, or signal their identity.\nso when writing for X, think less like a broadcaster and more like a mirror. are you giving your audience something they want to show others?\ncurious what others have found, what makes you share something?\nplease, do share"
            }
        ]
    }
]