[
    {
        "id": "52de8e31eba960ad",
        "topic_id": "5206",
        "title": "Request DEX Test Tokens Here",
        "url": "https://forum.ceg.vote/t/request-dex-test-tokens-here/5206",
        "views": "",
        "comments": "12",
        "created_date": "Jun 3, 2025 6:32 pm",
        "latest_activity": "Jun 28, 2025 10:31 pm",
        "content": "Hi Everyone, we launched the Hype Test DEX. If you need test tokens, please drop your wallet and I’ll send some to you.\nhype-test-dex.metis.io\nHype Test DEX\nHype Test DEX\nMore information about dev resources, including the subgraph for this DEX can be found here:\nMetis Docs\nTest DEX | Metis Docs\nLearn how to use the Test DEX and its subgraph\nI will send Test USDT (0x3c099E287eC71b4AA61A7110287D715389329237) to your address",
        "comments_details": [
            {
                "author": "pavel",
                "comment": "Hi Everyone, we launched the Hype Test DEX. If you need test tokens, please drop your wallet and I’ll send some to you.\nhype-test-dex.metis.io\nHype Test DEX\nHype Test DEX\nMore information about dev resources, including the subgraph for this DEX can be found here:\nMetis Docs\nTest DEX | Metis Docs\nLearn how to use the Test DEX and its subgraph\nI will send Test USDT (0x3c099E287eC71b4AA61A7110287D715389329237) to your address"
            },
            {
                "author": "t9fiction",
                "comment": "0x8ef123b0bCC118e522Fd202d11d691b88F38F312"
            },
            {
                "author": "priyankg3",
                "comment": "Sending now\n0x1da949F6e892FC88184645cf46522AABC0510cFd"
            },
            {
                "author": "4ngel",
                "comment": "0x30ddc7b142d23c57ec2764cd4d28c5ca2338d260\nCan’t wait to test thanks"
            },
            {
                "author": "spxctr00m",
                "comment": "0x3f79824989897Fb20b24ee4373041dE5dc9885eE\nThanks"
            },
            {
                "author": "abhiraj2404",
                "comment": "0x88beE8eb691FFAFB192BAC4D1E7042e1b44c3eF2"
            },
            {
                "author": "huudangdx",
                "comment": "0x583B5b69416a53dEdfd45c6c3486c40fce70dED6"
            },
            {
                "author": "yano",
                "comment": "0x7d5E9Fc2D79ed404fbfDe64f93b199cFCC1bB3c1"
            },
            {
                "author": "trungkien1992",
                "comment": "0xED217008de92D861b6990381abc9c6C27822B34A\nThank you ser."
            },
            {
                "author": "touhonoob",
                "comment": "0xde65B8A93BC23c4b4186868014759632F2D288Ef"
            },
            {
                "author": "aeither",
                "comment": "0xa830cd34d83c10ba3a8bb2f25ff8bbae9bcd0125"
            },
            {
                "author": "JustineDevs",
                "comment": "This post was flagged by the community and is temporarily hidden."
            }
        ]
    },
    {
        "id": "ce9f0992b15ea84f",
        "topic_id": "5752",
        "title": "How Can We Boost Community Engagement in Hyperion’s Marketing?",
        "url": "https://forum.ceg.vote/t/how-can-we-boost-community-engagement-in-hyperion-s-marketing/5752",
        "views": "",
        "comments": "16",
        "created_date": "Jun 16, 2025 10:09 am",
        "latest_activity": "Jun 28, 2025 9:03 pm",
        "content": "Hi everyone,\nI’ve been thinking about marketing ideas to help grow the Hyperion ecosystem. What do you think are the most effective ways to increase community engagement? In areas like social media, content creation, events, or reward systems, what approaches could work best?\nAlso, how could we make community contributions more visible and rewarding-through badges, point systems, campaigns, or similar?\nI’d love to hear your thoughts and experiences if you’re willing to share!",
        "comments_details": [
            {
                "author": "han",
                "comment": "Hi everyone,\nI’ve been thinking about marketing ideas to help grow the Hyperion ecosystem. What do you think are the most effective ways to increase community engagement? In areas like social media, content creation, events, or reward systems, what approaches could work best?\nAlso, how could we make community contributions more visible and rewarding-through badges, point systems, campaigns, or similar?\nI’d love to hear your thoughts and experiences if you’re willing to share!"
            },
            {
                "author": "Norbert",
                "comment": "Good topic. A few practical ways we can grow engagement and visibility in my opinion, which we are doing already at Metis:\n• Short-form builder stories (Vibe sessions). Builders connect with people, not just product updates but get live questions and Answer sessions with Metis Devrel and community\n• One thing i would love to see and working on it to make it happen is to run weekly digests or highlights from the forum. So we have some overview of what is happening on major areas\n• Recognize effort, not noise. Badges and points should reflect real value, not post count. Curated community highlights help. Weekly or bi-weekly digests showcasing forum posts, guild updates, or active contributors can go a long way.\nIf we want this to scale, the system has to be simple and that’s what Hyperion Forum is about, consistent, and fairness are key.\nLet me know what you think"
            },
            {
                "author": "Geographer",
                "comment": "Hi everyone!\nGreat topic—growing the Hyperion ecosystem will depend heavily on how engaged and motivated the community feels. Here are a few ideas I believe could make a real difference:\nSocial Media & Content Creation\n#BuiltOnHyperion Campaigns: Encourage devs and creators to share what they’ve built, with visuals or demo videos—could even turn into a recurring series.\nCreator Grants or Bounties for blog posts, tutorials, or videos explaining how to use parts of the Hyperion stack.\nShort-form video contests explaining Hyperion concepts in <60 seconds (e.g., reels, TikToks).\nEvents & Interactive Engagement\nHyperion Town Halls or Office Hours: Monthly check-ins with the team or contributors to align on priorities and share updates.\nThemed Community Weeks: For example, “Infrastructure Week” or “Gaming on Hyperion Week,” where focused discussions, demos, and content happen.\nBuild & Earn hackathons (virtual or local) that encourage people to create tools, apps, or content.\nRewards, Recognition & Incentives\nHyperion XP System: Points for meaningful contributions (support, content, feedback, dev work), leading to levels, roles, and perks.\nDynamic badges/NFTs for community achievements—like “Validator,” “Early Supporter,” “Community Helper,” etc.\nLeaderboard Dashboards to publicly celebrate top contributors across categories.\nCampaign Ideas\n“Help Build the Hyperion Wiki”: Incentivize community-led documentation, FAQs, or beginner guides.\nMonthly Contribution Challenges: e.g. “Write a guide,” “Translate docs,” or “Answer 10 questions on Discord.”\nOverall, the more visible and valued contributions feel, the more people will want to get involved. Hyperion already has a strong tech foundation—now it’s about building a passionate, collaborative culture on top of it.\nWould love to hear if others have tried systems like these—or have totally different approaches!"
            },
            {
                "author": "han",
                "comment": "Well said. Signal over noise, stories over stats and consistency is the real growth hack. Fully aligned."
            },
            {
                "author": "4ngel",
                "comment": "More of “vitalik’s mom” less of “Web3 complicated language” haha JK ! I personnaly think devs and marketers should work together to simplfiy all the metis hyperion complicated stuff and give an insight on what’s the futur of Metis and hyperion will be in simple words"
            },
            {
                "author": "Elenaisplaying",
                "comment": "Love this initiative — growing the Hyperion community will need more than just awareness, it needs belonging.\nOne thing that could really work is a layered content strategy:\nUse public platforms (X, Farcaster) to spark interest\nThen funnel into interactive spaces like the Hyperion Forum or gated Discord channels for deeper engagement\nFor visibility and motivation, a community contribution score could be effective, combining things like:\nForum activity\nEducational content creation (threads, videos, translations)\nParticipation in testing or feedback\nEvent attendance or hosting\nGamify it with seasonal campaigns and onchain badges, even better if these unlock real perks like early access or governance rights."
            },
            {
                "author": "Ameliadupontttm",
                "comment": "han:\nHi everyone,\nI’ve been thinking about marketing ideas to help grow the Hyperion ecosystem. What do you think are the most effective ways to increase community engagement? In areas like social media, content creation, events, or reward systems, what approaches could work best?\nAlso, how could we make community contributions more visible and rewarding-through badges, point systems, campaigns, or similar?\nI’d love to hear your thoughts and experiences if you’re willing to share!\nGreat question! I think starting with small but fun reward systems (like badges or point leaderboards) always helps to motivate early contributors. Also, meme contests or short-form video campaigns on X/TG could really help bring more organic buzz to Hyperion"
            },
            {
                "author": "Harley",
                "comment": "Signal over noise. Stories > stats. Consistency wins."
            },
            {
                "author": "Lucie3",
                "comment": "Some quick ideas to boost Hyperion engagement:\n– Gamify testnet tasks with XP, levels, and titles (on-chain or off-chain)\n– Spotlight builders weekly — tweets, memes, even WIP posts\n– Use meme formats to highlight key testnet milestones\n– Run low-lift quests (e.g. “Deploy + Tweet” mini-sprints)\n– Reward insightful feedback , not just high volume\n– Tie it back to Metis’ sequencer vision so people know “why” it matters\nHyperion = not just test infra. It’s the launchpad for real L2 contributors."
            },
            {
                "author": "han",
                "comment": "Haha totally agree! Simplifying things doesn’t mean dumbing them down-it means opening the door for more people to actually get it. Devs and marketers teaming up sounds like the perfect recipe for clarity, especially with something as powerful (and complex) as Metis + Hyperion."
            },
            {
                "author": "han",
                "comment": "These are ideas love how they blend fun with purpose. Gamifying tasks + highlighting real builders makes it feel alive, not just like another testnet. And tying it all back to Metis’ sequencer vision? That’s the kind of context people need to stay invested. Hyperion should feel like a movement, not a checklist."
            },
            {
                "author": "han",
                "comment": "Absolutely. Stories create connection, stats just support them. In a noisy space like Web3, clear signals and consistent storytelling are what actually stick."
            },
            {
                "author": "han",
                "comment": "Small rewards + creative formats like memes or short vids are perfect for sparking early momentum and community buzz."
            },
            {
                "author": "han",
                "comment": "Love the depth here totally aligned. Awareness gets people in the door, but belonging keeps them around. Layered content + meaningful contribution tracking = a community that feels seen and empowered. Onchain perks tied to real effort? That’s the future."
            },
            {
                "author": "Norbert",
                "comment": "Well, i would say we shouldn’t fully ignore stats😅. As long as everything blockchain happens “onchain” we need to make sure the stories at least match the stats, else we will have noise with ghost towns"
            },
            {
                "author": "MK-Quen",
                "comment": "I believe that not only selling your project but have a genuine approach to your community will increase the engagement"
            },
            {
                "author": "Ghostt",
                "comment": "For a minuite you sound like\n@i_am_supaman_lj\nproof of play/contribution . I think if he is here he will give a good way to tackle this."
            }
        ]
    },
    {
        "id": "d7bc733437b1653e",
        "topic_id": "5924",
        "title": "How to Align Product, Marketing, and Sales Without Silos",
        "url": "https://forum.ceg.vote/t/how-to-align-product-marketing-and-sales-without-silos/5924",
        "views": "",
        "comments": "3",
        "created_date": "Jun 23, 2025 6:26 pm",
        "latest_activity": "Jun 28, 2025 10:40 am",
        "content": "The silos usually happen because each team is chasing slightly different definitions of “traction.” Product wants usage, marketing wants engagement, sales wants conversions—but they’re often pulling from the same story. The fix isn’t more meetings; it’s tighter feedback loops and shared language.\nStarter Tips\nStart by anchoring all three teams around a customer journey they co-define. Not a handoff from marketing to sales to product, but a cycle: what marketing learns fuels sales, what sales hears informs product, and what product builds becomes new ammo for marketing, or in crypto’s case, the reverse.\nReverse Starter Tips\nWe in crypto often find ourselves focusing on the product, while marketing focuses on narrative. Remember, it’s not just your functional team that’s a team - the whole company is a team! Ensure that sales passes on what marketing messages are working or not, ensure that marketing gives insight on product design, and ensure product guides and educates sales on its capabilities.\nMisc. Tips\nIt also helps to treat content like connective tissue. Case studies, demos, pain point narratives—they shouldn’t live in separate decks. If everyone’s using the same assets (or even better, co-creating them), alignment becomes muscle memory, not a calendar event.\nSilos form when teams protect their turf. Alignment happens when they share wins—and speak the same language about the customer’s world.",
        "comments_details": [
            {
                "author": "Daniel_K",
                "comment": "The silos usually happen because each team is chasing slightly different definitions of “traction.” Product wants usage, marketing wants engagement, sales wants conversions—but they’re often pulling from the same story. The fix isn’t more meetings; it’s tighter feedback loops and shared language.\nStarter Tips\nStart by anchoring all three teams around a customer journey they co-define. Not a handoff from marketing to sales to product, but a cycle: what marketing learns fuels sales, what sales hears informs product, and what product builds becomes new ammo for marketing, or in crypto’s case, the reverse.\nReverse Starter Tips\nWe in crypto often find ourselves focusing on the product, while marketing focuses on narrative. Remember, it’s not just your functional team that’s a team - the whole company is a team! Ensure that sales passes on what marketing messages are working or not, ensure that marketing gives insight on product design, and ensure product guides and educates sales on its capabilities.\nMisc. Tips\nIt also helps to treat content like connective tissue. Case studies, demos, pain point narratives—they shouldn’t live in separate decks. If everyone’s using the same assets (or even better, co-creating them), alignment becomes muscle memory, not a calendar event.\nSilos form when teams protect their turf. Alignment happens when they share wins—and speak the same language about the customer’s world."
            },
            {
                "author": "han",
                "comment": "Great insights! How do you foster that shared language and real-time feedback in remote or distributed crypto teams?"
            },
            {
                "author": "Norbert",
                "comment": "This is one of the most practical takes on cross-team alignment I’ve seen. Silos shrink fast when teams co-own the customer journey and build from the same truth, not separate KPIs."
            },
            {
                "author": "Rosita",
                "comment": "love the idea of content as connective tissue. Co-creating assets like case studies or demo scripts helps build real alignment, not just better materials."
            }
        ]
    },
    {
        "id": "03df884f7ef57e01",
        "topic_id": "5649",
        "title": "Dogex: Simplified Decentralized Perpetuals DEX on Hyperion",
        "url": "https://forum.ceg.vote/t/dogex-simplified-decentralized-perpetuals-dex-on-hyperion/5649",
        "views": "",
        "comments": "18",
        "created_date": "Jun 14, 2025 6:42 pm",
        "latest_activity": "Jun 28, 2025 9:51 am",
        "content": "Project Name\nDogex: Simplified Decentralized Perpetuals DEX on Hyperion\nProblem Statement\nMost decentralized perpetual exchanges are complicated and overwhelming, with dense interfaces and confusing features that deter new and retail traders. This complexity blocks broader adoption of perpetual trading in DeFi.\nSolution Overview\nDogex is a minimalist, easy-to-use perpetual DEX built on Hyperion’s cutting-edge blockchain platform. Leveraging Hyperion’s parallel transaction execution and onchain AI capabilities, Dogex offers ultra-fast, reliable trade processing and intelligent risk management. The platform’s simple UI and AI-driven alerts make perpetual trading accessible and straightforward for everyone.\nProject Description\nDogex delivers a decentralized perpetual futures exchange optimized for simplicity, speed, and scalability by building on Hyperion’s next-gen infrastructure. Hyperion’s parallelized transactions enable ultra-low latency order execution and state synchronization 10x faster than traditional chains. Integrated onchain AI powers real-time risk assessment and liquidation alerts, helping users manage positions confidently without complexity. Dogex’s clean, intuitive interface focuses on essential features like one-click position entry/exit, clear margin info, and fast updates. Mobile-friendly and designed for all user levels, Dogex breaks down barriers to perpetual trading by combining powerful Hyperion tech with a smooth, easy experience.\nCommunity Engagement Features\nFair Launch Token Model:\nUsers can buy Dogex tokens only by spending fees accrued on the platform\nToken issuance follows an infinite curve model similar to GMX and Solana projects, ensuring fair and gradual distribution\nThis model aligns incentives and rewards active traders who contribute to platform liquidity and usage\nTestable Features:\nOpening and closing positions\nMargin adjustments\nAI-powered risk alerts\nReward claiming\nPoints System:\nTrades: 10 points\nAI alert interaction: 5 points\nMargin changes: 7 points\nReferrals: 15 points\nGamification:\nPoints unlock badges, leaderboard rankings, and token rewards\nEncourages active use and onboarding\nUser Onboarding:\nStepwise tutorials and gradual feature unlocking\nHelps new traders quickly gain confidence",
        "comments_details": [
            {
                "author": "mrwagmicto",
                "comment": "Project Name\nDogex: Simplified Decentralized Perpetuals DEX on Hyperion\nProblem Statement\nMost decentralized perpetual exchanges are complicated and overwhelming, with dense interfaces and confusing features that deter new and retail traders. This complexity blocks broader adoption of perpetual trading in DeFi.\nSolution Overview\nDogex is a minimalist, easy-to-use perpetual DEX built on Hyperion’s cutting-edge blockchain platform. Leveraging Hyperion’s parallel transaction execution and onchain AI capabilities, Dogex offers ultra-fast, reliable trade processing and intelligent risk management. The platform’s simple UI and AI-driven alerts make perpetual trading accessible and straightforward for everyone.\nProject Description\nDogex delivers a decentralized perpetual futures exchange optimized for simplicity, speed, and scalability by building on Hyperion’s next-gen infrastructure. Hyperion’s parallelized transactions enable ultra-low latency order execution and state synchronization 10x faster than traditional chains. Integrated onchain AI powers real-time risk assessment and liquidation alerts, helping users manage positions confidently without complexity. Dogex’s clean, intuitive interface focuses on essential features like one-click position entry/exit, clear margin info, and fast updates. Mobile-friendly and designed for all user levels, Dogex breaks down barriers to perpetual trading by combining powerful Hyperion tech with a smooth, easy experience.\nCommunity Engagement Features\nFair Launch Token Model:\nUsers can buy Dogex tokens only by spending fees accrued on the platform\nToken issuance follows an infinite curve model similar to GMX and Solana projects, ensuring fair and gradual distribution\nThis model aligns incentives and rewards active traders who contribute to platform liquidity and usage\nTestable Features:\nOpening and closing positions\nMargin adjustments\nAI-powered risk alerts\nReward claiming\nPoints System:\nTrades: 10 points\nAI alert interaction: 5 points\nMargin changes: 7 points\nReferrals: 15 points\nGamification:\nPoints unlock badges, leaderboard rankings, and token rewards\nEncourages active use and onboarding\nUser Onboarding:\nStepwise tutorials and gradual feature unlocking\nHelps new traders quickly gain confidence"
            },
            {
                "author": "han",
                "comment": "This is a very exciting initiative and looks incredibly user-friendly!\nAs a potential user, my question is:\nDogex’s simplicity is a huge plus, especially for newcomers. But with perpetuals, managing risk is key. How does the AI-powered alert system work in real-time during volatile market conditions?\nCan users customize these alerts based on their risk appetite (e.g., liquidation thresholds or price movements), and are there safeguards in place to avoid spammy or overly sensitive notifications?"
            },
            {
                "author": "priyankg3",
                "comment": "hello\n@mrwagmicto\n, What specific UI/UX decisions did you take to make Dogex more beginner-friendly compared to existing perpetual DEXs?\nHow does Dogex handle liquidation risk in volatile market conditions—especially during sharp spikes or network congestion?"
            },
            {
                "author": "mrwagmicto",
                "comment": "Real-Time AI Alerts: Dogex monitors market volatility and your positions 24/7, sending smart alerts for risks like liquidation, big price swings, or funding changes. Like monitor it once per second or smth, I tihnk it couldn’t be super real time\nFully Customizable & Spam-Free: Users set their own alert rules (e.g. price % moves, margin levels), with built-in safeguards to avoid spammy or repetitive notifications."
            },
            {
                "author": "han",
                "comment": "Sounds useful if tuned well real-time is ambitious, but even near real-time with smart filters could make a big difference. Curious to see how accurate and non-spammy it stays in practice."
            },
            {
                "author": "mrwagmicto",
                "comment": "1. Beginner-Friendly UI/UX Decisions:\n1-click Trading Mode: Simplified interface with no clutter — just set size and direction.\nVisual Risk Meter: Real-time margin health bar with color-coded alerts makes liquidation risk easy to understand.\n2. Liquidation Risk Management During Volatility:\nAI-Powered Risk Alerts: Real-time monitoring of price + position risk, with early warnings before liquidation zones.\nAuto-Deleveraging Logic: If network congestion hits, Dogex can auto-partially close risky positions to protect users."
            },
            {
                "author": "mrwagmicto",
                "comment": "Yeah, in theory it all sounds great, but we need some real, practical results to see how it actually works with live positions"
            },
            {
                "author": "han",
                "comment": "Exactly, theory’s solid, but live stress tests will show if it holds up. Let’s see how it performs under real market pressure."
            },
            {
                "author": "priyankg3",
                "comment": "Appreciate the detailed breakdown! The 1-click trading and visual risk meter definitely feel like a huge win for onboarding.\nKeen to try it out in a live market soon!"
            },
            {
                "author": "mrwagmicto",
                "comment": "update: we create a prototype with components structure. Now it’s a base point of our project:\nmiro.com\nSprint Planning\nworing on details rn"
            },
            {
                "author": "mrwagmicto",
                "comment": "miro.com\nSprint Planning\nupdated wireframe with details, it’s time to start a vibe codding!"
            },
            {
                "author": "CrisMetis",
                "comment": "Cool idea, and a DEX that uses the speed of Hyperion to build something better is obviously a great move. Why should trading be complicated when tech like AI and Hyperion can make it smooth, right???"
            },
            {
                "author": "mrwagmicto",
                "comment": "yeah it can be much easier then we used to see"
            },
            {
                "author": "mrwagmicto",
                "comment": "Today I dove into the perpetual DEX market.\nIt’s my first time building a perp DEX — but with 10 years in dev, I was able to make a few important decisions.\nThe foundation of my project will be based on GMX, a battle-tested perp protocol with open-source MIT-licensed contracts.\nWhy?\nReliable\nOpen\nProven\nFlexible\nI’m not affiliated with GMX. I’m simply leveraging their codebase as a solid technical base — and improving it with a much better interface + product vision.\nThis is the power of open source.\nI also sketched the first simple mockup of the UI — just a few blocks for now. The MVP will be laser-focused on clarity and simplicity."
            },
            {
                "author": "priyankg3",
                "comment": "Will wait for the first look for UI of DEX"
            },
            {
                "author": "mrwagmicto",
                "comment": "Today, I focused on the technical side of the project. I think over the next few days (or even weeks), I’ll mostly be coding — and also trying to learn how to clearly communicate what I’ve been working on.\nI launched the frontend of GMX and played with it, sketched out its future architecture, explored what I’ll need to implement it, and created an implementation plan."
            },
            {
                "author": "mrwagmicto",
                "comment": "Today I focused on technical research:\nRevisited GMX contracts\nStudied the basics of perpetual futures trading to better understand the market side\nExperimented with opening positions\nI also launched the first mini-marketing effort to start building the initial community:\nCreated a Twitter for Dogex, and started looking for marketers to help grow the first community."
            },
            {
                "author": "mrwagmicto",
                "comment": "project’s twitter: https://x.com/DogexPerps\nceo: https://x.com/mr_wagmi_cto\nfeel free to subsribe and mention that you’re from Hyperion some way I wanna subscribe all projects and ceos"
            },
            {
                "author": "mrwagmicto",
                "comment": "Today I’m diving deep into GMX v1 vs v2 to decide what’s better for my MVP.\nMy key criteria (in order of priority):\nReliability\nEase of dev & fast iteration\nFlexibility for custom logic\nFull understanding of the codebase\nThis first version must be simple, fast & clear. Let’s go"
            }
        ]
    },
    {
        "id": "065a7cd24b767b99",
        "topic_id": "5233",
        "title": "BOLTIS - Real Time Decentralized Card Battle",
        "url": "https://forum.ceg.vote/t/boltis-real-time-decentralized-card-battle/5233",
        "views": "",
        "comments": "8",
        "created_date": "Jun 4, 2025 1:08 pm",
        "latest_activity": "Jun 28, 2025 9:08 am",
        "content": "Project Name\nBOLTIS - Real Time Decentralized Card Battle\nProblem Statement\nTraditional mobile card games like Uno suffer from fundamental transparency issues - players cannot verify if games are rigged or fair due to closed-source, centralized systems. Additionally, these games are platform-locked (Uno mobile only works on mobile devices) and require downloads, installations, and updates that create accessibility barriers. Meanwhile, existing “GameFi” projects claiming to be on-chain still rely on off-chain servers for actual multiplayer gameplay, only tokenizing surface-level assets as NFTs. Current fully on-chain games sacrifice real-time responsiveness, creating frustrating delays that break the flow of competitive card gaming.\nSolution Overview\nBOLTIS delivers the first truly decentralized, real-time multiplayer card game that maintains competitive speed through METIS blockchain’s HYPERION rollup technology. Unlike traditional mobile games that are platform-locked and require installations, BOLTIS runs instantly in any browser on any device - desktop, mobile, tablet - without downloads or updates. Every move is transparently verifiable on-chain, eliminating concerns about rigged gameplay. Unlike other GameFi projects, the entire game logic runs on-chain with 250ms response times, proving that decentralized gaming can match centralized performance while being universally accessible.\nProject Description\nBOLTIS revolutionizes card gaming by solving trust, performance, and accessibility issues plaguing both traditional and blockchain games. Unlike Uno mobile games locked to mobile platforms with unverifiable shuffles, BOLTIS works on any device with instant browser access and every action cryptographically verified on-chain.\nUsing Three.js runtime engine, players instantly jump into decentralized multiplayer matches from desktop, mobile, or tablet without downloads. The METIS HYPERION rollup executes complete game logic on-chain with 250ms response times, proving true decentralization doesn’t sacrifice performance.\nUnlike GameFi projects that only tokenize assets while running gameplay on centralized servers, BOLTIS runs everything on-chain - ensuring transparent, provably fair competition. Players engage in fast-paced, skill-intensive card battles requiring quick thinking and strategy.\nWhat excites us most is creating the first truly trustless card gaming experience more accessible than traditional mobile games. Players compete from anywhere, knowing every move is cryptographically guaranteed fair. This combination of proven fairness, universal accessibility, and addictive gameplay creates unprecedented gaming where skill determines victory, not platform limitations or hidden algorithms.\nCommunity Engagement Features\nTestable Features & Gamification:\nQuick Match (10 pts): Complete a match under 5 minutes\nTutorial Completion (25 pts): Finish skill-based tutorial\nToken Staking (50 pts): Participate in competitive room match\nCross-Device Play (30 pts): Play same account on mobile and desktop\nWin Streak (75 pts): Win 3 consecutive matches\nTransparency Check (40 pts): Verify on-chain moves via block explorer\nPerformance Test (35 pts): Document HYPERION response times\nPoints unlock exclusive card designs, tournament access, and beta rankings with potential token rewards.\nGetting Involved\nJoin the BOLTIS Community:\nAlpha Testing: Sign up for early access at our team discord Theras Labs, we won multiple cross-chain game previously and continue to build, and now we intend to build card-game to test core gameplay and provide feedback. This game also will be open in discord game section beside within our website\nDiscord Community: Join our active Discord server for real-time discussions, strategy sharing, and direct developer interaction\nDeveloper Contributions: Submit pull requests for open-source components, particularly Three.js optimizations and blockchain integration improvements\nContent Creation: Help create tutorials, strategy guides, or promotional content for community rewards\nTournament Organization: Experienced players can organize community tournaments and events\nFeedback & Testing: Participate in weekly testing sessions and help refine game balance through structured feedback sessions\nContact: Reach out via Discord Theras Labs , TG @theraslabs , or X-Twitter https://x.com/theras_labs or email contact@theras.xyz for specific contribution interests.",
        "comments_details": [
            {
                "author": "0xdellwatson",
                "comment": "Project Name\nBOLTIS - Real Time Decentralized Card Battle\nProblem Statement\nTraditional mobile card games like Uno suffer from fundamental transparency issues - players cannot verify if games are rigged or fair due to closed-source, centralized systems. Additionally, these games are platform-locked (Uno mobile only works on mobile devices) and require downloads, installations, and updates that create accessibility barriers. Meanwhile, existing “GameFi” projects claiming to be on-chain still rely on off-chain servers for actual multiplayer gameplay, only tokenizing surface-level assets as NFTs. Current fully on-chain games sacrifice real-time responsiveness, creating frustrating delays that break the flow of competitive card gaming.\nSolution Overview\nBOLTIS delivers the first truly decentralized, real-time multiplayer card game that maintains competitive speed through METIS blockchain’s HYPERION rollup technology. Unlike traditional mobile games that are platform-locked and require installations, BOLTIS runs instantly in any browser on any device - desktop, mobile, tablet - without downloads or updates. Every move is transparently verifiable on-chain, eliminating concerns about rigged gameplay. Unlike other GameFi projects, the entire game logic runs on-chain with 250ms response times, proving that decentralized gaming can match centralized performance while being universally accessible.\nProject Description\nBOLTIS revolutionizes card gaming by solving trust, performance, and accessibility issues plaguing both traditional and blockchain games. Unlike Uno mobile games locked to mobile platforms with unverifiable shuffles, BOLTIS works on any device with instant browser access and every action cryptographically verified on-chain.\nUsing Three.js runtime engine, players instantly jump into decentralized multiplayer matches from desktop, mobile, or tablet without downloads. The METIS HYPERION rollup executes complete game logic on-chain with 250ms response times, proving true decentralization doesn’t sacrifice performance.\nUnlike GameFi projects that only tokenize assets while running gameplay on centralized servers, BOLTIS runs everything on-chain - ensuring transparent, provably fair competition. Players engage in fast-paced, skill-intensive card battles requiring quick thinking and strategy.\nWhat excites us most is creating the first truly trustless card gaming experience more accessible than traditional mobile games. Players compete from anywhere, knowing every move is cryptographically guaranteed fair. This combination of proven fairness, universal accessibility, and addictive gameplay creates unprecedented gaming where skill determines victory, not platform limitations or hidden algorithms.\nCommunity Engagement Features\nTestable Features & Gamification:\nQuick Match (10 pts): Complete a match under 5 minutes\nTutorial Completion (25 pts): Finish skill-based tutorial\nToken Staking (50 pts): Participate in competitive room match\nCross-Device Play (30 pts): Play same account on mobile and desktop\nWin Streak (75 pts): Win 3 consecutive matches\nTransparency Check (40 pts): Verify on-chain moves via block explorer\nPerformance Test (35 pts): Document HYPERION response times\nPoints unlock exclusive card designs, tournament access, and beta rankings with potential token rewards.\nGetting Involved\nJoin the BOLTIS Community:\nAlpha Testing: Sign up for early access at our team discord Theras Labs, we won multiple cross-chain game previously and continue to build, and now we intend to build card-game to test core gameplay and provide feedback. This game also will be open in discord game section beside within our website\nDiscord Community: Join our active Discord server for real-time discussions, strategy sharing, and direct developer interaction\nDeveloper Contributions: Submit pull requests for open-source components, particularly Three.js optimizations and blockchain integration improvements\nContent Creation: Help create tutorials, strategy guides, or promotional content for community rewards\nTournament Organization: Experienced players can organize community tournaments and events\nFeedback & Testing: Participate in weekly testing sessions and help refine game balance through structured feedback sessions\nContact: Reach out via Discord Theras Labs , TG @theraslabs , or X-Twitter https://x.com/theras_labs or email contact@theras.xyz for specific contribution interests."
            },
            {
                "author": "zuzuzu",
                "comment": "what an interesting game .. i have few question for the game\nHow fast is the gameplay if everything runs on-chain?\nWhat kind of rewards can players earn through the gamified point system?\nHow can I join the alpha test or get involved with the community?"
            },
            {
                "author": "0xdellwatson",
                "comment": "It is using Hyperion, L2 Metis, and can roughly do 250ms per txs, which is enough for a card game or turn-based player. I have made a game with Ephemeral Rollup on another blockchain with 10ms txs for Third person mmo game, and you can find it on my Twitter account. So this time, I’m making card game battle which is addictive as well.\nPlayers earn token rewards, which they will use to compete back into the game. If you know the Uno Mobile game, it would be similar, and players with a lower amount of tokens will compete in different leagues. The gamified system is normal because this is a game where earning points through activities, leaderboards, etc. is a default feature for a game.\nAnyone can join directly through the browser, as it’s a browser game with WebGPU. There’s no need for installation, and fast load render on website, so you can open it immediately. The dev team can provide quick updates to due to the nature of browser development. Unlike other games built on engines such as Unity, they need to bake it into the application, so every iteration update is also overwhelming to make it a public update and involve the community even if it’s unity-browser game."
            },
            {
                "author": "0xdellwatson",
                "comment": "Testing for card gameplay, this will be a 3D game in the browser. Although I have built other 3D MMO-platformers in the browser, the game doesn’t need to be at the AAA level to be addictive.\nUno Mobile has proven that a simple multiplayer card battle can be engaging for hours.\nI’ve created a new type of board game. This game will have element-based battles (currently starting with 3-5 basic elements: fire, water, plant, thunder, ground). I’m looking for feedback on the card battle idea, which should be ready by the end of June if the idea is still approved.\nSneakpeak of simple visual 3D cards here."
            },
            {
                "author": "priyankg3",
                "comment": "Hello\n@0xdellwatson\n, How are you?\nIs the gameplay more like Uno, Poker, or something completely different?"
            },
            {
                "author": "0xdellwatson",
                "comment": "This is the dev-mode picture, no-animation, just pure functionality for debugging flow.\nYou will see the rules and can try the game immediately with a bot. I will provide the link soon after June 15th.\nIt’s already fun because it’s a new board-game idea. Previously the game idea was a bit different with joker’s card but now, the gameplay will almost be like Uno mobile.\nThere will be no +2 or +4 wild cards. Instead, there will be elemental and black hole cards. A skillful player must remember all the cards that have been drawn, as they will be re-used.\nAfter that, we will make it into a blockchain multiplayer game with HYPERION. I’m expecting to be done even before July, so everyone can immediately experience the HYPERION rollup.\nThen proceed to go mainnet before August. So everyone can compete with real token"
            },
            {
                "author": "0xdellwatson",
                "comment": "GM GM,\nThe frontend is ready for testing. All of you can access it at https://boltis.fun. Currently, you can play against bots and try to learn. Please provide your feedback.\nSoon, we will be testing on publishers like Crazy-Gamers first, and on Steam, the Play Store, and the App Store to acquire more testers and players with off-chain server multiplayer.\nIn July, we will be creating the smart contract game server with Hyperion, shifting the game server into a smart contract."
            },
            {
                "author": "0xdellwatson",
                "comment": "Ah, I also make it open-source here, everyone feel free to see the code and contribute too.\nThis is generated with bolt ai-prompt, around end of July. we will change it into 3D look for high-end devices with more vfx.\nWe are also submitted into bolt hackathon and here’s our submission.\nI’m really transparent about everything, and want to promote the growth of open-source here.\nI’m indeed develop this software card-game around June 2025. A new fresh innovation for game-card battle.\nSo feel free to give me your feedback as the game will be adjusted according to the community, to make it fully balanced and fun.\nI’m welcoming to anyone who wants to join the team Theras Labs Inc too.\nWe have other project, but this BOLTIS is solo innovated and built by me."
            },
            {
                "author": "groworpay",
                "comment": "The game looks fun, I will join via Discord on follow on Twitter"
            }
        ]
    },
    {
        "id": "e363ccef92a36838",
        "topic_id": "6018",
        "title": "Who Exactly Is the Web3 Audience and What Language Do They Speak?",
        "url": "https://forum.ceg.vote/t/who-exactly-is-the-web3-audience-and-what-language-do-they-speak/6018",
        "views": "",
        "comments": "0",
        "created_date": "Jun 28, 2025 7:41 am",
        "latest_activity": null,
        "content": "As Web3 marketers, it’s easy to fall into the trap of vague targeting referring to “crypto people” or “degens” as if they’re one homogenous group. But in reality, the Web3 landscape is a patchwork of micro-communities, subcultures, and personas, each with its own dialect, values, pain points, and platforms of choice.\nSo the real question is:\nWho are we actually speaking to and are we speaking their language?\nBreaking Down the Web3 Audience\nLet’s get specific. The Web3 space isn’t defined by demographics it’s defined by mindsets and behaviors. Here are a few distinct audience segments you might be talking to (often without realizing it):\nDeFi Maxis\nMindset: Risk-aware, analytical, often skeptical.\nLanguage: APYs, TVL, LPs, governance, “yield farming.”\nPlatforms: X (formerly Twitter), Discord, Dune dashboards.\nTone That Works: Straightforward, data-backed, sometimes meme-coded, but with substance.\nNFT Collectors & Creators\nMindset: Emotional, status-driven, early adopter mentality.\nLanguage: Minting, floor price, rarity, GM/ GN culture, “vibes.”\nPlatforms: X, Discord, Farcaster, Lens, and still some corners of Instagram.\nTone That Works: Visual, artistic, community-driven language. Aesthetic and narrative matter a lot here.\nBuilders & Devs\nMindset: Problem-solvers, technical, open to innovation.\nLanguage: Solidity, zk proofs, gas optimization, “EIP this, EVM that.”\nPlatforms: GitHub, StackOverflow, Dev-focused Discords, Hackathons.\nTone That Works: Precise, technical, no fluff. Show impact > vision.\nSpeculators & Airdrop Hunters\nMindset: ROI-focused, short-term interest, trend-sensitive.\nLanguage: WL, sybil resistance, snapshot, tokenomics, “wen token?”\nPlatforms: X, Telegram, Reddit, niche alpha groups.\nTone That Works: Direct, rewards-based messaging. Use urgency and clarity. Cut through the noise.\nWeb2-Curious Newcomers\nMindset: Curious but cautious. Needs education, not hype.\nLanguage: Simple analogies, real-world comparisons, fewer acronyms.\nPlatforms: YouTube, TikTok, Medium, more mainstream platforms.\nTone That Works: Friendly, explanatory, welcoming. Bridge-building is key.\nThe Language Layer: More Than Just Words\nIn Web3, language is layered. It’s not just what you say, it’s how you say it:\nMemes are a universal dialect. A single meme can carry cultural meaning, technical commentary, and inside jokes all at once. Ignore meme culture, and you miss 50% of the conversation.\nJargon is a filter. Used wisely, it signals competence. Overused, it repels everyone outside the echo chamber.\nTone = alignment. Web3 communities are hypersensitive to tone, come off too corporate, and you’ll lose the trust of grassroots believers. Come off too informal with devs, and you’ll get ignored.\nSo, Why Does This Matter for Marketers?\nBecause every campaign, every tweet, every brand voice needs to pass this test:\n“Do we know exactly who we’re talking to—and are we speaking in their native tongue?”\nMarketing in Web3 isn’t about broadcasting—it’s about embedding. You need to enter the right subculture, speak its language, and contribute value before expecting attention or conversion.\nOpen Questions to the Guild\nHow do you define your Web3 audience ?\nWhat tools or signals help you understand how they actually speak?\nHave you ever gotten the language or tone completely wrong?\nWhat did you learn from it?\nLet’s talk about it. Because until we define the “Who” and learn their language, we’re just marketing into the void.",
        "comments_details": [
            {
                "author": "Ghostt",
                "comment": "As Web3 marketers, it’s easy to fall into the trap of vague targeting referring to “crypto people” or “degens” as if they’re one homogenous group. But in reality, the Web3 landscape is a patchwork of micro-communities, subcultures, and personas, each with its own dialect, values, pain points, and platforms of choice.\nSo the real question is:\nWho are we actually speaking to and are we speaking their language?\nBreaking Down the Web3 Audience\nLet’s get specific. The Web3 space isn’t defined by demographics it’s defined by mindsets and behaviors. Here are a few distinct audience segments you might be talking to (often without realizing it):\nDeFi Maxis\nMindset: Risk-aware, analytical, often skeptical.\nLanguage: APYs, TVL, LPs, governance, “yield farming.”\nPlatforms: X (formerly Twitter), Discord, Dune dashboards.\nTone That Works: Straightforward, data-backed, sometimes meme-coded, but with substance.\nNFT Collectors & Creators\nMindset: Emotional, status-driven, early adopter mentality.\nLanguage: Minting, floor price, rarity, GM/ GN culture, “vibes.”\nPlatforms: X, Discord, Farcaster, Lens, and still some corners of Instagram.\nTone That Works: Visual, artistic, community-driven language. Aesthetic and narrative matter a lot here.\nBuilders & Devs\nMindset: Problem-solvers, technical, open to innovation.\nLanguage: Solidity, zk proofs, gas optimization, “EIP this, EVM that.”\nPlatforms: GitHub, StackOverflow, Dev-focused Discords, Hackathons.\nTone That Works: Precise, technical, no fluff. Show impact > vision.\nSpeculators & Airdrop Hunters\nMindset: ROI-focused, short-term interest, trend-sensitive.\nLanguage: WL, sybil resistance, snapshot, tokenomics, “wen token?”\nPlatforms: X, Telegram, Reddit, niche alpha groups.\nTone That Works: Direct, rewards-based messaging. Use urgency and clarity. Cut through the noise.\nWeb2-Curious Newcomers\nMindset: Curious but cautious. Needs education, not hype.\nLanguage: Simple analogies, real-world comparisons, fewer acronyms.\nPlatforms: YouTube, TikTok, Medium, more mainstream platforms.\nTone That Works: Friendly, explanatory, welcoming. Bridge-building is key.\nThe Language Layer: More Than Just Words\nIn Web3, language is layered. It’s not just what you say, it’s how you say it:\nMemes are a universal dialect. A single meme can carry cultural meaning, technical commentary, and inside jokes all at once. Ignore meme culture, and you miss 50% of the conversation.\nJargon is a filter. Used wisely, it signals competence. Overused, it repels everyone outside the echo chamber.\nTone = alignment. Web3 communities are hypersensitive to tone, come off too corporate, and you’ll lose the trust of grassroots believers. Come off too informal with devs, and you’ll get ignored.\nSo, Why Does This Matter for Marketers?\nBecause every campaign, every tweet, every brand voice needs to pass this test:\n“Do we know exactly who we’re talking to—and are we speaking in their native tongue?”\nMarketing in Web3 isn’t about broadcasting—it’s about embedding. You need to enter the right subculture, speak its language, and contribute value before expecting attention or conversion.\nOpen Questions to the Guild\nHow do you define your Web3 audience ?\nWhat tools or signals help you understand how they actually speak?\nHave you ever gotten the language or tone completely wrong?\nWhat did you learn from it?\nLet’s talk about it. Because until we define the “Who” and learn their language, we’re just marketing into the void."
            }
        ]
    },
    {
        "id": "3d2686cc6b29fb13",
        "topic_id": "4217",
        "title": "Introductions",
        "url": "https://forum.ceg.vote/t/introductions/4217",
        "views": "",
        "comments": "10",
        "created_date": "May 19, 2025 10:23 am",
        "latest_activity": "Jun 28, 2025 7:40 am",
        "content": "Tell us something unforgettable – Tell us something about you\nWhat’s your story? What drives you?\nShare a bold experience, a wild idea, a unique skill, or a personal mission that makes you . Whether you’re a founder, a builder, a community catalyst, or just starting out – give us a glimpse into what makes you unforgettable.\nThis is your moment – stand out, inspire, and let the community know why you’re here and what you’re bringing to Metis.\nGot socials? Let’s connect!\nDrop your LinkedIn, Twitter (X), GitHub, or any other social profiles here so others can follow your journey, collaborate, or just say hi.",
        "comments_details": [
            {
                "author": "priyankg3",
                "comment": "Tell us something unforgettable – Tell us something about you\nWhat’s your story? What drives you?\nShare a bold experience, a wild idea, a unique skill, or a personal mission that makes you . Whether you’re a founder, a builder, a community catalyst, or just starting out – give us a glimpse into what makes you unforgettable.\nThis is your moment – stand out, inspire, and let the community know why you’re here and what you’re bringing to Metis.\nGot socials? Let’s connect!\nDrop your LinkedIn, Twitter (X), GitHub, or any other social profiles here so others can follow your journey, collaborate, or just say hi."
            },
            {
                "author": "Ransome",
                "comment": "Ayyooo GMMMM Hyperion family!\nMy name is Ransome and I’m a graphic designer/ content creator & video editor. I stumbled into Web3 in 2021 out of pure curiosity and eventually stayed because I saw how powerful it could be.\nI’m deep in the Metis ecosystem (been here for over 2 yrs), creating content, moderating communities, and breaking down complex DeFi concepts so that more people can actually get involved.\nWhat drives me is seeing people go from “nah I don’t get it” to “wait… now I do!” I do this through a twitter threads, articles, memes, or my “This is Matt” explainer videos (do check out: https://youtu.be/0MNAgT5A08E?si=PH9Jwrie6_7frHa4). I just love making crypto easier to grasp and more fun to explore.\nOne time, I made a meme about liquid staking that got more attention than I expected😂. It taught me that you don’t need a huge platform to make an impact. Just a clear message, hunger to learn more and some dawg in you.\nI’m not a founder (yet), but I’m here building in my own way… Through educating, creating, and uplifting. Metis feels like home because it’s a place where people like me creators, explorers—can grow and help others grow too.\nI’m here for the long game. To learn, to contribute, and to show others they can do the same.\nPS: Follow me on my socials here guys!\nLinktree\nRansome | Instagram, Facebook, TikTok | Linktree\nGraphic designer| Content Creator |video editor| Crypto Ambassador|"
            },
            {
                "author": "Keir",
                "comment": "I have an idea to create an AI powered price alert bot for the ecosystem, do you think i should submit?"
            },
            {
                "author": "arbilearn",
                "comment": "Hey\nWe’re team Arbilearn, we’re here to learn and grow\nWe’re looking to build a festiny the next gen app of sending decentralised messages during festivals as NFTs.\nThanks for your cooperation."
            },
            {
                "author": "cb99",
                "comment": "Gm gm, Metis fam! My Story & Why I’m All In\nI’m a crypto founder and marketing pro, hooked on amplifying game-changing Web3 projects. Marketing is my jam—crafting narratives that spark excitement—but I’m ready for a bigger adventure: building with Metis. Elena’s letter to the community on the Metis philosophy really stuck with me; it was the moment I knew Metis is my long-term home, where I can create real impact. I’m stoked to dive into HyperHack with my idea HyperHire, a decentralized gig marketplace using Hyperion’s AI and real-time tech to empower freelancers globally.\nYou can find me on X @__cb__x, I love connecting with new people who share the same passion!"
            },
            {
                "author": "ego1901",
                "comment": "I will try it as much as possible"
            },
            {
                "author": "eddiffied",
                "comment": "Hellooo there👋\nThe name is Eddie and I’m a seasoned content writer who loves to write and make things super easy to grasp especially for the newly onboarded users into crypto every day!!!\nI’ve not been really deep into the Metis ecosystem but I’d been following up until I stumbled on the Hyperion system and its amazing features and solutions it could provide at a go.\nNow I’m balls deep into Metis and happy to connect with new content creators and Devs as well.\nHere’s a thread I made on Hyperion:\nhttps://x.com/eddiffied/status/1918620725033710065?t=f04pEKPJAgRKGOe7yP09UA&s=19\nCheck it out and hit me a follow to get more updates"
            },
            {
                "author": "arbilearn",
                "comment": "Welcome eddiffied, Nice to meet you here"
            },
            {
                "author": "Aryanzutshi",
                "comment": "GMetis,\nI’m a Web3 security builder obsessed with the idea of AI, zero-knowledge, and on-chain execution. I’m currently developing Sentinel, a security suite on Metis focused on self-healing smart contracts, ZK-powered auditing agents, and MEV-resistant mempool infrastructure.\nWhat drives me?\nTurning Web3 into a secure infrastructure\nI’m also building tools to automate security, empower open-source auditors, and help devs ship with confidence.\nIf you’re building something amazing in security niche or in general, Do feel free to reach out to me by DM.\nConnect with me\nTwitter\nGitHub"
            },
            {
                "author": "uzochukwuV",
                "comment": "Hey ,\nMy name is Victor Ezealor, I am very intrigued with building scalable defi and rwa applications, I love to code , I love research and I love when what I build thrives in the ecosystem. I am currently building a cross chain yield aggregator and rebalancer on Android to bring decentralization more closer to it’s users.\nJust recently got into Metis, but I’m glad to meet you all and looking forward to building and collaborating the devs and creators\nReach out to me\nhttps://linkedin.com/in/visualise_crypto\nGitHub\nuzochukwuV - Overview\nI am a full stack web developer and I love what I do - uzochukwuV"
            },
            {
                "author": "priyankg3",
                "comment": "Hi everyone, I’m Priyank Gupta, I’ve been active in the crypto space since 2017 and have worked across various marketing roles including Ambassador, Regional Lead, Country Head, and CMO for multiple Web3 projects.\nI’m also the founder of CryptoSpartans, one of India’s largest Web3 communities on telegram, and have hosted over 100 AMAs and ecosystem events. I am also a founder of OTC (Global) and P2P Group (Specially for Indian ).\nCurrently, I’m also proud to serve as the Regional Lead for Metis India, helping expand its presence and adoption across the region.\nCurrently serving as the CMO at EduVerse , an AI-powered, blockchain-based education platform.\nAt EduVerse, my focus is on driving adoption through smart, user-focused marketing while merging AI and blockchain to make learning more transparent and personalized.\nExcited to connect, collaborate, and grow together!\nSocials : - https://x.com/CryptoJain\nLinkedin - https://www.linkedin.com/in/priyankg3/"
            }
        ]
    },
    {
        "id": "b708f5a552f6ed1b",
        "topic_id": "5995",
        "title": "Using Behavioral Data to Drive Creative Decisions",
        "url": "https://forum.ceg.vote/t/using-behavioral-data-to-drive-creative-decisions/5995",
        "views": "",
        "comments": "6",
        "created_date": "Jun 26, 2025 8:30 pm",
        "latest_activity": "Jun 28, 2025 7:25 am",
        "content": "Here I am again—coming in with another debatable topic\nUsing Behavioral Data to Drive Creative Decisions\nBecause good ideas are great—but data-backed creativity wins.\nLet’s be honest. As marketers and creatives, we all love that moment of inspiration—that late-night spark or the shower thought that turns into a full-blown campaign idea. But here’s the thing: in 2025, pure instinct just doesn’t cut it anymore. You need behavioral data to validate, tweak, and elevate your creative game.\nWhat Is Behavioral Data (and Why Should You Care?)\nBehavioral data is everything users do—clicks, scrolls, bounce rates, watch times, purchases, and even where their mouse lingers. This isn’t fluffy demographic stuff. It’s the actual trail people leave when they engage with your brand. And it tells you way more than any “ideal customer persona” ever will.\nExample:\nSay you’re running a YouTube campaign. Your video might be gorgeous, but if 70% of users drop off before the 20-second mark, the narrative pacing needs help. That’s data talking to your creativity.\nSo… What Can You Actually Do With It?\n1- Shape content format & style\nIf short-form videos get 2x the engagement on your channel, start scripting for 30 seconds instead of 2 minutes.\n2- Personalize with confidence\nBehavioral segments help you deliver the right creative to the right audience. Think Spotify Wrapped—but for every campaign.\n3- Test and iterate like a pro\nData doesn’t kill creativity—it refines it. Launch A/B tests on thumbnails, ad copy, or CTAs and let the winners guide your next creative sprint.\nA Quick Stat Check\n91% of marketing leaders use behavioral data (clicks, watch time, interaction signals) to segment ads and campaigns.\nResearch shows that personalization is a key driver of customers satisfaction and loyalty.\nTL;DR?\nYou don’t have to choose between creativity and data. You just need to listen to what the data is whispering. It’ll show you where your audience is paying attention, what’s making them click, and when to shift gears.\nAnd when your creative spark meets behavioral insight, you’re not just guessing, you’re designing for impact.",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "Here I am again—coming in with another debatable topic\nUsing Behavioral Data to Drive Creative Decisions\nBecause good ideas are great—but data-backed creativity wins.\nLet’s be honest. As marketers and creatives, we all love that moment of inspiration—that late-night spark or the shower thought that turns into a full-blown campaign idea. But here’s the thing: in 2025, pure instinct just doesn’t cut it anymore. You need behavioral data to validate, tweak, and elevate your creative game.\nWhat Is Behavioral Data (and Why Should You Care?)\nBehavioral data is everything users do—clicks, scrolls, bounce rates, watch times, purchases, and even where their mouse lingers. This isn’t fluffy demographic stuff. It’s the actual trail people leave when they engage with your brand. And it tells you way more than any “ideal customer persona” ever will.\nExample:\nSay you’re running a YouTube campaign. Your video might be gorgeous, but if 70% of users drop off before the 20-second mark, the narrative pacing needs help. That’s data talking to your creativity.\nSo… What Can You Actually Do With It?\n1- Shape content format & style\nIf short-form videos get 2x the engagement on your channel, start scripting for 30 seconds instead of 2 minutes.\n2- Personalize with confidence\nBehavioral segments help you deliver the right creative to the right audience. Think Spotify Wrapped—but for every campaign.\n3- Test and iterate like a pro\nData doesn’t kill creativity—it refines it. Launch A/B tests on thumbnails, ad copy, or CTAs and let the winners guide your next creative sprint.\nA Quick Stat Check\n91% of marketing leaders use behavioral data (clicks, watch time, interaction signals) to segment ads and campaigns.\nResearch shows that personalization is a key driver of customers satisfaction and loyalty.\nTL;DR?\nYou don’t have to choose between creativity and data. You just need to listen to what the data is whispering. It’ll show you where your audience is paying attention, what’s making them click, and when to shift gears.\nAnd when your creative spark meets behavioral insight, you’re not just guessing, you’re designing for impact."
            },
            {
                "author": "Harley",
                "comment": "Great ideas are valuable, but ideas that truly connect with users need behavioral data to lead the way"
            },
            {
                "author": "han",
                "comment": "How can data-driven creativity make your next campaign more effective?"
            },
            {
                "author": "Sheyda",
                "comment": "Exactly! the era of blind marketing has been ended. With AI arise in all horizones, setting a data driven strategy shouldnt be hard."
            },
            {
                "author": "han",
                "comment": "Absolutely intuition meets intelligence. Data-driven is the new default."
            },
            {
                "author": "priyankg3",
                "comment": "A reality check for a lot of us in marketing. But here’s something I’ve been thinking about: how much data is too much?\nWould love to hear how others balance creativity and performance, especially in early-stage campaigns where there’s not a ton of data to begin with."
            },
            {
                "author": "Ghostt",
                "comment": "This is a powerful post and I completely align with the value of behavioral data in refining creative direction. But I also think it’s worth acknowledging the reality of early-stage projects or awareness campaigns, where data is either limited or non-existent.\nIn those moments, creativity doesn’t just inspire, it leads. The marketer becomes the builder, shaping narratives, testing tones, and intuitively exploring how to meet the audience where they are often without much digital feedback at first. That ability to shift tempo, use language strategically, and feel the pulse of the message is what sets a great marketer apart before the data even arrives.\nOf course, once behavioral signals start rolling in, that’s when the refinement begins. I don’t see it as creativity versus data, but more like a vehicle (data) that still needs a driver (creativity) to go anywhere meaningful. It’s a symbiosis but one that always starts with a spark."
            }
        ]
    },
    {
        "id": "8a226a011b02abc3",
        "topic_id": "6015",
        "title": "StreamNFT- The Full Stack Platform for Asset Ownership & Utilities",
        "url": "https://forum.ceg.vote/t/streamnft-the-full-stack-platform-for-asset-ownership-utilities/6015",
        "views": "",
        "comments": "0",
        "created_date": "Jun 28, 2025 7:16 am",
        "latest_activity": null,
        "content": "Project Name\nStreamNFT\nProblem Statement\nBuilding asset-driven economies in Web3 games is overly complex and inefficient, developers must stitch together multiple tools just to enable core functionalities like trading, rentals, loans or utilities. Current asset standards also restrict cross-protocol usage, limiting the full potential of in-game assets. Meanwhile, players face high entry barriers and fragmented utility experiences, making it difficult to engage meaningfully with their gaming assets.\nSolution Overview\nStreamNFT is a full-stack platform that unifies trading, rentals, loans, and utility into a single plug-and-play hub for game developers. It simplifies the launch and scaling of in-game asset economies. Our asset standard supports cross-protocol usage, unlocking 2x more value and enabling composable utility. For players, StreamNFT offers a seamless interface to discover and interact with their in-game assets, lowering the barriers to Web3 gaming.\nProject Description\nStreamNFT is a full-stack, chain-agnostic platform designed to unlock the full potential of in-game assets and collectibles. At its core, StreamNFT offers plug-and-play modules for trading, rentals, loans, consumables, and real-time utility, all accessible through a unified interface for both developers and players.\nGame developers can launch, manage, and monetize digital asset economies without juggling multiple third-party tools. This includes setting up in-game marketplaces, enabling time-bound rentals, offering real-time perks (e.g., XP boosts, early access), creating consumable assets (like one-time power-ups or tickets), and facilitating asset-based lending, all in just a few clicks.\nWe’re building on EVM-compatible infrastructure, using modular smart contracts, dynamic metadata, and real-time indexing to ensure seamless asset tracking and interaction. The system is fully composable and supports cross-protocol utility, allowing assets to be used across protocols without being locked into one platform.\nPlayers benefit from a clean, chain-abstracted interface where they can easily explore, use, or monetize their owned assets through rentals, consumables, perks, and more, removing the usual friction of Web3 onboarding.\nWhat excites us most is the opportunity to bridge the usability gap between Web2 and Web3 games. By turning static NFTs into dynamic, interactive assets, StreamNFT empowers both developers and gamers to participate in richer, more valuable digital economies, without the technical overhead typically involved.\nCommunity Engagement Features\nUsers will be able to test and engage with a range of features on StreamNFT as part of our gamified onboarding campaign:\nTestable Features/Tasks:\nConnect Wallet – 50 points\nExplore In-Game Asset Listings – 25 points\nTrade an Asset (Buy/Sell) – 100 points\nRent an Asset (Lend or Borrow) – 100 points\nUse a Consumable Asset (e.g., XP boost) – 75 points\nClaim a Perk via Utility Protocol – 50 points\nList Your Own Asset – 75 points\nComplete a Quest (Set of 3 tasks) – Bonus 150 points\nRefer a Friend – 100 points\nPoints System & Gamification:\nEach completed action earns points that unlock badges, exclusive NFTs, and early access perks. Tasks are framed like RPG-style quests (e.g., “Rental Rogue” for first rental or “Perk Hunter” for claiming a utility), tapping into players’ intrinsic motivation. Real-time leaderboards drive friendly competition, while referral rewards create viral growth loops.\nHow This Drives Onboarding:\nBy turning platform exploration into a game-like experience, users are drawn into a journey of discovery. The instant gratification of earning points and rewards, combined with tangible incentives (NFTs, perks, recognition), reduces onboarding friction. This approach helps users understand and experience the full value of their digital assets, while making it fun and social.\nGetting Involved\nJoin our Discord community (DAN ( Ed3, StreamNFT )) where game developers, gamers, collectors collaborate.",
        "comments_details": [
            {
                "author": "piyush-chittara",
                "comment": "Project Name\nStreamNFT\nProblem Statement\nBuilding asset-driven economies in Web3 games is overly complex and inefficient, developers must stitch together multiple tools just to enable core functionalities like trading, rentals, loans or utilities. Current asset standards also restrict cross-protocol usage, limiting the full potential of in-game assets. Meanwhile, players face high entry barriers and fragmented utility experiences, making it difficult to engage meaningfully with their gaming assets.\nSolution Overview\nStreamNFT is a full-stack platform that unifies trading, rentals, loans, and utility into a single plug-and-play hub for game developers. It simplifies the launch and scaling of in-game asset economies. Our asset standard supports cross-protocol usage, unlocking 2x more value and enabling composable utility. For players, StreamNFT offers a seamless interface to discover and interact with their in-game assets, lowering the barriers to Web3 gaming.\nProject Description\nStreamNFT is a full-stack, chain-agnostic platform designed to unlock the full potential of in-game assets and collectibles. At its core, StreamNFT offers plug-and-play modules for trading, rentals, loans, consumables, and real-time utility, all accessible through a unified interface for both developers and players.\nGame developers can launch, manage, and monetize digital asset economies without juggling multiple third-party tools. This includes setting up in-game marketplaces, enabling time-bound rentals, offering real-time perks (e.g., XP boosts, early access), creating consumable assets (like one-time power-ups or tickets), and facilitating asset-based lending, all in just a few clicks.\nWe’re building on EVM-compatible infrastructure, using modular smart contracts, dynamic metadata, and real-time indexing to ensure seamless asset tracking and interaction. The system is fully composable and supports cross-protocol utility, allowing assets to be used across protocols without being locked into one platform.\nPlayers benefit from a clean, chain-abstracted interface where they can easily explore, use, or monetize their owned assets through rentals, consumables, perks, and more, removing the usual friction of Web3 onboarding.\nWhat excites us most is the opportunity to bridge the usability gap between Web2 and Web3 games. By turning static NFTs into dynamic, interactive assets, StreamNFT empowers both developers and gamers to participate in richer, more valuable digital economies, without the technical overhead typically involved.\nCommunity Engagement Features\nUsers will be able to test and engage with a range of features on StreamNFT as part of our gamified onboarding campaign:\nTestable Features/Tasks:\nConnect Wallet – 50 points\nExplore In-Game Asset Listings – 25 points\nTrade an Asset (Buy/Sell) – 100 points\nRent an Asset (Lend or Borrow) – 100 points\nUse a Consumable Asset (e.g., XP boost) – 75 points\nClaim a Perk via Utility Protocol – 50 points\nList Your Own Asset – 75 points\nComplete a Quest (Set of 3 tasks) – Bonus 150 points\nRefer a Friend – 100 points\nPoints System & Gamification:\nEach completed action earns points that unlock badges, exclusive NFTs, and early access perks. Tasks are framed like RPG-style quests (e.g., “Rental Rogue” for first rental or “Perk Hunter” for claiming a utility), tapping into players’ intrinsic motivation. Real-time leaderboards drive friendly competition, while referral rewards create viral growth loops.\nHow This Drives Onboarding:\nBy turning platform exploration into a game-like experience, users are drawn into a journey of discovery. The instant gratification of earning points and rewards, combined with tangible incentives (NFTs, perks, recognition), reduces onboarding friction. This approach helps users understand and experience the full value of their digital assets, while making it fun and social.\nGetting Involved\nJoin our Discord community (DAN ( Ed3, StreamNFT )) where game developers, gamers, collectors collaborate."
            }
        ]
    },
    {
        "id": "fecace41f38e10f8",
        "topic_id": "5913",
        "title": "Building a Web3 Brand from Zero : What’s your approach when launching a new Web3 brand?",
        "url": "https://forum.ceg.vote/t/building-a-web3-brand-from-zero-what-s-your-approach-when-launching-a-new-web3-brand/5913",
        "views": "",
        "comments": "7",
        "created_date": "Jun 23, 2025 12:34 pm",
        "latest_activity": "Jun 28, 2025 7:09 am",
        "content": "Starting from scratch with a protocol or project can feel overwhelming. Naming, branding, content, algorithm reach… where do you start?\nHere’s what’s worked for me in the early days:\nA clear, ownable tagline that speaks to your narrative (not just tech).\nUse threads, carousels, and memes to test voice early. Don’t overthink it — clarity + rhythm beat perfection.\nConsistency > virality. Build a cadence first.\nPost as the founder or team member if the project account is small. People follow people.\nDon’t ignore Twitter SEO — optimize display name, bio, and tweet structure for discovery.\nCurious to hear what you focus on when bootstrapping attention from day 1.\nDrop your go-to tactics below, or link a project you think nailed their launch!",
        "comments_details": [
            {
                "author": "MK-Quen",
                "comment": "Starting from scratch with a protocol or project can feel overwhelming. Naming, branding, content, algorithm reach… where do you start?\nHere’s what’s worked for me in the early days:\nA clear, ownable tagline that speaks to your narrative (not just tech).\nUse threads, carousels, and memes to test voice early. Don’t overthink it — clarity + rhythm beat perfection.\nConsistency > virality. Build a cadence first.\nPost as the founder or team member if the project account is small. People follow people.\nDon’t ignore Twitter SEO — optimize display name, bio, and tweet structure for discovery.\nCurious to hear what you focus on when bootstrapping attention from day 1.\nDrop your go-to tactics below, or link a project you think nailed their launch!"
            },
            {
                "author": "Daniel_K",
                "comment": "One liners!\nSounds simple, sounds obvious, and kinda sounds immature, but even just the exercise of coming up with a PROPER one liner is valuable.\nAligning your vision, solution, objectives, and your key result that you want next while crafting that one liner while making it catchy and easy to say? That’s a process of thinking that’s often skipped, but it can start with that one sentence."
            },
            {
                "author": "han",
                "comment": "Solid advice. narrative clarity and consistent, authentic engagement set the foundation. I’d add: listening early to your audience’s language helps tailor content that truly resonates. What’s your favorite way to gather that initial community feedback?"
            },
            {
                "author": "Norbert",
                "comment": "Love this breakdown. Starting small forces clarity and rhythm which most teams skip. Posting as a human always beats brand posts early on. One thing I’d add is tapping into relevant conversations daily to stay visible."
            },
            {
                "author": "Harley",
                "comment": "Love this breakdown!"
            },
            {
                "author": "Sheyda",
                "comment": "With all due respect, I’d say defining your target audience should come first—before you even start thinking about the tagline.\nThe second step should be identifying where your target audience lives across Web3.\nBasically, you need to answer the four key “WH” questions:\nWho, Where, When, and Why—these should be clearly defined before drafting your next marketing strategy, campaign, or creative direction."
            },
            {
                "author": "priyankg3",
                "comment": "This is solid approach, people love clearity ."
            },
            {
                "author": "Ghostt",
                "comment": "Absolutely agree defining the target audience is the foundation of any solid marketing strategy. The “Who” always comes first: knowing exactly who you’re speaking to is what gives every other element direction.\nThen comes the “Where” — understanding where this audience exists in the Web3 ecosystem and what communities or platforms they engage with is key to meeting them on their terms.\nThe “When” ties into timing the message to match their online behavior and engagement patterns, especially in a space as fast-paced as Web3.\nAnd finally, the “Why” — clarifying why this product or solution matters to this demographic — anchors the narrative in relevance and value.\nWith these four “WH” pillars clearly defined, I honestly believe it’s hard to go wrong."
            }
        ]
    },
    {
        "id": "a588ef262157116c",
        "topic_id": "5966",
        "title": "HyperHack Spotlight Campaign is Live",
        "url": "https://forum.ceg.vote/t/hyperhack-spotlight-campaign-is-live/5966",
        "views": "",
        "comments": "13",
        "created_date": "Jun 25, 2025 2:10 pm",
        "latest_activity": "Jun 28, 2025 6:40 am",
        "content": "Gm Metisians, the Spotlight Campaign is here to supercharge your HyperHack journey!\nWe are giving selected project teams a chance at the $7500 bonus prize pool, $500 in marketing credit, access to guild talent, and the chance to earn tiered ecosystem rewards. The goal is to boost your visibility and help you grow real users.\nApply here\nCampaign Objective\nTo empower HyperHack teams to market their projects using a real budget. This is about helping builders grow their audience, activate users, and showcase their dApps across the Metis ecosystem.\nHow It Works\n$500 marketing credit for each project, 50 projects at maximum\n$7500 extra prize pool for top projects\nEach selected project will receive $500 in marketing credit, split into:\n$300 upfront to start your campaign\n$200 unlocked later if performance goals are met by August 1\n$500 Marketing Credit\nEach project must create a dedicated X account for their HyperHack product and have at least one marketer (internal or from the Forum Marketing Guild) who will:\nLead the project’s marketing strategy\nUse the $500 to drive short-term traffic\nJoin a Vibe Session to introduce the dapp\nShare referral links via X posts to their forum showcase\nApproved Marketing Tactics:\nQuest Campaigns (TaskOn, Zealy, Magic Square): e.g. “Follow + Retweet + Test dapp + Join Forum”\nAMA Airdrops: Host AMAs on X and airdrop to the Metis community\nTwitter Ads: Use paid ads to boost visibility (marketer must help set this up)\nCustom Strategies: Teams are also encouraged to try any other creative ideas tailored to their product and audience\nNote: Marketer’s name and focus must be listed in the application (e.g., Marketing Lead: @Handle – Focus: Memes & Spaces).\nHow We Track Performance\nProjects will be scored across three categories during July 15 to August 1:\n75% X account growth and quality (verified via TwitterAudit)\n20% user activity on your dApp (measured onchain)\n5% users driven to your Forum thread using referral links\nRewards for Top Projects\nTotal Prize Pool: $7500\nTier 1: HyperHack Spotlight Champion\n$3000 bonus for the top project\nForum pin for 14 days\nPriority DevRel support for 6 months\nNewsletter spotlight\n25 bonus points for the final judging phase\nTier 2: Growth Catalysts\n$3000 prize pool\nForum pin for 7 days\nDevRel support for 3 months\nNewsletter spotlight\n15 bonus points\nTier 3: Community Stars\n$1500 prize pool\nDevRel support for 1 month\nNewsletter spotlight\n10 bonus points\nKey Dates\nApplication period: June 25-July 8\nApplication review: July 9- 15\nCampaign period: July 15- August 1\nRules\nFunds must be used for approved marketing activities only\nBot traffic is not allowed and will be checked\nYour marketing strategy must be made public in your Forum thread\nThe Spotlight Campaign is designed to help real builders grow real audiences.\nApply here\nFor questions, reply below.\nGL to all!",
        "comments_details": [
            {
                "author": "Liametis",
                "comment": "Gm Metisians, the Spotlight Campaign is here to supercharge your HyperHack journey!\nWe are giving selected project teams a chance at the $7500 bonus prize pool, $500 in marketing credit, access to guild talent, and the chance to earn tiered ecosystem rewards. The goal is to boost your visibility and help you grow real users.\nApply here\nCampaign Objective\nTo empower HyperHack teams to market their projects using a real budget. This is about helping builders grow their audience, activate users, and showcase their dApps across the Metis ecosystem.\nHow It Works\n$500 marketing credit for each project, 50 projects at maximum\n$7500 extra prize pool for top projects\nEach selected project will receive $500 in marketing credit, split into:\n$300 upfront to start your campaign\n$200 unlocked later if performance goals are met by August 1\n$500 Marketing Credit\nEach project must create a dedicated X account for their HyperHack product and have at least one marketer (internal or from the Forum Marketing Guild) who will:\nLead the project’s marketing strategy\nUse the $500 to drive short-term traffic\nJoin a Vibe Session to introduce the dapp\nShare referral links via X posts to their forum showcase\nApproved Marketing Tactics:\nQuest Campaigns (TaskOn, Zealy, Magic Square): e.g. “Follow + Retweet + Test dapp + Join Forum”\nAMA Airdrops: Host AMAs on X and airdrop to the Metis community\nTwitter Ads: Use paid ads to boost visibility (marketer must help set this up)\nCustom Strategies: Teams are also encouraged to try any other creative ideas tailored to their product and audience\nNote: Marketer’s name and focus must be listed in the application (e.g., Marketing Lead: @Handle – Focus: Memes & Spaces).\nHow We Track Performance\nProjects will be scored across three categories during July 15 to August 1:\n75% X account growth and quality (verified via TwitterAudit)\n20% user activity on your dApp (measured onchain)\n5% users driven to your Forum thread using referral links\nRewards for Top Projects\nTotal Prize Pool: $7500\nTier 1: HyperHack Spotlight Champion\n$3000 bonus for the top project\nForum pin for 14 days\nPriority DevRel support for 6 months\nNewsletter spotlight\n25 bonus points for the final judging phase\nTier 2: Growth Catalysts\n$3000 prize pool\nForum pin for 7 days\nDevRel support for 3 months\nNewsletter spotlight\n15 bonus points\nTier 3: Community Stars\n$1500 prize pool\nDevRel support for 1 month\nNewsletter spotlight\n10 bonus points\nKey Dates\nApplication period: June 25-July 8\nApplication review: July 9- 15\nCampaign period: July 15- August 1\nRules\nFunds must be used for approved marketing activities only\nBot traffic is not allowed and will be checked\nYour marketing strategy must be made public in your Forum thread\nThe Spotlight Campaign is designed to help real builders grow real audiences.\nApply here\nFor questions, reply below.\nGL to all!"
            },
            {
                "author": "4ngel",
                "comment": "This is huge !!! Good luck to every participant, let’s get it"
            },
            {
                "author": "Elenaisplaying",
                "comment": "Such a great news. Good luck everyone"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "I got a hiccup in the marketers forum ID and the Project owner forum ID. I don’t really know how to find that, any form of assistance would be greatly appreciated."
            },
            {
                "author": "Ghostt",
                "comment": "You will see that on your profile, and your own forum id is\n@i_am_supaman_lj\n. If you click the @ sign you will get it."
            },
            {
                "author": "priyankg3",
                "comment": "Thats wonderful, this is the golden chance for developers to build and polish with your project with marketing as well.."
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "Thanks a lot, I was actually hoping I would work with you. Since you are one of the first that saw the potential of Fracturepoint as a solution to the recent web3 gaming failure trends."
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "Thanks for the help, we can go on with the plan already now right ?"
            },
            {
                "author": "Sheyda",
                "comment": "Fantastic, do you have a list of Marketers?"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "List?\nI thought only one ."
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "Specified one marketer on the form Thats why I sort for one"
            },
            {
                "author": "mrwagmicto",
                "comment": "Hey everyone!\nI’m looking for a marketing partner to join me on an exciting crypto project and help drive this campaign forward.\nIf you’re passionate about Web3 marketing, community building, or growth hacking — let’s talk!\nFeel free to DM me. Would love to connect!"
            },
            {
                "author": "Ghostt",
                "comment": "I have teamed up with him and applied to the campaign. Looking forward to the result."
            }
        ]
    },
    {
        "id": "1d6c8509b93d352a",
        "topic_id": "5581",
        "title": "Froska: MemeFi x GambleFi",
        "url": "https://forum.ceg.vote/t/froska-memefi-x-gamblefi/5581",
        "views": "",
        "comments": "16",
        "created_date": "Jun 13, 2025 5:12 pm",
        "latest_activity": "Jun 27, 2025 11:36 pm",
        "content": "Project Name\nFroska\nProblem Statement\nCrypto is missing a fun, community-powered space where users can engage in casual, low-stakes games with real token rewards. Most meme tokens lack utility, and GambleFi platforms often feel predatory or overly complex. Froska solves this by making on-chain gaming both fun and rewarding.\nSolution Overview\nFroska is a MemeFi x GambleFi platform that introduces casual, luck-based games powered by the Froska token on Metis. The platform blends meme culture with playful earning mechanics like the Degen Wheel and Wheel of Fortune, creating a lighthearted and community-first experience. With no KYC requirements, simple interfaces, and real token payouts, Froska brings back the fun in crypto—while giving meme tokens actual purpose.\nWe are now moving to Hyperion to take advantage of its speed and AI-native infrastructure, introducing smart features that will evolve Froska from a meme-based game into an intelligent, interactive crypto arcade.\nProject Description\nFroska is a gamified crypto experience built around chance-based games and meme culture. Players can spin the Wheel of Fortune for varying rewards or risk it all on the Degen Wheel, a high-risk game for thrill-seeking degens. Every interaction on the platform uses the native Froska token, which can be earned, wagered, or traded on Hercules DEX.\nFroska requires no KYC, operates fully on-chain, and prioritizes community rewards. Beyond games, the token has deeper symbolic value—it represents watchfulness and generosity, inspired by the Metis CEO’s own cat. The goal is to grow a loyal, entertained community while showcasing the utility of meme tokens.\nOn Hyperion, we are introducing:\nAn AI Assistant powered by Hyperion’s co-agent system, helping onboard users, guide them through gameplay, and provide live support.\nAI-generated game logic, including future features like dynamic odds and personalized game experiences based on player interaction and on-chain behavior.\nCommunity Engagement Features\nTestable Features:\nSpin the Degen Wheel\nPlay Wheel of Fortune\nClaim Froska faucet tokens\nShare results on X (Twitter)\nRefer a friend using a custom invite link\nInteract with the AI assistant (during later testing phases)\nGamification & Onboarding:\nThe leaderboard to brag about wins\nUsers get notified in real-time when others win big (onsite)\nTasks are easy, fun, and reward curiosity—perfect for onboarding new users who want to “play to degen”\nAI assistant helps new users discover features and complete tasks\nGetting Involved\nCommunity members can:\nJoin the Telegram: Telegram: View @metisfroska\nFollow us on X: https://x.com/metisfroska\nRead our documentation: https://docs.froska.io\nTry out the game (during testnet)\nSubmit memes, game ideas, or artwork via our community channels\nHelp spread the word and onboard new degens to the Froska movement",
        "comments_details": [
            {
                "author": "FROSKA",
                "comment": "Project Name\nFroska\nProblem Statement\nCrypto is missing a fun, community-powered space where users can engage in casual, low-stakes games with real token rewards. Most meme tokens lack utility, and GambleFi platforms often feel predatory or overly complex. Froska solves this by making on-chain gaming both fun and rewarding.\nSolution Overview\nFroska is a MemeFi x GambleFi platform that introduces casual, luck-based games powered by the Froska token on Metis. The platform blends meme culture with playful earning mechanics like the Degen Wheel and Wheel of Fortune, creating a lighthearted and community-first experience. With no KYC requirements, simple interfaces, and real token payouts, Froska brings back the fun in crypto—while giving meme tokens actual purpose.\nWe are now moving to Hyperion to take advantage of its speed and AI-native infrastructure, introducing smart features that will evolve Froska from a meme-based game into an intelligent, interactive crypto arcade.\nProject Description\nFroska is a gamified crypto experience built around chance-based games and meme culture. Players can spin the Wheel of Fortune for varying rewards or risk it all on the Degen Wheel, a high-risk game for thrill-seeking degens. Every interaction on the platform uses the native Froska token, which can be earned, wagered, or traded on Hercules DEX.\nFroska requires no KYC, operates fully on-chain, and prioritizes community rewards. Beyond games, the token has deeper symbolic value—it represents watchfulness and generosity, inspired by the Metis CEO’s own cat. The goal is to grow a loyal, entertained community while showcasing the utility of meme tokens.\nOn Hyperion, we are introducing:\nAn AI Assistant powered by Hyperion’s co-agent system, helping onboard users, guide them through gameplay, and provide live support.\nAI-generated game logic, including future features like dynamic odds and personalized game experiences based on player interaction and on-chain behavior.\nCommunity Engagement Features\nTestable Features:\nSpin the Degen Wheel\nPlay Wheel of Fortune\nClaim Froska faucet tokens\nShare results on X (Twitter)\nRefer a friend using a custom invite link\nInteract with the AI assistant (during later testing phases)\nGamification & Onboarding:\nThe leaderboard to brag about wins\nUsers get notified in real-time when others win big (onsite)\nTasks are easy, fun, and reward curiosity—perfect for onboarding new users who want to “play to degen”\nAI assistant helps new users discover features and complete tasks\nGetting Involved\nCommunity members can:\nJoin the Telegram: Telegram: View @metisfroska\nFollow us on X: https://x.com/metisfroska\nRead our documentation: https://docs.froska.io\nTry out the game (during testnet)\nSubmit memes, game ideas, or artwork via our community channels\nHelp spread the word and onboard new degens to the Froska movement"
            },
            {
                "author": "priyankg3",
                "comment": "Hello\n@FROSKA\n, Thanks for your proposal,\nI have some questions to ask :\nHow does Froska differentiate itself from existing meme tokens or gambling platforms in the crypto space?\nCan you explain how the Degen Wheel and Wheel of Fortune work in simple terms?\nWhat advantages does Hyperion bring to the Froska ecosystem that other chains couldn’t?"
            },
            {
                "author": "han",
                "comment": "Thanks for sharing Froska!\nWill the AI assistant eventually adapt to different player personas (e.g., cautious vs. degen) to suggest personalized game experiences or rewards?"
            },
            {
                "author": "FROSKA",
                "comment": "priyankg3:\nHello\n@FROSKA\n, Thanks for your proposal,\nI have some questions to ask :\nHow does Froska differentiate itself from existing meme tokens or gambling platforms in the crypto space?\nCan you explain how the Degen Wheel and Wheel of Fortune work in simple terms?\nWhat advantages does Hyperion bring to the Froska ecosystem that other chains couldn’t?\nThanks for the questions\nFroska stands out because most meme tokens offer nothing beyond hype, and most gambling platforms are built for high-stakes players. We combine both in a simple way. Froska is a meme token with actual use. You spin, earn, and repeat. It’s made for casual users.\nThe Wheel of Fortune gives you a reward every time. It’s low risk. The Degen Wheel is for higher risk. You stake tokens, spin, and either win a multiplier or lose the stake. The games are fast and don’t require any technical background.\nWe’re moving to Hyperion for two reasons. One is speed. Spins and outcomes happen instantly. The other is AI. We’re adding an in-game AI assistant. It will guide new users, explain gameplay, and help them explore features. Hyperion makes that possible. Andromeda doesn’t."
            },
            {
                "author": "FROSKA",
                "comment": "Yep.\nThe AI assistant will adapt over time. It will observe on-chain behavior, like how often you play, how much you stake, and what games you prefer. From that, it will group users into simple profiles—cautious, moderate, or degen. Each group will get tailored prompts.\nA cautious player might get tips on low-risk spins or claim reminders.\nA degen might get high-risk challenges or bonus rounds. The goal is to keep every user engaged without forcing one play style."
            },
            {
                "author": "priyankg3",
                "comment": "Thanks for the response! Looking forward to spinning soon"
            },
            {
                "author": "han",
                "comment": "This is a smart approach- adaptive engagement based on real behavior is the future of user retention. By tailoring prompts to play styles, you’re not only respecting individual risk appetites but also creating a more personalized and fun experience. Just make sure there’s transparency in how profiles are formed users value that. Curious: will players be able to shift profiles manually or is it fully behavior-driven?"
            },
            {
                "author": "Gann",
                "comment": "Wow Froska is back . One of the first meme projects on Metis."
            },
            {
                "author": "FROSKA",
                "comment": "han:\nThis is a smart approach- adaptive engagement based on real behavior is the future of user retention. By tailoring prompts to play styles, you’re not only respecting individual risk appetites but also creating a more personalized and fun experience. Just make sure there’s transparency in how profiles are formed users value that. Curious: will players be able to shift profiles manually or is it fully behavior-driven?\nProfiles will be behavior-driven by default. We want users to interact naturally without extra setup."
            },
            {
                "author": "han",
                "comment": "That makes sense - lowering friction is key for adoption. Just curious: will there be any way for users to customize or override their behavior-driven profiles if they want more control?"
            },
            {
                "author": "ceeny007",
                "comment": "How exactly will the wheel of fortune be different from the degen wheel?"
            },
            {
                "author": "FROSKA",
                "comment": "In summary, the Froska Wheel is for casual play. You spin and always win something. It’s low risk and good for onboarding.\nThe Degen Wheel is for high-stakes players. You stake tokens before spinning, and you either hit a big win or lose the stake.\nOne is built for fun, the other for thrill."
            },
            {
                "author": "Ameliadupontttm",
                "comment": "This looks like a perfect way to bring more casual gamers into the crypto space. Great job Froska team!"
            },
            {
                "author": "Elenaisplaying",
                "comment": "Your playful approach to MemeFi is refreshing, and the AI assistant has real potential to deepen user interaction. Have you explored how player behavior data could inform personalized game modes or dynamic reward structures to keep users coming back?"
            },
            {
                "author": "FROSKA",
                "comment": "Yes. We’re starting with simple behavior-based adjustments. If a user plays often, they might get access to more spins or small bonus rounds. If someone tends to play low-risk, the assistant may suggest similar options or show safer choices first."
            },
            {
                "author": "CrisMetis",
                "comment": "The idea itself sounds cool but I got a question more about the nature of the project itself:\nHow do you plan to balance the fun, high-risk nature of games like the Degen Wheel with sustainable tokenomics for the Froska Token and long-term community engagement?"
            },
            {
                "author": "FROSKA",
                "comment": "We keep rewards balanced through capped payouts and fixed token supply. The Degen Wheel is high-risk, but most rewards come from a community pool funded by spin fees. No inflation, no constant minting. Long-term engagement comes from light incentives, social interaction, and meme culture not oversized rewards."
            }
        ]
    },
    {
        "id": "d1275896a84084e1",
        "topic_id": "6012",
        "title": "Fracture Point Progress Report – Proof of Play Architecture Live",
        "url": "https://forum.ceg.vote/t/fracture-point-progress-report-proof-of-play-architecture-live/6012",
        "views": "",
        "comments": "0",
        "created_date": "Jun 27, 2025 8:53 pm",
        "latest_activity": null,
        "content": "Hey everyone,\nWe’re excited to share a full status update on Fracture Point, our on-chain shooter project powered by verifiable Proof of Play now live on the Hyperion Testnet.\nCore Milestones Completed:\n• Smart Contracts Deployed\nOur foundational contracts (FPToken, RankBadge, and ClaimManager) are deployed and functional on Hyperion. These power token distribution and player rank progression, all based on verified activity.\n• Alith AI Integration Implemented\nWe’ve aligned our ClaimManager with the latest structure of Alith’s verifiable computing flow, enabling zk-backed claim validation for real player actions. Interactions with IDataRegistry, IVerifiedComputing, and related contracts are now wired into our claim submission logic.\n• Architecture Demonstration\nWe’ve adapted the structure and logic from the official Alith reference repo to clearly show how Fracture Point leverages AI inference within its Proof of Play system.\nhttps://github.com/SUPAMAN-dev/fracture-point-hyperhack\nPrototype UI Progress\n• We’ve started developing a web-based prototype lobby, which helps us simulate early game flow including variant display, basic player submission, and contract interaction.\nWhile not fully wired for end-to-end user flows yet, it demonstrates the core experience we’re building.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!\n• We’ve also begun introducing our Variants, showcasing early character visuals as a way to build the world and reward identity within the ecosystem.\nCurrent Gaps\n• Unity Developers Needed: We’re currently short on dedicated Unity talent and actively seeking 2 developers to push forward actual gameplay builds.\n• UI/UX Scope: Due to resource limits, our current frontend is a self-built mockup. It lays the groundwork for future polish once we expand the team or secure support.\nSpotlight Campaign\nWe’ve officially applied for the HyperHack Spotlight Campaign to begin telling our story and engaging the broader community. We’re focused on growing visibility, onboarding talent, and completing the final pieces of this vision.\nFeel free to reach out if you want to test our contracts, contribute, or explore how Alith is being used in a live project. More updates and tutorials coming soon!",
        "comments_details": [
            {
                "author": "i_am_supaman_lj",
                "comment": "Hey everyone,\nWe’re excited to share a full status update on Fracture Point, our on-chain shooter project powered by verifiable Proof of Play now live on the Hyperion Testnet.\nCore Milestones Completed:\n• Smart Contracts Deployed\nOur foundational contracts (FPToken, RankBadge, and ClaimManager) are deployed and functional on Hyperion. These power token distribution and player rank progression, all based on verified activity.\n• Alith AI Integration Implemented\nWe’ve aligned our ClaimManager with the latest structure of Alith’s verifiable computing flow, enabling zk-backed claim validation for real player actions. Interactions with IDataRegistry, IVerifiedComputing, and related contracts are now wired into our claim submission logic.\n• Architecture Demonstration\nWe’ve adapted the structure and logic from the official Alith reference repo to clearly show how Fracture Point leverages AI inference within its Proof of Play system.\nhttps://github.com/SUPAMAN-dev/fracture-point-hyperhack\nPrototype UI Progress\n• We’ve started developing a web-based prototype lobby, which helps us simulate early game flow including variant display, basic player submission, and contract interaction.\nWhile not fully wired for end-to-end user flows yet, it demonstrates the core experience we’re building.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!\n• We’ve also begun introducing our Variants, showcasing early character visuals as a way to build the world and reward identity within the ecosystem.\nCurrent Gaps\n• Unity Developers Needed: We’re currently short on dedicated Unity talent and actively seeking 2 developers to push forward actual gameplay builds.\n• UI/UX Scope: Due to resource limits, our current frontend is a self-built mockup. It lays the groundwork for future polish once we expand the team or secure support.\nSpotlight Campaign\nWe’ve officially applied for the HyperHack Spotlight Campaign to begin telling our story and engaging the broader community. We’re focused on growing visibility, onboarding talent, and completing the final pieces of this vision.\nFeel free to reach out if you want to test our contracts, contribute, or explore how Alith is being used in a live project. More updates and tutorials coming soon!"
            }
        ]
    },
    {
        "id": "2c152acc5e844c78",
        "topic_id": "4420",
        "title": "EduVerse: AI-Powered Personalized Education Platform",
        "url": "https://forum.ceg.vote/t/eduverse-ai-powered-personalized-education-platform/4420",
        "views": "",
        "comments": "21",
        "created_date": "May 20, 2025 5:45 pm",
        "latest_activity": "Jun 27, 2025 5:36 pm",
        "content": "EduVerse: AI-Powered Personalized Education Platform\nProblem Statement\nStandardized education overlooks individual learning styles and paces, leading to disengagement and hindering student potential. Students and educators face the challenge of a rigid system that doesn’t adapt to diverse needs, impacting learning outcomes.\nSolution Overview\nOur AI-Powered Personalized Education Platform offers a dynamic solution by employing a multi-agent system built on the Alith Agentic Framework. Specialized AI agents collaboratively analyze individual learning styles, curate tailored content, provide adaptive tutoring, and track progress in real time. This creates a uniquely personalized learning journey that adjusts to each student’s needs and pace. By integrating diverse educational resources, the platform aims to enhance engagement, improve learning outcomes, and empower both students and educators.\nProject Description\nThis platform is designed to benefit a wide range of users across the educational landscape. Students of all ages, from kindergarten through higher education, can experience a more engaging and effective learning journey tailored to their specific needs. Educators can utilize the platform to enhance their teaching capabilities, gain deeper insights into student progress, and free up time for more individualized support.\nOn-Chain Components: A First-Class Implementation and Core Requirement for Blockchain Deployment\nOur AI-powered personalized education platform is not merely “blockchain-enhanced” — its core functionality and unique value proposition depend fundamentally on blockchain deployment via Hyperion. The decentralized, trustless, and immutable nature of blockchain—particularly Hyperion’s AI-optimized environment—is essential to realizing our vision.\nVerifiable and Immutable Learning Profiles (On-Chain Data Storage)\nWhat’s On-Chain:\nStudent learning profiles—containing hashed learning milestones, verified skills, and personalized path progress—are recorded on Hyperion’s MetisDB. Each profile includes:\nA unique student identifier\nImmutable logs of achievements\nReferences to off-chain AI agent interactions and curated learning content\nWhy It Needs Blockchain:\nTrustless Verification:\nCentralized educational records are prone to tampering and lack transparency. On-chain profiles offer tamper-proof, auditable records of a learner’s journey—verifiable by students, employers, and academic institutions alike.\nData Sovereignty:\nStudents retain full control of their learning data. On-chain metadata ensures ownership and transparency, unlike siloed centralized platforms.\nFoundation for AI Credentialing:\nImmutable learning progress forms the backbone for future AI-driven credentialing systems. AI-generated content, assessments, and learning paths can be reliably tied to a verifiable blockchain record.\nDecentralized Agent Coordination and Trust (Smart Contract Architecture)\nWhat’s On-Chain:\nAgent Registry & Capabilities:\nAll core agents (e.g., Learning Style Analyst, Content Curator, Personalized Tutor) are registered via smart contracts, with:\nUnique IDs\nDefined roles and permissions\nClear scope of data access and processing\nService Agreements & Orchestration Logic:\nSmart contracts manage agent workflows. For example:\nCompletion of a module may trigger the Progress Tracker\nUpon validation, the Personalized Tutor recommends next steps\nIncentive Mechanisms:\nToken-based rewards for learning milestones, community engagement, and future decentralized agent marketplaces.\nWhy It Needs Blockchain:\nTrustless Agent Interaction:\nIn a multi-agent system, blockchain ensures agent behaviors and interactions are transparent, verifiable, and not reliant on a centralized authority.\nGuaranteed Execution:\nSmart contracts enforce the deterministic execution of workflows, ensuring learning paths adapt in real time based on defined rules.\nImmutable Rules:\nEducational logic, access rights, and reward systems are hard-coded and transparent, fostering trust and accountability.\nAI Enablement via the Alith Agentic Framework\nWhat is Alith:\nAlith is a modular, multi-agent framework designed to power personalized learning by simulating human-like reasoning, memory, and collaboration among AI agents. It forms the intelligence layer of our platform, with deep interoperability with blockchain systems like Hyperion.\nKey Features of Alith:\nAgent Management:\nModular deployment of specialized AI agents:\nLearning Style Analyst\nContent Curator\nPersonalized Tutor\nProgress Tracker\nCollaboration Facilitator\nPersistent Memory:\nAgents maintain long-term memory and context across sessions, enhancing personalization.\nInter-Agent Communication:\nSecure and structured communication between agents, enabling dynamic, cooperative behavior.\nToolchain Access:\nSeamless access to external APIs, knowledge bases, and assessments.\nBlockchain Integration with Alith:\nOn-Chain Agent Registry:\nAll Alith agents are registered on-chain, with roles and capabilities enforced via smart contracts.\nCoordinated Workflow Execution:\nAlith agent interactions are triggered and validated by smart contracts, enabling a trustless education logic layer.\nToken-Driven Incentives:\nAgents’ performance and student outcomes can be linked to on-chain reward systems to drive engagement and adaptive learning.\nPlanned Enhancements for Alith\nTo further improve the personalization, decentralization, and performance of the Alith framework, we are planning several critical upgrades:\n1. Decentralized Agent Marketplace\nAllow community developers to contribute new agents (e.g., specialized tutors or regional content curators)\nAgents will be published and authenticated on-chain with verifiable capabilities\nToken-based reputation and staking mechanisms will prevent misuse or malicious behavior\n2. Agent Fine-Tuning via Federated Learning\nSupport for secure, privacy-preserving personalization of agent behavior based on user feedback\nFine-tuning AI agents locally or within federated clusters, without compromising sensitive student data\n3. ZK-Verifiable Inference\nIntegrate zkML (zero-knowledge machine learning) to enable cryptographic verification of off-chain AI outputs\nThis allows validators and institutions to confirm an agent’s decision (e.g., a test score) without exposing the underlying model or input\n4. Composable Agent Workflows\nEnable developers and educators to compose reusable learning workflows by chaining agents together via simple declarative schemas\nBacked by on-chain validation to ensure logical and pedagogical soundness\n5. Multilingual & Accessibility Agents\nCreate plug-and-play AI agents specialized in localization, translation, and neurodiverse learning strategies\nThese agents will leverage both on-chain registries and external toolchains for broader inclusion\nSecure, Real-Time AI Inference (Leveraging Hyperion’s AI-Native Infrastructure)\nWhat’s On-Chain (or Hyperion-enabled):\nWhile most heavy AI workloads (e.g., model training, long-form inference) run off-chain via the Alith framework, Hyperion enables:\nLightweight on-chain AI inferences for rapid adaptation and scoring\nSmart contract–verified AI outputs to ensure compliance with educational standards\nReal-time coordination between on-chain logic and off-chain AI services\nWhy It Needs Blockchain:\nVerifiable AI Outputs:\nAI-driven assessments and tutor recommendations can be validated on-chain, ensuring educational integrity and transparency—unlike opaque, centralized AI systems.\nLow Latency, High Throughput:\nHyperion’s parallel execution environment supports responsive, adaptive AI interactions critical to keeping learners engaged.\nScalable AI Coordination:\nIntegrating real-time AI decision-making into a decentralized, tamper-proof environment offers performance benefits without compromising trust or cost-efficiency.\nConclusion: Blockchain as the Foundation, Not a Feature\nDeploying on Hyperion transforms the platform from an advanced AI education app into a decentralized, verifiable, trust-minimized learning ecosystem. The blockchain is not an add-on — it is the bedrock of:\nTrust in student progress\nTransparency in agent interaction\nRobust, real-time AI performance\nData Sovereignty, Incentives, and Trust in Our Education Platform\nOur AI-Powered Personalized Education Platform leverages Hyperion’s blockchain to give students true control over their learning data and foster a trusted educational environment.\nData Sovereignty\nWe achieve data sovereignty by giving students self-sovereign identities (SSIs) on Hyperion. Critical learning milestones and verified skills are recorded as immutable hashes on-chain (MetisDB), tied to the student’s SSI. While detailed content stays off-chain, access is cryptographically linked to and controlled by the student. This means students decide who sees what data, creating a tamper-proof and verifiable record that’s genuinely theirs, free from central control.\nToken Incentives\nWe use a utility token, LearnPoints ($LP), to drive engagement:\nLearn-to-Earn (L2E): Students earn $LP for completing modules, mastering skills, and consistent engagement.\nContribution Rewards: Educators and community members earn $LP for creating content, providing feedback, or participating in forums.\nStaking & Governance: $LP can be staked for premium features or used to vote on platform decisions, aligning community interests.\nThese tokens incentivize participation, build a strong community, and add tangible value to learning achievements.\nImportance of Trust and Transparency\nIn education, trust and transparency are paramount:\nLearner Trust: Students need to trust that their achievements are real and that AI decisions (like tutoring paths) are fair and unbiased. On-chain verifiable credentials and transparent AI orchestration build this crucial trust.\nEmpowering Educators: Transparent data provides educators with reliable insights into student progress and curriculum effectiveness, reducing administrative burdens and fostering accountability.\nEquity & Accessibility: Blockchain prevents fraud and offers a universal, trusted way for students to showcase skills, democratizing opportunities regardless of background. Auditable AI decisions also help mitigate bias.\nSummary\nDeploying on Hyperion transforms our platform into a decentralized, verifiable, and trust-minimized educational ecosystem. Blockchain is the bedrock enabling trust in student progress, transparency in AI agent interactions, and robust real-time AI capabilities that define our personalized learning experience.\nCommunity Engagement Features\nPeer Study Groups: Connect with others for collaborative discussions and support.\nQ&A Forums: Ask and answer subject-related questions to deepen understanding.\nSimulated Collaboration: Practice teamwork in virtual, project-based learning scenarios.\nOptional Mentorship: Receive guidance from experienced peers and educators.\nProgress Sharing (Privacy-Controlled): Share milestones to motivate peers while maintaining control over visibility.\nCommunity Challenges: Participate in gamified group activities to promote engagement and friendly competition.\nTeam Members\n@amardeep\n@priyankg3",
        "comments_details": [
            {
                "author": "amardeep",
                "comment": "EduVerse: AI-Powered Personalized Education Platform\nProblem Statement\nStandardized education overlooks individual learning styles and paces, leading to disengagement and hindering student potential. Students and educators face the challenge of a rigid system that doesn’t adapt to diverse needs, impacting learning outcomes.\nSolution Overview\nOur AI-Powered Personalized Education Platform offers a dynamic solution by employing a multi-agent system built on the Alith Agentic Framework. Specialized AI agents collaboratively analyze individual learning styles, curate tailored content, provide adaptive tutoring, and track progress in real time. This creates a uniquely personalized learning journey that adjusts to each student’s needs and pace. By integrating diverse educational resources, the platform aims to enhance engagement, improve learning outcomes, and empower both students and educators.\nProject Description\nThis platform is designed to benefit a wide range of users across the educational landscape. Students of all ages, from kindergarten through higher education, can experience a more engaging and effective learning journey tailored to their specific needs. Educators can utilize the platform to enhance their teaching capabilities, gain deeper insights into student progress, and free up time for more individualized support.\nOn-Chain Components: A First-Class Implementation and Core Requirement for Blockchain Deployment\nOur AI-powered personalized education platform is not merely “blockchain-enhanced” — its core functionality and unique value proposition depend fundamentally on blockchain deployment via Hyperion. The decentralized, trustless, and immutable nature of blockchain—particularly Hyperion’s AI-optimized environment—is essential to realizing our vision.\nVerifiable and Immutable Learning Profiles (On-Chain Data Storage)\nWhat’s On-Chain:\nStudent learning profiles—containing hashed learning milestones, verified skills, and personalized path progress—are recorded on Hyperion’s MetisDB. Each profile includes:\nA unique student identifier\nImmutable logs of achievements\nReferences to off-chain AI agent interactions and curated learning content\nWhy It Needs Blockchain:\nTrustless Verification:\nCentralized educational records are prone to tampering and lack transparency. On-chain profiles offer tamper-proof, auditable records of a learner’s journey—verifiable by students, employers, and academic institutions alike.\nData Sovereignty:\nStudents retain full control of their learning data. On-chain metadata ensures ownership and transparency, unlike siloed centralized platforms.\nFoundation for AI Credentialing:\nImmutable learning progress forms the backbone for future AI-driven credentialing systems. AI-generated content, assessments, and learning paths can be reliably tied to a verifiable blockchain record.\nDecentralized Agent Coordination and Trust (Smart Contract Architecture)\nWhat’s On-Chain:\nAgent Registry & Capabilities:\nAll core agents (e.g., Learning Style Analyst, Content Curator, Personalized Tutor) are registered via smart contracts, with:\nUnique IDs\nDefined roles and permissions\nClear scope of data access and processing\nService Agreements & Orchestration Logic:\nSmart contracts manage agent workflows. For example:\nCompletion of a module may trigger the Progress Tracker\nUpon validation, the Personalized Tutor recommends next steps\nIncentive Mechanisms:\nToken-based rewards for learning milestones, community engagement, and future decentralized agent marketplaces.\nWhy It Needs Blockchain:\nTrustless Agent Interaction:\nIn a multi-agent system, blockchain ensures agent behaviors and interactions are transparent, verifiable, and not reliant on a centralized authority.\nGuaranteed Execution:\nSmart contracts enforce the deterministic execution of workflows, ensuring learning paths adapt in real time based on defined rules.\nImmutable Rules:\nEducational logic, access rights, and reward systems are hard-coded and transparent, fostering trust and accountability.\nAI Enablement via the Alith Agentic Framework\nWhat is Alith:\nAlith is a modular, multi-agent framework designed to power personalized learning by simulating human-like reasoning, memory, and collaboration among AI agents. It forms the intelligence layer of our platform, with deep interoperability with blockchain systems like Hyperion.\nKey Features of Alith:\nAgent Management:\nModular deployment of specialized AI agents:\nLearning Style Analyst\nContent Curator\nPersonalized Tutor\nProgress Tracker\nCollaboration Facilitator\nPersistent Memory:\nAgents maintain long-term memory and context across sessions, enhancing personalization.\nInter-Agent Communication:\nSecure and structured communication between agents, enabling dynamic, cooperative behavior.\nToolchain Access:\nSeamless access to external APIs, knowledge bases, and assessments.\nBlockchain Integration with Alith:\nOn-Chain Agent Registry:\nAll Alith agents are registered on-chain, with roles and capabilities enforced via smart contracts.\nCoordinated Workflow Execution:\nAlith agent interactions are triggered and validated by smart contracts, enabling a trustless education logic layer.\nToken-Driven Incentives:\nAgents’ performance and student outcomes can be linked to on-chain reward systems to drive engagement and adaptive learning.\nPlanned Enhancements for Alith\nTo further improve the personalization, decentralization, and performance of the Alith framework, we are planning several critical upgrades:\n1. Decentralized Agent Marketplace\nAllow community developers to contribute new agents (e.g., specialized tutors or regional content curators)\nAgents will be published and authenticated on-chain with verifiable capabilities\nToken-based reputation and staking mechanisms will prevent misuse or malicious behavior\n2. Agent Fine-Tuning via Federated Learning\nSupport for secure, privacy-preserving personalization of agent behavior based on user feedback\nFine-tuning AI agents locally or within federated clusters, without compromising sensitive student data\n3. ZK-Verifiable Inference\nIntegrate zkML (zero-knowledge machine learning) to enable cryptographic verification of off-chain AI outputs\nThis allows validators and institutions to confirm an agent’s decision (e.g., a test score) without exposing the underlying model or input\n4. Composable Agent Workflows\nEnable developers and educators to compose reusable learning workflows by chaining agents together via simple declarative schemas\nBacked by on-chain validation to ensure logical and pedagogical soundness\n5. Multilingual & Accessibility Agents\nCreate plug-and-play AI agents specialized in localization, translation, and neurodiverse learning strategies\nThese agents will leverage both on-chain registries and external toolchains for broader inclusion\nSecure, Real-Time AI Inference (Leveraging Hyperion’s AI-Native Infrastructure)\nWhat’s On-Chain (or Hyperion-enabled):\nWhile most heavy AI workloads (e.g., model training, long-form inference) run off-chain via the Alith framework, Hyperion enables:\nLightweight on-chain AI inferences for rapid adaptation and scoring\nSmart contract–verified AI outputs to ensure compliance with educational standards\nReal-time coordination between on-chain logic and off-chain AI services\nWhy It Needs Blockchain:\nVerifiable AI Outputs:\nAI-driven assessments and tutor recommendations can be validated on-chain, ensuring educational integrity and transparency—unlike opaque, centralized AI systems.\nLow Latency, High Throughput:\nHyperion’s parallel execution environment supports responsive, adaptive AI interactions critical to keeping learners engaged.\nScalable AI Coordination:\nIntegrating real-time AI decision-making into a decentralized, tamper-proof environment offers performance benefits without compromising trust or cost-efficiency.\nConclusion: Blockchain as the Foundation, Not a Feature\nDeploying on Hyperion transforms the platform from an advanced AI education app into a decentralized, verifiable, trust-minimized learning ecosystem. The blockchain is not an add-on — it is the bedrock of:\nTrust in student progress\nTransparency in agent interaction\nRobust, real-time AI performance\nData Sovereignty, Incentives, and Trust in Our Education Platform\nOur AI-Powered Personalized Education Platform leverages Hyperion’s blockchain to give students true control over their learning data and foster a trusted educational environment.\nData Sovereignty\nWe achieve data sovereignty by giving students self-sovereign identities (SSIs) on Hyperion. Critical learning milestones and verified skills are recorded as immutable hashes on-chain (MetisDB), tied to the student’s SSI. While detailed content stays off-chain, access is cryptographically linked to and controlled by the student. This means students decide who sees what data, creating a tamper-proof and verifiable record that’s genuinely theirs, free from central control.\nToken Incentives\nWe use a utility token, LearnPoints ($LP), to drive engagement:\nLearn-to-Earn (L2E): Students earn $LP for completing modules, mastering skills, and consistent engagement.\nContribution Rewards: Educators and community members earn $LP for creating content, providing feedback, or participating in forums.\nStaking & Governance: $LP can be staked for premium features or used to vote on platform decisions, aligning community interests.\nThese tokens incentivize participation, build a strong community, and add tangible value to learning achievements.\nImportance of Trust and Transparency\nIn education, trust and transparency are paramount:\nLearner Trust: Students need to trust that their achievements are real and that AI decisions (like tutoring paths) are fair and unbiased. On-chain verifiable credentials and transparent AI orchestration build this crucial trust.\nEmpowering Educators: Transparent data provides educators with reliable insights into student progress and curriculum effectiveness, reducing administrative burdens and fostering accountability.\nEquity & Accessibility: Blockchain prevents fraud and offers a universal, trusted way for students to showcase skills, democratizing opportunities regardless of background. Auditable AI decisions also help mitigate bias.\nSummary\nDeploying on Hyperion transforms our platform into a decentralized, verifiable, and trust-minimized educational ecosystem. Blockchain is the bedrock enabling trust in student progress, transparency in AI agent interactions, and robust real-time AI capabilities that define our personalized learning experience.\nCommunity Engagement Features\nPeer Study Groups: Connect with others for collaborative discussions and support.\nQ&A Forums: Ask and answer subject-related questions to deepen understanding.\nSimulated Collaboration: Practice teamwork in virtual, project-based learning scenarios.\nOptional Mentorship: Receive guidance from experienced peers and educators.\nProgress Sharing (Privacy-Controlled): Share milestones to motivate peers while maintaining control over visibility.\nCommunity Challenges: Participate in gamified group activities to promote engagement and friendly competition.\nTeam Members\n@amardeep\n@priyankg3"
            },
            {
                "author": "arbilearn",
                "comment": "This is surely a great concept, waiting to see it come to live"
            },
            {
                "author": "ThalaZikol",
                "comment": "Impressive project! The combination of multi-agent AI and Hyperion blockchain creates a personalized, transparent, and trustworthy education platform. Features like SSI, Learn-to-Earn, and zkML show long-term vision and innovation. Looking forward to seeing EduVerse grow!"
            },
            {
                "author": "Keir",
                "comment": "bu özel bilgiler ıcın teşekkürlerrr"
            },
            {
                "author": "ravisharma",
                "comment": "Really like the detailed proposal..\nHope your project select for build.\nBest wishes."
            },
            {
                "author": "Shruti",
                "comment": "education is a very important part of our life, glad you touch the real problem and trying to solve this with the help of AI"
            },
            {
                "author": "arbilearn",
                "comment": "Great idea, Happy Hacking"
            },
            {
                "author": "deadman_xbt",
                "comment": "This is by far the best proposal of hyperhack , right now.\nimpressed by the usage of alith and AI in education category.\nhope it turned out to be a super product and solve the problems.\ngood luck"
            },
            {
                "author": "heromatters",
                "comment": "Hello\n@amardeep\n,\nFirst of all, thank you for presenting the proposal on such an important narrative — education.\nI have few questions :-\nHow does EduVerse plan to balance AI personalization with curriculum standardization, especially for formal education systems that require fixed syllabi and assessments?\nHow does EduVerse ensure a smooth experience for users who are new to both AI and blockchain (students, teachers, or even schools)?"
            },
            {
                "author": "amardeep",
                "comment": "heromatters:\nHello\n@amardeep\n,\nFirst of all, thank you for presenting the proposal on such an important narrative — education.\nThank you so much for your kind words and for taking the time to go through the proposal.\nI would like to answer your both questions\nBalancing Personalization & Standardization:\nEduVerse’s AI works within the set curriculum, not outside it. It helps students learn at their own pace and style while making sure they cover everything required. For teachers, it highlights exactly where students need help, so they can focus their efforts more effectively—without losing control of the classroom.\nHelping New Users Feel at Home:\nWe keep things simple. Instead of talking tech, we show the benefits—like personalized learning and instant feedback. The platform is easy to use, with gamified learning for students and clear dashboards for teachers. Blockchain runs quietly in the background—users just see that their records are secure and portable. Plus, we offer helpful guides and real human support.\nFeel free to ask further.\nThank you."
            },
            {
                "author": "Cryptopotato",
                "comment": "Hello\n@amardeep\nWhy did you choose Hyperion specifically for EduVerse instead of other chains like NEAR or Avalanche that also offer AI integrations and scalability?\nWhat strategies are used to detect and correct AI biases in agent decision-making (e.g., tutoring paths, performance assessments)?"
            },
            {
                "author": "amardeep",
                "comment": "Thanks for your questions.\nWhy Hyperion for EduVerse?\nWe chose Hyperion over other chains like NEAR or Avalanche because it’s built for AI-native Web3 applications, perfectly fitting EduVerse’s needs:\nNative AI Optimization: Hyperion’s MetisVM and AI co-processor are designed to efficiently run and verify AI workloads directly on-chain. This means more trustworthy and cost-effective AI decisions compared to other chains that simply “support” AI.\nDirect Alith Integration: Hyperion has a direct, announced integration with the Alith Agentic Framework, which is the core of our multi-agent system. This makes developing and deploying our AI agents much smoother.\nReal-Time Performance: Its parallel execution and high throughput (with MetisDB for data) ensure a super responsive and scalable learning experience, crucial for instant AI feedback and interactions.\nCost-Efficiency: As a Layer 2, Hyperion offers lower transaction costs, making expensive AI operations more viable for a large educational platform.\nHow We Detect & Correct AI Biases?\nDiverse Training Data: We’ll use very diverse datasets to train our AI, making sure it learns from a wide range of students and backgrounds. We’ll also use techniques like data balancing to prevent underrepresentation.\nFairness-Aware Algorithms: We’ll build our AI models using algorithms specifically designed to reduce performance disparities across different groups, constantly monitoring with fairness metrics.\nHuman Oversight: Educators and experts will review AI-suggested paths and assessments. Their feedback will directly help refine the AI.\nThank you"
            },
            {
                "author": "amardeep",
                "comment": "Project update:\nGithub : GitHub - amardeepio/Eduverse\nproject update:\nHey everyone,\nWhen you click that “Complete Module” button, something really cool happens behind the scenes. Think of it like getting a digital diploma notarized on the blockchain.\nHere’s the simple 3-step process:\nYou Sign the Diploma: Your MetaMask wallet pops up and asks you to “sign” a message. This is like putting your unique, unforgeable signature on the diploma, proving you completed the work. It’s completely free and doesn’t cost any gas.\nA Secure Courier Delivers It: Our server acts as a secure courier. It takes your signed diploma and delivers it to the blockchain to be officially recorded.\nThe Blockchain Notarizes It: The smart contract acts as a public notary. It mathematically verifies that your signature is authentic. Once verified, it permanently stamps your achievement into its public ledger.\nThat’s it! The “Achievement Unlocked” message means your accomplishment is now a permanent, verifiable part of your learning history that you, and only you, control with your wallet.\nThanks\n@pavel\n@t0mcr8se\n@daryl"
            },
            {
                "author": "daryl",
                "comment": "Great update\n@amardeep\n!"
            },
            {
                "author": "CrisMetis",
                "comment": "Really cool idea! I believe putting together multi-agent AI with the Hyperion blockchain makes EduVerse feel both smart and trustworthy. Love the direction with features like Learn-to-Earn. Really exited to see where it goes!"
            },
            {
                "author": "amardeep",
                "comment": "Thanks a lot for the appreciation."
            },
            {
                "author": "sumankr",
                "comment": "Very Nice Idea!\n@amardeep"
            },
            {
                "author": "amardeep",
                "comment": "EduVerse Progress Update\nHey everyone,\nWe’ve made progress on the EduVerse platform, and we’re excited to share what’s now fully functional! We’ve built and integrated the core components of our vision for a personalized, on-chain educational experience.\nFull User Login & Session Management\nUsers can securely Sign-In with Ethereum via MetaMask.\nCreates a verifiable session to track progress — no email/password required!\nDynamic Course & Quiz System\nClean, tile-based layout for all available courses.\nUsers can browse topics, pick a course, and take a multi-question quiz.\nOn-Chain Achievements\nUpon quiz completion, users sign a message via wallet.\nThe ProgressTrackerAgent sends this to our smart contract.\nA verifiable credential (your on-chain diploma) is minted on the Hyperion Testnet.\nUsers receive a transaction link to view their credential instantly!\nMulti-Agent AI Backend (Alith Framework)\nWe’ve evolved into a true multi-agent system, including:\nAPI Gateway – Handles all user requests.\nAgent Service – Coordinates our AI agents.\nTutorChatAgent – Powered by Alith + DeepSeek + Gemini, provides smart, conversational, context-aware help for any course.\nQuizHintAgent – Offers conceptual hints during quizzes (no spoilers!).\nEnhanced User Experience\nAdded typewriter animation to AI responses for a more human-like feel.\nLoading animations enhance responsiveness and polish.\nWe’re proud of how far we’ve come — but this is just the beginning. EduVerse is becoming a living, breathing learning companion for the decentralized world!\nLet us know your thoughts, feedback, or ideas!\nScreen capture of progress till now\nThank you"
            },
            {
                "author": "amardeep",
                "comment": "Screen capture video link in good quality Eduverse screen capture"
            },
            {
                "author": "heromatters",
                "comment": "This is truly amazing amar and thanks for sharing the update.\nThe UI looks so cool."
            }
        ]
    },
    {
        "id": "a415cc78b90fb81b",
        "topic_id": "5901",
        "title": "Building Brand Trust in an Era of Deepfakes and AI Content",
        "url": "https://forum.ceg.vote/t/building-brand-trust-in-an-era-of-deepfakes-and-ai-content/5901",
        "views": "",
        "comments": "4",
        "created_date": "Jun 23, 2025 9:20 am",
        "latest_activity": "Jun 27, 2025 5:30 pm",
        "content": "“As AI-generated content advances, deepfakes have become a critical challenge for brand integrity. Recent incidents—from fake celebrity endorsements to fabricated executive statements—highlight urgent risks. I‘ve summarized some available methods. I’d welcome your experiences and critiques on what actually works.”\n1. The Trust Erosion Challenge\nCurrent Realities:\nSynthetic Media Proliferation:\nDeepfakes now mimic voices, mannerisms, and contexts with alarming accuracy (e.g., fake “CEO announcement” videos).\nConsumer Distrust:\n68% question brand authenticity if AI use isn’t disclosed (Edelman 2025).\nRegulatory Momentum:\nItaly’s fines for inadequate AI labeling signal global compliance demands.\n2. Observed Defense Frameworks\nA. Proactive Authentication\nStrategy Implementation Example\nTamper-Proof Watermarking Cryptographic signatures in official media\nContent Provenance Tracking Public timestamping for edit history\nBehavior-Based Threat Tools Anti-Sybil systems to detect bot networks\nB. Transparency Protocols\nExplicit AI Labeling:\nStandardized icons (e.g., AI-Assisted) on all synthetic/semi-synthetic content.\nPublic Creation Logs:\nShare toolchains and editing steps (e.g., “Generated via [Tool], edited in [Software]”).\nLive Human Verification:\nHost AMAs with real-time gestures/codes to counter impersonation.\n3. Community-Driven Trust Models\nEmerging Practices:\nCrowdsourced Vigilance Programs:\nReward users for reporting fakes (e.g., non-monetary recognition programs).\nDecentralized Content Moderation:\nAllow authenticated communities to flag disputed media.\nClear UGC Guidelines:\nDefine ownership/revenue splits for user-generated content upfront.\n4. Trust Metrics Worth Tracking\nKPI Measurement Approach\nDeepfake response time Internal incident dashboards\nAI disclosure engagement Click-through on provenance links\nSentiment recovery post-crisis Social listening tools\nNo brand is immune to synthetic media risks, but proactive transparency turns trust into a competitive edge. What’s one step you will take?",
        "comments_details": [
            {
                "author": "Claire",
                "comment": "“As AI-generated content advances, deepfakes have become a critical challenge for brand integrity. Recent incidents—from fake celebrity endorsements to fabricated executive statements—highlight urgent risks. I‘ve summarized some available methods. I’d welcome your experiences and critiques on what actually works.”\n1. The Trust Erosion Challenge\nCurrent Realities:\nSynthetic Media Proliferation:\nDeepfakes now mimic voices, mannerisms, and contexts with alarming accuracy (e.g., fake “CEO announcement” videos).\nConsumer Distrust:\n68% question brand authenticity if AI use isn’t disclosed (Edelman 2025).\nRegulatory Momentum:\nItaly’s fines for inadequate AI labeling signal global compliance demands.\n2. Observed Defense Frameworks\nA. Proactive Authentication\nStrategy Implementation Example\nTamper-Proof Watermarking Cryptographic signatures in official media\nContent Provenance Tracking Public timestamping for edit history\nBehavior-Based Threat Tools Anti-Sybil systems to detect bot networks\nB. Transparency Protocols\nExplicit AI Labeling:\nStandardized icons (e.g., AI-Assisted) on all synthetic/semi-synthetic content.\nPublic Creation Logs:\nShare toolchains and editing steps (e.g., “Generated via [Tool], edited in [Software]”).\nLive Human Verification:\nHost AMAs with real-time gestures/codes to counter impersonation.\n3. Community-Driven Trust Models\nEmerging Practices:\nCrowdsourced Vigilance Programs:\nReward users for reporting fakes (e.g., non-monetary recognition programs).\nDecentralized Content Moderation:\nAllow authenticated communities to flag disputed media.\nClear UGC Guidelines:\nDefine ownership/revenue splits for user-generated content upfront.\n4. Trust Metrics Worth Tracking\nKPI Measurement Approach\nDeepfake response time Internal incident dashboards\nAI disclosure engagement Click-through on provenance links\nSentiment recovery post-crisis Social listening tools\nNo brand is immune to synthetic media risks, but proactive transparency turns trust into a competitive edge. What’s one step you will take?"
            },
            {
                "author": "han",
                "comment": "Insightful breakdown combining tech safeguards with transparency and community oversight seems key to rebuilding trust in AI-driven media. How do you see blockchain enhancing these trust protocols?"
            },
            {
                "author": "Norbert",
                "comment": "How do you approach balancing transparency with brand control when disclosing AI-generated content? Have any of these methods actually worked for teams in real-world scenarios?"
            },
            {
                "author": "Claire",
                "comment": "Great question! Here’re what I think:\nImmutable proof → Hash metadata (creator, edits) on-chain. Any tampering breaks the hash.\nCross-entity bridges → e.g., Media uses chain-proofs to negotiate with AI firms over data rights.\nCommunity power → Users scan blockchain fingerprints (like Adobe’s) to verify content."
            },
            {
                "author": "Claire",
                "comment": "Spot on — balancing transparency is tough!\nRisk-tiered labels:\nHigh-risk (e.g., health news): + hidden watermarks\nLow-risk (ads): Tool names only (e.g., “Midjourney V6”), keep prompts private.\nAutomated Safeguards:\nembeds watermarks during AI content generation.\nProve authenticity without leaking IP."
            }
        ]
    },
    {
        "id": "78136bfca8553d30",
        "topic_id": "5820",
        "title": "KOLs/Influencer Marketing in Web3: Hype vs. Long-Term Value",
        "url": "https://forum.ceg.vote/t/kols-influencer-marketing-in-web3-hype-vs-long-term-value/5820",
        "views": "",
        "comments": "6",
        "created_date": "Jun 18, 2025 11:14 am",
        "latest_activity": "Jun 27, 2025 3:01 pm",
        "content": "I think is important to have a post talking about KOLs/Influencer influence in web3.\nInfluencers have become super important in many fields, but in the last 4-5 years, especially in Web3, we can say that they popped-up, and right now each crypto enthusiast might be your best KOL, and the one who influences your decisions.\nHowever the way they act and create contents to drive their community and attract new users it could differentiate a lot.\nRecently many are chasing that hype, but it’s key to remember that hype doesn’t always equal long-term value.\nIn this evolving landscape that is Web 3 (it really changes every day, and you always have to be up to date ), Key Opinion Leaders (KOLs) play a pivotal role in shaping perceptions and driving engagement. However, not all KOLs are the same. The industry faces a challenge where some influencers prioritize short-term gains over sustainable growth, leading to a proliferation of hype-driven content that lacks depth.\nTo distinguish between hype and long-term value, I believe is important to consider the following:\nEngagement Over Vanity Metrics: Focus on KOLs who foster genuine interactions within their communities, replies to DMs, post valuable guides to their communities, or even go live showing themselves out there with educational contents, rather than those who boast inflated follower counts. High engagement often correlates with a more dedicated and informed audience.\nEducational Content infact: Influencers who provide insightful analyses, tutorials, and discussions about blockchain technology, tokenomics, and more, contribute to the overall knowledge base of the community.\nTransparent Partnerships: Trustworthy KOLs disclose their affiliations and partnerships, ensuring that their endorsements are based on genuine belief in the project’s value rather than financial incentives.\nConsistent Track Record: Evaluate the influencer’s history of promoting projects. A consistent pattern of supporting successful and ethical projects indicates a commitment to long-term value creation.\nBy aligning with KOLs who embody these principles, whoever, an investor, a newbie or a new Web3 project, can build strong foundations, loyal and informed communities, setting the stage for more quality content and projects out there, and remember always DYOR.",
        "comments_details": [
            {
                "author": "CrisMetis",
                "comment": "I think is important to have a post talking about KOLs/Influencer influence in web3.\nInfluencers have become super important in many fields, but in the last 4-5 years, especially in Web3, we can say that they popped-up, and right now each crypto enthusiast might be your best KOL, and the one who influences your decisions.\nHowever the way they act and create contents to drive their community and attract new users it could differentiate a lot.\nRecently many are chasing that hype, but it’s key to remember that hype doesn’t always equal long-term value.\nIn this evolving landscape that is Web 3 (it really changes every day, and you always have to be up to date ), Key Opinion Leaders (KOLs) play a pivotal role in shaping perceptions and driving engagement. However, not all KOLs are the same. The industry faces a challenge where some influencers prioritize short-term gains over sustainable growth, leading to a proliferation of hype-driven content that lacks depth.\nTo distinguish between hype and long-term value, I believe is important to consider the following:\nEngagement Over Vanity Metrics: Focus on KOLs who foster genuine interactions within their communities, replies to DMs, post valuable guides to their communities, or even go live showing themselves out there with educational contents, rather than those who boast inflated follower counts. High engagement often correlates with a more dedicated and informed audience.\nEducational Content infact: Influencers who provide insightful analyses, tutorials, and discussions about blockchain technology, tokenomics, and more, contribute to the overall knowledge base of the community.\nTransparent Partnerships: Trustworthy KOLs disclose their affiliations and partnerships, ensuring that their endorsements are based on genuine belief in the project’s value rather than financial incentives.\nConsistent Track Record: Evaluate the influencer’s history of promoting projects. A consistent pattern of supporting successful and ethical projects indicates a commitment to long-term value creation.\nBy aligning with KOLs who embody these principles, whoever, an investor, a newbie or a new Web3 project, can build strong foundations, loyal and informed communities, setting the stage for more quality content and projects out there, and remember always DYOR."
            },
            {
                "author": "han",
                "comment": "Great insights on the real impact of KOLs in Web3! But with so many influencers chasing hype, how can newcomers effectively spot the authentic voices from the noise-especially when engagement metrics can sometimes be misleading or artificially inflated?"
            },
            {
                "author": "Daniel_K",
                "comment": "That hopium though… Can’t go without it, but so very volatile"
            },
            {
                "author": "CrisMetis",
                "comment": "Thanks for the question Han\nCheck meaningful engagement – For example, a KOL who gets 1,000 likes and 250 comments, but they all sound botted (e.g., “lfgggg”, “I think the same”, “nice call”), is a red flag. Also, spending some time checking some of the blue checkmark accounts engaging with that post can help. That way, you can better understand whether these are real accounts posting meaningful content and genuinely engaging with the KOL, or if they’re likely botted or bought accounts.\nConsistent track record – Evaluate the influencer’s history in promoting projects. A KOL/influencer who is known for long-term support of a project, consistently shows up, and puts their face/voice out there is another good sign.\nCheck the consistency of their voice – A KOL who frequently changes opinions or jumps between projects might just be chasing the best payouts rather than aiming to bring value. Changing one’s mind occasionally isn’t always a bad sign, but if it happens often, it’s definitely a red flag.\nAdditionals thing are out there, I believe also very important to use some of the tools out there also to check followers, and so on, and especially disconnect and be far from the idea that “A lot of followers, likes= high quality”"
            },
            {
                "author": "han",
                "comment": "Thanks for the detailed breakdown all very sharp points.\nI especially agree on the “voice consistency” angle. It’s underrated. A KOL constantly shifting tone or hopping between hype cycles usually signals a payout-driven motive rather than real conviction.\nAlso, checking comments for signal vs. noise has saved me more than once. Real engagement has texture generic hype rarely does.\nAppreciate the insights!"
            },
            {
                "author": "Julie0xnana",
                "comment": "CrisMetis:\nI think is important to have a post talking about KOLs/Influencer influence in web3.\nInfluencers have become super important in many fields, but in the last 4-5 years, especially in Web3, we can say that they popped-up, and right now each crypto enthusiast might be your best KOL, and the one who influences your decisions.\nHowever the way they act and create contents to drive their community and attract new users it could differentiate a lot.\nRecently many are chasing that hype, but it’s key to remember that hype doesn’t always equal long-term value.\nIn this evolving landscape that is Web 3 (it really changes every day, and you always have to be up to date ), Key Opinion Leaders (KOLs) play a pivotal role in shaping perceptions and driving engagement. However, not all KOLs are the same. The industry faces a challenge where some influencers prioritize short-term gains over sustainable growth, leading to a proliferation of hype-driven content that lacks depth.\nTo distinguish between hype and long-term value, I believe is important to consider the following:\nEngagement Over Vanity Metrics: Focus on KOLs who foster genuine interactions within their communities, replies to DMs, post valuable guides to their communities, or even go live showing themselves out there with educational contents, rather than those who boast inflated follower counts. High engagement often correlates with a more dedicated and informed audience.\nEducational Content infact: Influencers who provide insightful analyses, tutorials, and discussions about blockchain technology, tokenomics, and more, contribute to the overall knowledge base of the community.\nTransparent Partnerships: Trustworthy KOLs disclose their affiliations and partnerships, ensuring that their endorsements are based on genuine belief in the project’s value rather than financial incentives.\nConsistent Track Record: Evaluate the influencer’s history of promoting projects. A consistent pattern of supporting successful and ethical projects indicates a commitment to long-term value creation.\nBy aligning with KOLs who embody these principles, whoever, an investor, a newbie or a new Web3 project, can build strong foundations, loyal and informed communities, setting the stage for more quality content and projects out there, and remember always DYOR.\nPrioritize KOLs who educate & engage authentically over hype-chasers—sustainable Web3 growth hinges on transparency and real community value."
            },
            {
                "author": "priyankg3",
                "comment": "I think it’s time we shift the focus from follower count to community impact. A KOL with 10k highly engaged followers who trust their word is way more powerful than someone with 500k bots and no real dialogue."
            }
        ]
    },
    {
        "id": "d13920dd66fd1564",
        "topic_id": "5830",
        "title": "A/B Testing in the Age of AI-Personalized Content: Still Relevant or Kinda Old School?",
        "url": "https://forum.ceg.vote/t/a-b-testing-in-the-age-of-ai-personalized-content-still-relevant-or-kinda-old-school/5830",
        "views": "",
        "comments": "4",
        "created_date": "Jun 18, 2025 7:42 pm",
        "latest_activity": "Jun 27, 2025 2:39 pm",
        "content": "A/B Testing in the Age of AI-Personalized Content: Still Relevant or Kinda Old School?\nLet’s be honest, A/B testing has been the go-to trick in every digital marketer’s playbook for years. Want to know if a red button works better than a blue one? Test it. Wondering whether your audience prefers “Sign Up” or “Join Now”? Test that too. We’ve A/B tested everything from headlines and thumbnails to entire landing pages.\nBut now that we’re in the age of AI-generated and AI-personalized content: Is A/B testing still practical to optimize content? Or has it quietly been replaced by real-time personalization that shifts content based on the user’s behaviour before they even see version A or B?\nLet’s break it down.\nWhat’s Changed?\nHere’s the thing, AI doesn’t just spit out random variations. It learns, adapts, and personalizes content based on hundreds of factors. From user location and past interactions to the time of day and device being used, AI tailors the experience before you even hit “publish.”\nAccording to a 2025 report by Statista, over 63% of digital marketing teams are now using AI-driven personalization tools to serve dynamic content on their websites and email campaigns [source]. That’s up from just 42% in 2023.\nSo yeah, the shift is real.\nIs A/B Testing Dead?\nNot quite. But it’s evolving.\nTraditional A/B testing is manual and limited. You run a test, collect data, wait days (or weeks), then analyze and adjust. AI doesn’t wait. It optimizes in real time. But here’s where A/B testing still shines: baseline validation.\nEven with AI, you need to know what works before the system learns what works best for whom. It’s like giving your AI a strong foundation to build on.\nFor example, if you’re launching a new feature, testing two core landing page messages can provide the directional clarity you need. Once you know which one resonates overall, AI can step in and personalize the rest, like changing the CTA based on device or the imagery based on user history.\nAI + A/B = Power Couple\nHow about thinking of A/B testing and AI personalization as collaborators, rather than competitors?\nYou can:\nUse A/B testing to validate the best core message.\nThen use AI to personalize the delivery of that message to different segments.\nFinally, let machine learning track micro-interactions and refine future content based on actual user behaviour, not just guesswork.\nThat’s how you move from “Did red or blue work better?” to “Why not both, depending on who’s looking?”\nTL;DR (Because You’re Busy)\nA/B testing isn’t dead, it’s just not working alone anymore.\nIn 2025, AI personalization is driving the majority of real-time optimizations.\nUse A/B testing for foundational decisions, then let AI tailor and scale.\nSo yeah, keep testing. But let your AI do the heavy lifting on the personalization front. That way, you’re not just choosing a better version of your content; you’re delivering the right one to the right person, at the right time.",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "A/B Testing in the Age of AI-Personalized Content: Still Relevant or Kinda Old School?\nLet’s be honest, A/B testing has been the go-to trick in every digital marketer’s playbook for years. Want to know if a red button works better than a blue one? Test it. Wondering whether your audience prefers “Sign Up” or “Join Now”? Test that too. We’ve A/B tested everything from headlines and thumbnails to entire landing pages.\nBut now that we’re in the age of AI-generated and AI-personalized content: Is A/B testing still practical to optimize content? Or has it quietly been replaced by real-time personalization that shifts content based on the user’s behaviour before they even see version A or B?\nLet’s break it down.\nWhat’s Changed?\nHere’s the thing, AI doesn’t just spit out random variations. It learns, adapts, and personalizes content based on hundreds of factors. From user location and past interactions to the time of day and device being used, AI tailors the experience before you even hit “publish.”\nAccording to a 2025 report by Statista, over 63% of digital marketing teams are now using AI-driven personalization tools to serve dynamic content on their websites and email campaigns [source]. That’s up from just 42% in 2023.\nSo yeah, the shift is real.\nIs A/B Testing Dead?\nNot quite. But it’s evolving.\nTraditional A/B testing is manual and limited. You run a test, collect data, wait days (or weeks), then analyze and adjust. AI doesn’t wait. It optimizes in real time. But here’s where A/B testing still shines: baseline validation.\nEven with AI, you need to know what works before the system learns what works best for whom. It’s like giving your AI a strong foundation to build on.\nFor example, if you’re launching a new feature, testing two core landing page messages can provide the directional clarity you need. Once you know which one resonates overall, AI can step in and personalize the rest, like changing the CTA based on device or the imagery based on user history.\nAI + A/B = Power Couple\nHow about thinking of A/B testing and AI personalization as collaborators, rather than competitors?\nYou can:\nUse A/B testing to validate the best core message.\nThen use AI to personalize the delivery of that message to different segments.\nFinally, let machine learning track micro-interactions and refine future content based on actual user behaviour, not just guesswork.\nThat’s how you move from “Did red or blue work better?” to “Why not both, depending on who’s looking?”\nTL;DR (Because You’re Busy)\nA/B testing isn’t dead, it’s just not working alone anymore.\nIn 2025, AI personalization is driving the majority of real-time optimizations.\nUse A/B testing for foundational decisions, then let AI tailor and scale.\nSo yeah, keep testing. But let your AI do the heavy lifting on the personalization front. That way, you’re not just choosing a better version of your content; you’re delivering the right one to the right person, at the right time."
            },
            {
                "author": "han",
                "comment": "Interesting points about AI personalization complementing A/B testing — but do you think there’s a risk that relying too much on AI-driven real-time optimization might make marketers complacent? Could we lose the discipline of rigorous testing and critical thinking if we just let AI ‘figure it out’ for us?"
            },
            {
                "author": "Daniel_K",
                "comment": "Completely agree that it’s a part of any good marketing plan.\nNo time to test because you’re a 1-person marketing team? Even if you’re a 1-person company, A/B testing should be part of your marketing plan. Can even get AI to set one up"
            },
            {
                "author": "Sheyda",
                "comment": "Agreed! This can improve your campaign efficiency and avoid budget waisting on inefficient channels and media."
            },
            {
                "author": "priyankg3",
                "comment": "wow, that will be a game changer if AI can help and build the marketing strategy, because might be Ai can detect what will work or what will not work ?"
            }
        ]
    },
    {
        "id": "685f71a5f7ae19d8",
        "topic_id": "6000",
        "title": "Spotlight Campaign? Your Next Marketing Role Might Be in This Hackathon",
        "url": "https://forum.ceg.vote/t/spotlight-campaign-your-next-marketing-role-might-be-in-this-hackathon/6000",
        "views": "",
        "comments": "2",
        "created_date": "Jun 27, 2025 7:47 am",
        "latest_activity": "Jun 27, 2025 2:37 pm",
        "content": "Many projects from the hackathon are still in early stages of visibility and traction. The Spotlight Campaign gives them access to a $500 marketing credit, a $7500 prize pool, and ecosystem-wide exposure.\nThis is a chance for these teams to collaborate with marketers from this guild.\nIf you’re a marketer looking to contribute, now’s the time to reach out to hackathon projects directly (Many found in the Ideathon Category). You can lead their socials strategy, run campaigns, and help them qualify for the second half of their marketing credit by August 1.\nYou’re also encouraged to make a short post about your experience and what kind of project you’d like to work with. Teams are actively browsing this forum looking for help.\nThe marketing credit is split into $300 upfront and $200 unlocked on performance. You’ll be expected to run real campaigns using TaskOn, Zealy, Magic Square, Twitter AMAs, ads, and other creative tactics.\nPerformance is judged by X account growth and quality, onchain user activity, and traffic to the team’s forum thread. Top projects win from a $7500 bonus pool and get extended DevRel and forum support.\nIf you’re available, go make a post or start reaching out. Let’s get some teams to the top.\nStart here: 🚨 HyperHack Spotlight Campaign is Live 🚨",
        "comments_details": [
            {
                "author": "Norbert",
                "comment": "Many projects from the hackathon are still in early stages of visibility and traction. The Spotlight Campaign gives them access to a $500 marketing credit, a $7500 prize pool, and ecosystem-wide exposure.\nThis is a chance for these teams to collaborate with marketers from this guild.\nIf you’re a marketer looking to contribute, now’s the time to reach out to hackathon projects directly (Many found in the Ideathon Category). You can lead their socials strategy, run campaigns, and help them qualify for the second half of their marketing credit by August 1.\nYou’re also encouraged to make a short post about your experience and what kind of project you’d like to work with. Teams are actively browsing this forum looking for help.\nThe marketing credit is split into $300 upfront and $200 unlocked on performance. You’ll be expected to run real campaigns using TaskOn, Zealy, Magic Square, Twitter AMAs, ads, and other creative tactics.\nPerformance is judged by X account growth and quality, onchain user activity, and traffic to the team’s forum thread. Top projects win from a $7500 bonus pool and get extended DevRel and forum support.\nIf you’re available, go make a post or start reaching out. Let’s get some teams to the top.\nStart here: 🚨 HyperHack Spotlight Campaign is Live 🚨"
            },
            {
                "author": "han",
                "comment": "how can I help them gain visibility?"
            },
            {
                "author": "priyankg3",
                "comment": "Hello, Would it be possible to connect with the right person from TaskOn, Zealy, or Magic Square so that marketers can reach out directly and get proper guidance on how to set up campaigns for their projects?"
            }
        ]
    },
    {
        "id": "3cb9d6a94078316c",
        "topic_id": "5998",
        "title": "A step-by-step Quest Campaign template for HyperHack projects to guide users in Spotlight Campaign",
        "url": "https://forum.ceg.vote/t/a-step-by-step-quest-campaign-template-for-hyperhack-projects-to-guide-users-in-spotlight-campaign/5998",
        "views": "",
        "comments": "2",
        "created_date": "Jun 27, 2025 6:24 am",
        "latest_activity": "Jun 27, 2025 2:34 pm",
        "content": "Here’s a step-by-step Quest Campaign template for HyperHack projects to guide users.\nHyperHack Quest: Join Our Journey & Earn Rewards!\nFollow these simple steps to explore our project, earn rewards, and join our community:\nStep 1: Follow & Retweet\nGo to our dedicated X account: Insert your projects’ X handles\nFOLLOW our account\nRETWEET our pinned HyperHack announcement tweet\nStep 2: Test Our dApp\nVisit our dApp:\nPerform ONE key action (e.g., connect wallet, make test transaction)\nTake a screenshot of your action as proof\nStep 3: Join Forum Discussion\nGo to our Metis Forum thread: Insert your Forum Showcase Link\nCLICK the referral link to register:Insert your Forum Referral Link\nClaim Your Rewards\nFirst 100 completers get exclusive NFT/role + token rewards\nWhy This Works\nClear CTAs\nReferral Tracking\nGamified Incentives\nMarketers! Feel free to share your templates in the Forum.",
        "comments_details": [
            {
                "author": "Julie0xnana",
                "comment": "Here’s a step-by-step Quest Campaign template for HyperHack projects to guide users.\nHyperHack Quest: Join Our Journey & Earn Rewards!\nFollow these simple steps to explore our project, earn rewards, and join our community:\nStep 1: Follow & Retweet\nGo to our dedicated X account: Insert your projects’ X handles\nFOLLOW our account\nRETWEET our pinned HyperHack announcement tweet\nStep 2: Test Our dApp\nVisit our dApp:\nPerform ONE key action (e.g., connect wallet, make test transaction)\nTake a screenshot of your action as proof\nStep 3: Join Forum Discussion\nGo to our Metis Forum thread: Insert your Forum Showcase Link\nCLICK the referral link to register:Insert your Forum Referral Link\nClaim Your Rewards\nFirst 100 completers get exclusive NFT/role + token rewards\nWhy This Works\nClear CTAs\nReferral Tracking\nGamified Incentives\nMarketers! Feel free to share your templates in the Forum."
            },
            {
                "author": "han",
                "comment": "Are you ready to apply this Quest Campaign template to your project?"
            },
            {
                "author": "priyankg3",
                "comment": "Okay, i am currently exploring and working on this.. soon i will share the template"
            }
        ]
    },
    {
        "id": "2ec18d7c12e2582b",
        "topic_id": "5997",
        "title": "Calling Metis Marketers: Shape HyperHack Winners!",
        "url": "https://forum.ceg.vote/t/calling-metis-marketers-shape-hyperhack-winners/5997",
        "views": "",
        "comments": "3",
        "created_date": "Jun 27, 2025 6:08 am",
        "latest_activity": "Jun 27, 2025 2:32 pm",
        "content": "Gm Guild members! HyperHack teams need YOUR creativity to dominate the Spotlight Campaign:\n👉 Reach out NOW to HyperHack projects and pitch bold marketing strategies!\nYour Playground:\n• $500 Budget/Project\n• Full Creative Freedom with Quest campaigns, AMA airdrops, Twitter ads & custom tactics\n• Ecosystem-Wide Exposure across Metis channels\nCheck details in this annoucement:\nHyperHack Spotlight Campaign is Live\nHyperHack\n[Spotlight GIF (2).mp4 [video-to-gif output image]] Gm Metisians, the Spotlight Campaign is here to supercharge your HyperHack journey! We are giving selected project teams a chance at the $7500 bonus prize pool, $500 in marketing credit, access to guild talent, and the chance to earn tiered ecosystem rewards. The goal is to boost your visibility and help you grow real users. Apply here Campaign Objective To empower HyperHack teams to market their projects using a real budget. This is about…",
        "comments_details": [
            {
                "author": "Julie0xnana",
                "comment": "Gm Guild members! HyperHack teams need YOUR creativity to dominate the Spotlight Campaign:\n👉 Reach out NOW to HyperHack projects and pitch bold marketing strategies!\nYour Playground:\n• $500 Budget/Project\n• Full Creative Freedom with Quest campaigns, AMA airdrops, Twitter ads & custom tactics\n• Ecosystem-Wide Exposure across Metis channels\nCheck details in this annoucement:\nHyperHack Spotlight Campaign is Live\nHyperHack\n[Spotlight GIF (2).mp4 [video-to-gif output image]] Gm Metisians, the Spotlight Campaign is here to supercharge your HyperHack journey! We are giving selected project teams a chance at the $7500 bonus prize pool, $500 in marketing credit, access to guild talent, and the chance to earn tiered ecosystem rewards. The goal is to boost your visibility and help you grow real users. Apply here Campaign Objective To empower HyperHack teams to market their projects using a real budget. This is about…"
            },
            {
                "author": "han",
                "comment": "GM! Ready to connect with teams and share bold ideas for the Spotlight Campaign right away!"
            },
            {
                "author": "Julie0xnana",
                "comment": "Awesome!Glad to know it!"
            },
            {
                "author": "priyankg3",
                "comment": "Thanks for sharing this opportunity to showcase the skills"
            }
        ]
    }
]