[
    {
        "id": "19107ea94bbceb14",
        "topic_id": "6128",
        "title": "Fracture Point: Core Development Update – A Deep Dive into Our Web3 Foundation!",
        "url": "https://forum.ceg.vote/t/fracture-point-core-development-update-a-deep-dive-into-our-web3-foundation/6128",
        "views": "",
        "comments": "4",
        "created_date": "Jul 3, 2025 4:43 pm",
        "latest_activity": "Jul 15, 2025 10:16 pm",
        "content": "Live Link: https://prototypelobbyfpoint.netlify.app/\nWe are thrilled to unveil a monumental leap in the development of Fracture Point, our upcoming tactical TPS game. While our interactive lobby prototype provides a glimpse into the player experience, the true revolution lies in the meticulously crafted on-chain smart contracts and the robust Alith Architecture that power our innovative Proof of Play ecosystem.\nThis past month has been dedicated to building the immutable bedrock of Fracture Point’s Web3 capabilities, focusing on decentralized ownership, verifiable progression, and a player-driven economy.\nFracture Point: The Game Skill, Strategy, and True Digital Ownership\nFracture Point is designed as a high-octane, tactical third-person shooter that demands precision, strategic thinking, and teamwork. We are building a fiercely competitive environment where your skill and dedication are not just recognized, but are fundamentally integrated into the game’s core value system.\nPrepare for:\nIntense FPS Combat: Master diverse weapon loadouts and tactical maneuvers in dynamic, high-stakes engagements.\nDeep Customization: Personalize your agents and unique “variants”, making your mark on the battlefield.\nCompetitive Progression: Climb verifiable leaderboards, earn genuine rewards, and truly own your in-game achievements.\nThe Proof of Play Revolution: Rewarding Skill On-Chain\nOur commitment to Proof of Play is the defining feature of Fracture Point. This is not a concept; it’s a core, on-chain mechanism ensuring that your active engagement and skillful performance directly translate into verifiable, immutable value and progression within the game’s ecosystem.\nHow Proof of Play works in Fracture Point, powered by our contracts:\nVerifiable Achievements: Through the GameAchievementRegistry.sol contract (which is part of our ClaimManager system), your significant in-game achievements and progression milestones are immutably recorded on the blockchain. This provides transparent, provable recognition for your dedication and skill.\nSkill-Based Rewards: Our FPToken (FracturePoint Token), serving as XP, is minted to players based on their in-game performance (e.g., in Rift events), authorized exclusively by our trusted Alith Oracle. This ensures that rewards are earned through genuine gameplay.\nOn-Chain Progression & Badges: Your accumulated FPToken (XP) can then be burned via the ClaimManager contract to claim unique Rank Badges (ERC-721 NFTs) from the RankBadge.sol contract, signifying your seasonal achievements and skill tier. This process is entirely on-chain, making your rank verifiable and owned.\nPlayer-Driven Ecosystem: This interconnected system ensures that the game’s economy and value are directly influenced and shaped by the collective activity and skilled contributions of its player base.\nThis ensures Fracture Point rewards genuine skill, time invested, and proven performance, fostering a fair, transparent, and truly player-owned gaming experience.\nOur Core Architecture: Dedicated Smart Contracts and The Alith Framework\nThe true innovation behind Fracture Point lies in its robust, interconnected smart contracts and the strategic implementation of the Alith Architecture.\n1. The Alith Architecture: Our Tailored Blockchain Game Framework\nFracture Point leverages a bespoke implementation of the Alith Architecture. This is our comprehensive, modular framework meticulously designed to seamlessly integrate blockchain technology without compromising gameplay performance. It intelligently separates:\nOn-Chain Components: Our smart contracts (FPToken, RankBadge, ClaimManager) handle critical, immutable data like XP (FPToken) balances, Rank Badge (NFT) ownership, and verifiable achievements. This ensures decentralization, security, and provable ownership. The Alith Oracle acts as the trusted off-chain authority that bridges game outcomes to on-chain actions, such as distributing XP and authorizing badge claims.\nOff-Chain Backend: High-frequency game logic, real-time matchmaking, complex physics calculations, and volatile player statistics run on a performant off-chain backend. This guarantees a smooth, low-latency, and responsive gameplay experience, unburdened by blockchain transaction times and gas costs.\nSecure Interoperability: A robust and auditable communication layer ensures seamless and secure data flow between our contracts (governed by the Alith Oracle) and the off-chain game server.\n2. Fracture Point’s Core Smart Contracts (Audited & Interconnected)\nWe have successfully designed, developed, and prepared for deployment the foundational smart contracts that power Fracture Point’s Web3 economy and the Proof of Play mechanics. These contracts work in concert:\nFPToken.sol (FuturePoint Token) : This ERC-20 token represents XP within the Fracture Point ecosystem. It’s designed specifically for in-game progression:\nMinted by Alith Oracle: Only the designated alithOracle can mint new FPToken to players (e.g., via distributeRiftXP) based on game outcomes.\nBurned by ClaimManager: The ClaimManager contract is uniquely authorized to burn FPToken (XP) from player balances when they claim Rank Badges, creating a clear utility and economic loop.\nNon-Transferable (Player-to-Player): Significantly, direct player-to-player transfers of FPToken are disabled. This ensures FPToken remains a pure XP/progression token, preventing speculative trading and focusing its value on in-game achievement.\nRankBadge.sol (Fracture Point Rank Badge) : This ERC-721 NFT contract represents unique, season-specific Rank Badges that players can earn.\nMinted by ClaimManager: Only the ClaimManager contract is authorized to mint new Rank Badges to players, ensuring badges are earned through the proper Proof of Play mechanism.\nImmutable On-Chain Proof: Each badge is a unique NFT, providing verifiable, immutable proof of a player’s achievement for a given season and rank.\nClaimManager.sol : This is the central orchestrator contract, linking FPToken (XP) to Rank Badges (NFTs) and acting as the bridge to the Alith Oracle.\nManages Badge Claims: Players claim badges via ClaimManager, which then verifies their XP balance, burns the necessary FPToken from their account, and instructs RankBadge.sol to mint the new NFT.\nSeason Management: It tracks the currentSeason, ensuring players can only claim one badge per season.\nKarma Evaluation Requests: It facilitates requests for off-chain “Karma” evaluations by the Alith Oracle, hinting at deeper player behavior analysis.\nAlith Oracle Integration: It designates and relies on the alithOracle for authorizing badge claims and distributing rewards based on verified game data.\nThe code for these foundational contracts and the full Alith Architecture implementation can be reviewed in our public repository: https://github.com/SUPAMAN-dev/fracture-point-hyperhack\nYou can also verify our currently deployed contract addresses on the Hyperion testnet network: https://hyperion-testnet.metisdevops.link/\nFPToken Address: 0x4D23a7A2231624F1486CE0dE07C2fbF002f751B9\nClaimManager Address: 0x1Dab96d049e3ce56D51e6B0b149477927B897FFb\nRankBadge Address: 0xBB84D771f6aef01f00dEE45D9C9dF9C7ef9159e5\n(Note on GHC: While not currently on-chain, the fixed supply GHC currency, managed by multisig, will form the broader economic layer of Fracture Point. Its design ensures seamless future integration with our on-chain systems when the time is right, complementing the FPToken XP system.)\nLobby Prototype: The Player’s Interactive Gateway\nComplementing this powerful blockchain backend, our functional lobby prototype provides the intuitive player-facing interface. It allows players to:\nSeamlessly navigate between game modes, customization options, and personal profiles.\nExperience a polished UI/UX that aligns with Fracture Point’s futuristic theme.\nInteract with the foundational elements for future wallet integration, demonstrating how players will connect their on-chain assets to the game.\nLink to the prototype demo: https://youtu.be/aI_lQ6DcwEI\nEcosystem Interest: Strategic Offer from Plurality Web3\nAs a direct result of our development efforts during this Hyperion Hackathon, Fracture Point attracted partnership interest from leading Web3 infrastructure teams, most notably Plurality Web3, a startup pioneering embedded identity and authentication infrastructure for dApps.\nPlurality offered us a 12-month support package under their Partner Program, which includes:\n1:1 Engineering Support for seamless integration of user authentication and personalized in-game logic.\nFree infrastructure credits to cover authentication, user session tooling, and zkTLS-powered identity gating.\nUX Collaboration to co-design smooth onboarding flows without popups or clunky wallets particularly valuable for our casual-to-core player conversion goals.\nTheir outreach came after they reviewed Fracture Point’s Hyperion-backed Proof of Play system and saw clear potential for adoption in competitive Web3 gaming.\nWe view this offer as both validation of our underlying architecture and a strategic complement to the low-cost, high-throughput infrastructure that Hyperion enables. These ecosystem synergies affirm that Fracture Point is not just a playable demo, but a platform being taken seriously by early infrastructure players.\nWhat’s Next for Fracture Point?\nWith the core blockchain architecture, smart contracts, and the lobby interface firmly established, our immediate next steps are to integrate these powerful systems with the actual game engine to bring the full combat experience to life. This includes:\nBackend Game Logic Development: Building out the sophisticated off-chain systems for real-time matchmaking, secure player data management, and robust anti-cheat measures.\nGame Engine Integration: Connecting the lobby and backend systems to a game engine to render the immersive world and high-fidelity combat of Fracture Point.\nProof of Play Loop Refinement: Fully integrating in-game actions with our GameAchievementRegistry.sol via the Alith Oracle to ensure every skill-based action is verifiable and contributes to player progression and potential future GHC earnings.\nThis is an incredibly exciting time for Fracture Point. We invite you to join our community as we build the next evolution of TPS gaming, truly owned and driven by its players.\nJoin our community and stay updated!\nTelegram\nFracture Point\nYou can view and join @fracturepointlabs right away.\nDiscord\nJoin the Fracture Point Discord Server!\nCheck out the Fracture Point community on Discord – hang out with 2 other members and enjoy free voice and text chat.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!",
        "comments_details": [
            {
                "author": "i_am_supaman_lj",
                "comment": "Live Link: https://prototypelobbyfpoint.netlify.app/\nWe are thrilled to unveil a monumental leap in the development of Fracture Point, our upcoming tactical TPS game. While our interactive lobby prototype provides a glimpse into the player experience, the true revolution lies in the meticulously crafted on-chain smart contracts and the robust Alith Architecture that power our innovative Proof of Play ecosystem.\nThis past month has been dedicated to building the immutable bedrock of Fracture Point’s Web3 capabilities, focusing on decentralized ownership, verifiable progression, and a player-driven economy.\nFracture Point: The Game Skill, Strategy, and True Digital Ownership\nFracture Point is designed as a high-octane, tactical third-person shooter that demands precision, strategic thinking, and teamwork. We are building a fiercely competitive environment where your skill and dedication are not just recognized, but are fundamentally integrated into the game’s core value system.\nPrepare for:\nIntense FPS Combat: Master diverse weapon loadouts and tactical maneuvers in dynamic, high-stakes engagements.\nDeep Customization: Personalize your agents and unique “variants”, making your mark on the battlefield.\nCompetitive Progression: Climb verifiable leaderboards, earn genuine rewards, and truly own your in-game achievements.\nThe Proof of Play Revolution: Rewarding Skill On-Chain\nOur commitment to Proof of Play is the defining feature of Fracture Point. This is not a concept; it’s a core, on-chain mechanism ensuring that your active engagement and skillful performance directly translate into verifiable, immutable value and progression within the game’s ecosystem.\nHow Proof of Play works in Fracture Point, powered by our contracts:\nVerifiable Achievements: Through the GameAchievementRegistry.sol contract (which is part of our ClaimManager system), your significant in-game achievements and progression milestones are immutably recorded on the blockchain. This provides transparent, provable recognition for your dedication and skill.\nSkill-Based Rewards: Our FPToken (FracturePoint Token), serving as XP, is minted to players based on their in-game performance (e.g., in Rift events), authorized exclusively by our trusted Alith Oracle. This ensures that rewards are earned through genuine gameplay.\nOn-Chain Progression & Badges: Your accumulated FPToken (XP) can then be burned via the ClaimManager contract to claim unique Rank Badges (ERC-721 NFTs) from the RankBadge.sol contract, signifying your seasonal achievements and skill tier. This process is entirely on-chain, making your rank verifiable and owned.\nPlayer-Driven Ecosystem: This interconnected system ensures that the game’s economy and value are directly influenced and shaped by the collective activity and skilled contributions of its player base.\nThis ensures Fracture Point rewards genuine skill, time invested, and proven performance, fostering a fair, transparent, and truly player-owned gaming experience.\nOur Core Architecture: Dedicated Smart Contracts and The Alith Framework\nThe true innovation behind Fracture Point lies in its robust, interconnected smart contracts and the strategic implementation of the Alith Architecture.\n1. The Alith Architecture: Our Tailored Blockchain Game Framework\nFracture Point leverages a bespoke implementation of the Alith Architecture. This is our comprehensive, modular framework meticulously designed to seamlessly integrate blockchain technology without compromising gameplay performance. It intelligently separates:\nOn-Chain Components: Our smart contracts (FPToken, RankBadge, ClaimManager) handle critical, immutable data like XP (FPToken) balances, Rank Badge (NFT) ownership, and verifiable achievements. This ensures decentralization, security, and provable ownership. The Alith Oracle acts as the trusted off-chain authority that bridges game outcomes to on-chain actions, such as distributing XP and authorizing badge claims.\nOff-Chain Backend: High-frequency game logic, real-time matchmaking, complex physics calculations, and volatile player statistics run on a performant off-chain backend. This guarantees a smooth, low-latency, and responsive gameplay experience, unburdened by blockchain transaction times and gas costs.\nSecure Interoperability: A robust and auditable communication layer ensures seamless and secure data flow between our contracts (governed by the Alith Oracle) and the off-chain game server.\n2. Fracture Point’s Core Smart Contracts (Audited & Interconnected)\nWe have successfully designed, developed, and prepared for deployment the foundational smart contracts that power Fracture Point’s Web3 economy and the Proof of Play mechanics. These contracts work in concert:\nFPToken.sol (FuturePoint Token) : This ERC-20 token represents XP within the Fracture Point ecosystem. It’s designed specifically for in-game progression:\nMinted by Alith Oracle: Only the designated alithOracle can mint new FPToken to players (e.g., via distributeRiftXP) based on game outcomes.\nBurned by ClaimManager: The ClaimManager contract is uniquely authorized to burn FPToken (XP) from player balances when they claim Rank Badges, creating a clear utility and economic loop.\nNon-Transferable (Player-to-Player): Significantly, direct player-to-player transfers of FPToken are disabled. This ensures FPToken remains a pure XP/progression token, preventing speculative trading and focusing its value on in-game achievement.\nRankBadge.sol (Fracture Point Rank Badge) : This ERC-721 NFT contract represents unique, season-specific Rank Badges that players can earn.\nMinted by ClaimManager: Only the ClaimManager contract is authorized to mint new Rank Badges to players, ensuring badges are earned through the proper Proof of Play mechanism.\nImmutable On-Chain Proof: Each badge is a unique NFT, providing verifiable, immutable proof of a player’s achievement for a given season and rank.\nClaimManager.sol : This is the central orchestrator contract, linking FPToken (XP) to Rank Badges (NFTs) and acting as the bridge to the Alith Oracle.\nManages Badge Claims: Players claim badges via ClaimManager, which then verifies their XP balance, burns the necessary FPToken from their account, and instructs RankBadge.sol to mint the new NFT.\nSeason Management: It tracks the currentSeason, ensuring players can only claim one badge per season.\nKarma Evaluation Requests: It facilitates requests for off-chain “Karma” evaluations by the Alith Oracle, hinting at deeper player behavior analysis.\nAlith Oracle Integration: It designates and relies on the alithOracle for authorizing badge claims and distributing rewards based on verified game data.\nThe code for these foundational contracts and the full Alith Architecture implementation can be reviewed in our public repository: https://github.com/SUPAMAN-dev/fracture-point-hyperhack\nYou can also verify our currently deployed contract addresses on the Hyperion testnet network: https://hyperion-testnet.metisdevops.link/\nFPToken Address: 0x4D23a7A2231624F1486CE0dE07C2fbF002f751B9\nClaimManager Address: 0x1Dab96d049e3ce56D51e6B0b149477927B897FFb\nRankBadge Address: 0xBB84D771f6aef01f00dEE45D9C9dF9C7ef9159e5\n(Note on GHC: While not currently on-chain, the fixed supply GHC currency, managed by multisig, will form the broader economic layer of Fracture Point. Its design ensures seamless future integration with our on-chain systems when the time is right, complementing the FPToken XP system.)\nLobby Prototype: The Player’s Interactive Gateway\nComplementing this powerful blockchain backend, our functional lobby prototype provides the intuitive player-facing interface. It allows players to:\nSeamlessly navigate between game modes, customization options, and personal profiles.\nExperience a polished UI/UX that aligns with Fracture Point’s futuristic theme.\nInteract with the foundational elements for future wallet integration, demonstrating how players will connect their on-chain assets to the game.\nLink to the prototype demo: https://youtu.be/aI_lQ6DcwEI\nEcosystem Interest: Strategic Offer from Plurality Web3\nAs a direct result of our development efforts during this Hyperion Hackathon, Fracture Point attracted partnership interest from leading Web3 infrastructure teams, most notably Plurality Web3, a startup pioneering embedded identity and authentication infrastructure for dApps.\nPlurality offered us a 12-month support package under their Partner Program, which includes:\n1:1 Engineering Support for seamless integration of user authentication and personalized in-game logic.\nFree infrastructure credits to cover authentication, user session tooling, and zkTLS-powered identity gating.\nUX Collaboration to co-design smooth onboarding flows without popups or clunky wallets particularly valuable for our casual-to-core player conversion goals.\nTheir outreach came after they reviewed Fracture Point’s Hyperion-backed Proof of Play system and saw clear potential for adoption in competitive Web3 gaming.\nWe view this offer as both validation of our underlying architecture and a strategic complement to the low-cost, high-throughput infrastructure that Hyperion enables. These ecosystem synergies affirm that Fracture Point is not just a playable demo, but a platform being taken seriously by early infrastructure players.\nWhat’s Next for Fracture Point?\nWith the core blockchain architecture, smart contracts, and the lobby interface firmly established, our immediate next steps are to integrate these powerful systems with the actual game engine to bring the full combat experience to life. This includes:\nBackend Game Logic Development: Building out the sophisticated off-chain systems for real-time matchmaking, secure player data management, and robust anti-cheat measures.\nGame Engine Integration: Connecting the lobby and backend systems to a game engine to render the immersive world and high-fidelity combat of Fracture Point.\nProof of Play Loop Refinement: Fully integrating in-game actions with our GameAchievementRegistry.sol via the Alith Oracle to ensure every skill-based action is verifiable and contributes to player progression and potential future GHC earnings.\nThis is an incredibly exciting time for Fracture Point. We invite you to join our community as we build the next evolution of TPS gaming, truly owned and driven by its players.\nJoin our community and stay updated!\nTelegram\nFracture Point\nYou can view and join @fracturepointlabs right away.\nDiscord\nJoin the Fracture Point Discord Server!\nCheck out the Fracture Point community on Discord – hang out with 2 other members and enjoy free voice and text chat.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!"
            },
            {
                "author": "Rohit",
                "comment": "This is such a wonderful project, but I can’t but help!\nLooking through your architecture, what is the major role of alith, you talked about integration with Alith but you have to paint it more visibly for me.\nWhat does alith do on fracture point actually?"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "Thanks for the kind words! Really appreciate the interest and great question.\nAt its core, Fracture Point is about creating a truly fair and transparent gaming ecosystem, where skill and effort are what get rewarded, not exploits or shortcuts.\nThat’s exactly where Alith comes in.\nIn a typical game, especially online shooters, you always run into players who cheat, farm, or abuse systems to win. That destroys trust. What we’re doing differently in Fracture Point is putting integrity at the heart of our reward system.\nAlith acts as the intelligent game moderator. It monitors every match every Rift through the Unity backend, evaluating outcomes, watching for exploits, and making sure only fair wins are rewarded. No shady leaderboard climbs. No rigged XP farming.\nThen, using its special permissions (as the alithOracle in our ClaimManager contract), Alith sends reward signals on-chain, issuing XP (FPToken) to players who truly earned them. That XP can then be used to claim seasonal badges and other progression rewards all verifiable and immutable.\nOver time, Alith learns from gameplay, gets smarter at spotting abusers, and helps us maintain a competitive but honest battlefield.\nThis is the first real merge of Web2-style live gameplay with Web3 reward mechanics, and we’re doing it in a way that makes sense to real players. We want trust, transparency, and fun and Alith helps make that possible."
            },
            {
                "author": "NOWOLO",
                "comment": "Wow, it’s pretty great what you built.\nDo you have any plan to MVP?"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "I think you have a similar question earlier, and I answered on the other post already. We have a goal for MVP, but we are currently putting the things we would need in place to further with our development. We are in need of a unity game dev and community growth strategist. They will be highly required for our project scaling up if we have the support of the community to having a spot in the hyperhack top rank. We already drafted the next line of action towards scaling."
            }
        ]
    },
    {
        "id": "2b77aee37978ba49",
        "topic_id": "4880",
        "title": "Community Suggestions",
        "url": "https://forum.ceg.vote/t/community-suggestions/4880",
        "views": "",
        "comments": "11",
        "created_date": "May 28, 2025 9:46 am",
        "latest_activity": "Jul 15, 2025 10:08 pm",
        "content": "Have ideas to improve the forum? Want to suggest new categories, features, rules, or events?\nDrop your thoughts here!\nWhether it’s a small tweak or a big improvement, every suggestion is welcome.\nLet’s build this space together—transparent, inclusive, and community-driven.",
        "comments_details": [
            {
                "author": "priyankg3",
                "comment": "Have ideas to improve the forum? Want to suggest new categories, features, rules, or events?\nDrop your thoughts here!\nWhether it’s a small tweak or a big improvement, every suggestion is welcome.\nLet’s build this space together—transparent, inclusive, and community-driven."
            },
            {
                "author": "han",
                "comment": "I think users should ask everything here and share their ideas openly. Most importantly, I’d love to see high-quality content and informative articles focused on Hyperion and LazAI."
            },
            {
                "author": "ravisharma",
                "comment": "thanks for starting this topic, community suggestion is very much needed in the forum"
            },
            {
                "author": "Aryanzutshi",
                "comment": "Hi\n@priyankg3\nI have two key suggestions that I believe would really improve the forum experience:\nAbility to Create New Guilds: I’d love to have the option to create my own guild, focused on smart contract security and best practices in Web3 security. It would be a great way to gather like-minded builders, share content, and collaborate on the ecosystem.\nA seperate section for documentation in the forum: When I joined Hyperhack, I struggled to find organized documentation for Metis, LazAI, and Alith. A dedicated section or hub for all docs would be a big help for newcomers like me."
            },
            {
                "author": "priyankg3",
                "comment": "Hello\n@pavel\n, How are you?\nI have a quick suggestion for the Vibe Sessions , what if we run a community poll on the Forum where people can vote on which project they’d like to see featured next?"
            },
            {
                "author": "pavel",
                "comment": "Hey priyankspartans, thank you for the suggestion. Feel free to create a poll for this. Definitely looking for more projects to join!"
            },
            {
                "author": "abhiraj2404",
                "comment": "Hi Team,\nI’m one of the Hyperhack project initiators working on a project called AgentHub. Since I created the original forum post, I’ve been assigned the “HyperHack Project Initiator” tag, which gives me access to tag-specific private groups and updates.\nHowever, my co-founder — who’s actively building the project alongside me — doesn’t have the same tag and can’t access those private discussions or updates. We recently discovered this issue after the post about Spotlight Campaign.\nIs there a way to either:\nAdd him to the same private groups/chats, or\nAssign him the Project Initiator tag as well?\nWe want to make sure we’re both receiving the same updates and can coordinate effectively with the community."
            },
            {
                "author": "Norbert",
                "comment": "Noted, yes i am pinging our Devrel team to add him"
            },
            {
                "author": "pavel",
                "comment": "Can you please share his ID and I’ll add him in"
            },
            {
                "author": "abhiraj2404",
                "comment": "Thank you for the response !\nMy co-founder’s ID is\n@Abhijeet1005"
            },
            {
                "author": "Abhijeet1005",
                "comment": "Hey Pavel,\nThis is my ID, please can you assign the tag."
            },
            {
                "author": "1LLoR1",
                "comment": "If everyone has the ability to create new guilds, most will cóntitute nuisance with that. Quality is sometimes aligned with scarcity."
            }
        ]
    },
    {
        "id": "c682b466f2f0920b",
        "topic_id": "4419",
        "title": "Yazdığım yazılar kendi kendine değişmekte örneğin aşağıdaki içerik değişmiş",
        "url": "https://forum.ceg.vote/t/yazdigim-yazilar-kendi-kendine-degismekte-ornegin-asagidaki-icerik-degismis/4419",
        "views": "",
        "comments": "5",
        "created_date": "May 20, 2025 5:36 pm",
        "latest_activity": "Jul 15, 2025 8:32 pm",
        "content": "Bazen belli konular hakkında fikirler yazıyorum paylaşımdan sonra kontrol ettiğimde ise yazılar değişmiş oluyor eklemeler çıkarmalar olmakta bu problemi birçok kez yaşadım iletiyi silip tekrardan yazıyorum bazen defalarca oluyor\n(Şu anki paylaştığım içerik yine değişti birkaç defa silip yazdıktan sonra düzeldi)",
        "comments_details": [
            {
                "author": "Emreahmet12",
                "comment": "Bazen belli konular hakkında fikirler yazıyorum paylaşımdan sonra kontrol ettiğimde ise yazılar değişmiş oluyor eklemeler çıkarmalar olmakta bu problemi birçok kez yaşadım iletiyi silip tekrardan yazıyorum bazen defalarca oluyor\n(Şu anki paylaştığım içerik yine değişti birkaç defa silip yazdıktan sonra düzeldi)"
            },
            {
                "author": "Emreahmet12",
                "comment": "Teşekkürler dediğin şekilde yapacağım ama iki gündür sürekli değişiklikler yaşanıyor"
            },
            {
                "author": "Emreahmet12",
                "comment": "Teşekkürler dediğiniz şekilde yapacak az önce size yazdığım yorum tekrardan kendiliğinden değişti"
            },
            {
                "author": "Keir",
                "comment": "sanırım fazla spamdan oluyor ben de analmadım"
            },
            {
                "author": "1LLoR1",
                "comment": "Woukd be great if you used English and save a hell of time visiting Google translate"
            },
            {
                "author": "1LLoR1",
                "comment": "But I am truely Imprrssed"
            }
        ]
    },
    {
        "id": "d1275896a84084e1",
        "topic_id": "6012",
        "title": "Fracture Point Progress Report – Proof of Play Architecture Live",
        "url": "https://forum.ceg.vote/t/fracture-point-progress-report-proof-of-play-architecture-live/6012",
        "views": "",
        "comments": "1",
        "created_date": "Jun 27, 2025 8:53 pm",
        "latest_activity": "Jul 15, 2025 8:12 pm",
        "content": "Hey everyone,\nWe’re excited to share a full status update on Fracture Point, our on-chain shooter project powered by verifiable Proof of Play now live on the Hyperion Testnet.\nCore Milestones Completed:\n• Smart Contracts Deployed\nOur foundational contracts (FPToken, RankBadge, and ClaimManager) are deployed and functional on Hyperion. These power token distribution and player rank progression, all based on verified activity.\n• Alith AI Integration Implemented\nWe’ve aligned our ClaimManager with the latest structure of Alith’s verifiable computing flow, enabling zk-backed claim validation for real player actions. Interactions with IDataRegistry, IVerifiedComputing, and related contracts are now wired into our claim submission logic.\n• Architecture Demonstration\nWe’ve adapted the structure and logic from the official Alith reference repo to clearly show how Fracture Point leverages AI inference within its Proof of Play system.\nhttps://github.com/SUPAMAN-dev/fracture-point-hyperhack\nPrototype UI Progress\n• We’ve started developing a web-based prototype lobby, which helps us simulate early game flow including variant display, basic player submission, and contract interaction.\nWhile not fully wired for end-to-end user flows yet, it demonstrates the core experience we’re building.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!\n• We’ve also begun introducing our Variants, showcasing early character visuals as a way to build the world and reward identity within the ecosystem.\nCurrent Gaps\n• Unity Developers Needed: We’re currently short on dedicated Unity talent and actively seeking 2 developers to push forward actual gameplay builds.\n• UI/UX Scope: Due to resource limits, our current frontend is a self-built mockup. It lays the groundwork for future polish once we expand the team or secure support.\nSpotlight Campaign\nWe’ve officially applied for the HyperHack Spotlight Campaign to begin telling our story and engaging the broader community. We’re focused on growing visibility, onboarding talent, and completing the final pieces of this vision.\nFeel free to reach out if you want to test our contracts, contribute, or explore how Alith is being used in a live project. More updates and tutorials coming soon!",
        "comments_details": [
            {
                "author": "i_am_supaman_lj",
                "comment": "Hey everyone,\nWe’re excited to share a full status update on Fracture Point, our on-chain shooter project powered by verifiable Proof of Play now live on the Hyperion Testnet.\nCore Milestones Completed:\n• Smart Contracts Deployed\nOur foundational contracts (FPToken, RankBadge, and ClaimManager) are deployed and functional on Hyperion. These power token distribution and player rank progression, all based on verified activity.\n• Alith AI Integration Implemented\nWe’ve aligned our ClaimManager with the latest structure of Alith’s verifiable computing flow, enabling zk-backed claim validation for real player actions. Interactions with IDataRegistry, IVerifiedComputing, and related contracts are now wired into our claim submission logic.\n• Architecture Demonstration\nWe’ve adapted the structure and logic from the official Alith reference repo to clearly show how Fracture Point leverages AI inference within its Proof of Play system.\nhttps://github.com/SUPAMAN-dev/fracture-point-hyperhack\nPrototype UI Progress\n• We’ve started developing a web-based prototype lobby, which helps us simulate early game flow including variant display, basic player submission, and contract interaction.\nWhile not fully wired for end-to-end user flows yet, it demonstrates the core experience we’re building.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!\n• We’ve also begun introducing our Variants, showcasing early character visuals as a way to build the world and reward identity within the ecosystem.\nCurrent Gaps\n• Unity Developers Needed: We’re currently short on dedicated Unity talent and actively seeking 2 developers to push forward actual gameplay builds.\n• UI/UX Scope: Due to resource limits, our current frontend is a self-built mockup. It lays the groundwork for future polish once we expand the team or secure support.\nSpotlight Campaign\nWe’ve officially applied for the HyperHack Spotlight Campaign to begin telling our story and engaging the broader community. We’re focused on growing visibility, onboarding talent, and completing the final pieces of this vision.\nFeel free to reach out if you want to test our contracts, contribute, or explore how Alith is being used in a live project. More updates and tutorials coming soon!"
            },
            {
                "author": "NOWOLO",
                "comment": "How about the game engine itself?\nWhat about that, I have not seen any form of consideration on that."
            }
        ]
    },
    {
        "id": "68d501bcff3b544b",
        "topic_id": "4821",
        "title": "Metis is a Layer 2 built on Ethereum",
        "url": "https://forum.ceg.vote/t/metis-is-a-layer-2-built-on-ethereum/4821",
        "views": "",
        "comments": "2",
        "created_date": "May 27, 2025 4:26 am",
        "latest_activity": "Jul 15, 2025 8:01 pm",
        "content": "Metis is a Layer 2 built on Ethereum and also a multi-network ecosystem driven by the revolutionary Metis SDK. Through its dual-chain architecture (Andromeda for secure and universal dApps, and Hyperion for a high-performance, AI-optimized execution layer), Metis is constructing the future of decentralized infrastructure. The two chains operate seamlessly with each other, enabling developers to deploy scalable, efficient, and intelligent Web3 applications in fields such as DeFi, gaming, and AI.",
        "comments_details": [
            {
                "author": "jieki1",
                "comment": "Metis is a Layer 2 built on Ethereum and also a multi-network ecosystem driven by the revolutionary Metis SDK. Through its dual-chain architecture (Andromeda for secure and universal dApps, and Hyperion for a high-performance, AI-optimized execution layer), Metis is constructing the future of decentralized infrastructure. The two chains operate seamlessly with each other, enabling developers to deploy scalable, efficient, and intelligent Web3 applications in fields such as DeFi, gaming, and AI."
            },
            {
                "author": "han",
                "comment": "Metis is cooking with that dual-chain setup. love the AI-ready vision. Big things coming"
            },
            {
                "author": "NOWOLO",
                "comment": "Are there games developed on the chain already?"
            }
        ]
    },
    {
        "id": "88780eaae5e1d035",
        "topic_id": "6276",
        "title": "What AI is missing",
        "url": "https://forum.ceg.vote/t/what-ai-is-missing/6276",
        "views": "",
        "comments": "4",
        "created_date": "Jul 10, 2025 3:41 pm",
        "latest_activity": "Jul 15, 2025 6:39 pm",
        "content": "Honestly, the way DATs combine usage, ownership, and revenue sharing might just be what AI data was missing. Anyone else thinking of building around this?",
        "comments_details": [
            {
                "author": "Gann",
                "comment": "Honestly, the way DATs combine usage, ownership, and revenue sharing might just be what AI data was missing. Anyone else thinking of building around this?"
            },
            {
                "author": "Ghostt",
                "comment": "It’s a powerful idea, no doubtbut we need to interrogate it before rushing to build.\nYes, DATs promise usage-based revenue and ownership, but there are some non-trivial challenges baked into this vision:\nQuality Control vs. Open Contribution\nIf anyone can contribute data and expect compensation, what safeguards exist to prevent low-quality, adversarial, or even toxic datasets from flooding the network? Decentralized doesn’t mean unfiltered.\nAttribution is a Nightmare\nHow do we accurately track which datasets directly influenced a model’s output especially in multi-source training scenarios? Without granular attribution, revenue-sharing quickly becomes speculative or unfair.\nGaming the System\nTokenized rewards always open the door to manipulation. Think botnets uploading synthetic data or feedback loops designed solely to trigger payout thresholds. This needs aggressive prevention design.\nLegal & Ethical Landmines\nIf a user uploads copyrighted or sensitive data, who’s liable? The protocol? The contributors? The downstream AI project? Decentralization doesn’t erase legal responsibility.\nRevenue Distribution Models Are Still Vague\nHow exactly will revenue be split between thousands of contributors? Based on access? Utility? Frequency of use? These formulas will need to be not only transparent but also defensible under scrutiny.h\nSo yes DATs might offer a new design space, but turning them into a reliable, abuse-resistant, and value-aligned mechanism for AI is far from solved.\nBuilders should proceed but with eyes wide open."
            },
            {
                "author": "Ghostt",
                "comment": "Do you mind we mumble ideas together?\nWith the highlighted problems if solved we could build something truely exemptional. What are your niche?"
            },
            {
                "author": "Gann",
                "comment": "Hehehe… sounds good. No particular preference anything cool and unique will do."
            },
            {
                "author": "Ghostt",
                "comment": "i have thought about building an Ai that would help sports betting. but the problem mostly is the data that would help make this decisions a lil more accurately. there is where i see proper DATs usage and leveraging would coming handy. what do u think?"
            }
        ]
    },
    {
        "id": "4931d4501f5b375f",
        "topic_id": "6375",
        "title": "Premium Wallet Campaign",
        "url": "https://forum.ceg.vote/t/premium-wallet-campaign/6375",
        "views": "",
        "comments": "0",
        "created_date": "Jul 15, 2025 6:30 pm",
        "latest_activity": null,
        "content": "JUL\n15\nPremium Wallet Rewards Campaign\nPublic\n·\nCreated by\nSheyda\nYesterday 6:16 PM → Thu, Aug 7\n2\nPremium Wallet Rewards Campaign Announcement\nWe’re thrilled to announce the Premium Wallet Rewards Campaign, where 25 lucky users will be whitelisted for exclusive gas-free transactions on Hyperion’s Mainnet when it launches! These top users will enjoy 12 months of complimentary gas on Hyperion, enhancing their experience as they interact with our AI-powered Web3 platform.\nCampaign Timeline:\nEligibility Period: Ongoing until the end of the Hyperhack hackathon on August 7.\nRebates: Start once the mainnet is live and continue for 12 months\nUsers are invited to meet the eligibility criteria today by interacting with the Forum and later by testing dApps on the Hyperion testnet.\nRewards:\nThe 25 Premium wallets will receive:\nGas rebate $50/monthly\nGas-free transactions for 12 months\nAll rebates will be on the Hyperion mainnet and in METIS tokens\nHow to claim the rewards:\nMonthly, users will apply for a gas fee rebate by submitting the same wallet address through a form, and Metis devs will review and distribute a monthly rebate of up to $50 per person in METIS tokens on Hyperion.\nTo boost your score, you need to engage with the forum and test dApps.\nIf there are more than 25 eligible wallets, we select the winners based on their forum number of badges, feedback given to projects, and projects’ testing.\nThe more dApp interaction, forum valid posts and feedback, the greater the chance of being among the winners.\nPlease note that the Forum policy does not count spam-like posts or AI-generated feedback (such as ChatGPT-generated feedback), and you’ll be banned.\nPrimary Eligibility criteria:\nTo get started and be eligible for this exciting reward, follow these steps:\nAchieve Trust Level 2 within the forum. (Details below)\nInteract with at least 50 dApps through HyperHack Stress-testing on the Hyperion testnet\nUse the same wallet for all activities within the HyperHack testing phase.\nJoin @MetisL2 on X to stay up-to-date with the announcements.\nHow to Achieve Trust Level 2 in the Hyperion Forum:\nTo qualify for the Premium Wallet rewards, you need to reach Trust Level 2 within the Hyperion Forum by completing the following:\nVisit the forum for at least 15 days (not sequentially)\nCast at least 1 like\nReceive at least 1 like\nReply to at least 3 different topics\nEnter at least 20 topics\nRead at least 100 posts\nSpend a total of 60 minutes reading posts\nStress testing landing page: Live Apps - Metis iDAO Forum",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "JUL\n15\nPremium Wallet Rewards Campaign\nPublic\n·\nCreated by\nSheyda\nYesterday 6:16 PM → Thu, Aug 7\n2\nPremium Wallet Rewards Campaign Announcement\nWe’re thrilled to announce the Premium Wallet Rewards Campaign, where 25 lucky users will be whitelisted for exclusive gas-free transactions on Hyperion’s Mainnet when it launches! These top users will enjoy 12 months of complimentary gas on Hyperion, enhancing their experience as they interact with our AI-powered Web3 platform.\nCampaign Timeline:\nEligibility Period: Ongoing until the end of the Hyperhack hackathon on August 7.\nRebates: Start once the mainnet is live and continue for 12 months\nUsers are invited to meet the eligibility criteria today by interacting with the Forum and later by testing dApps on the Hyperion testnet.\nRewards:\nThe 25 Premium wallets will receive:\nGas rebate $50/monthly\nGas-free transactions for 12 months\nAll rebates will be on the Hyperion mainnet and in METIS tokens\nHow to claim the rewards:\nMonthly, users will apply for a gas fee rebate by submitting the same wallet address through a form, and Metis devs will review and distribute a monthly rebate of up to $50 per person in METIS tokens on Hyperion.\nTo boost your score, you need to engage with the forum and test dApps.\nIf there are more than 25 eligible wallets, we select the winners based on their forum number of badges, feedback given to projects, and projects’ testing.\nThe more dApp interaction, forum valid posts and feedback, the greater the chance of being among the winners.\nPlease note that the Forum policy does not count spam-like posts or AI-generated feedback (such as ChatGPT-generated feedback), and you’ll be banned.\nPrimary Eligibility criteria:\nTo get started and be eligible for this exciting reward, follow these steps:\nAchieve Trust Level 2 within the forum. (Details below)\nInteract with at least 50 dApps through HyperHack Stress-testing on the Hyperion testnet\nUse the same wallet for all activities within the HyperHack testing phase.\nJoin @MetisL2 on X to stay up-to-date with the announcements.\nHow to Achieve Trust Level 2 in the Hyperion Forum:\nTo qualify for the Premium Wallet rewards, you need to reach Trust Level 2 within the Hyperion Forum by completing the following:\nVisit the forum for at least 15 days (not sequentially)\nCast at least 1 like\nReceive at least 1 like\nReply to at least 3 different topics\nEnter at least 20 topics\nRead at least 100 posts\nSpend a total of 60 minutes reading posts\nStress testing landing page: Live Apps - Metis iDAO Forum"
            }
        ]
    },
    {
        "id": "03df884f7ef57e01",
        "topic_id": "5649",
        "title": "Dogex: Simplified Decentralized Perpetuals DEX on Hyperion",
        "url": "https://forum.ceg.vote/t/dogex-simplified-decentralized-perpetuals-dex-on-hyperion/5649",
        "views": "",
        "comments": "27",
        "created_date": "Jun 14, 2025 6:42 pm",
        "latest_activity": "Jul 15, 2025 6:03 pm",
        "content": "Project Name\nDogex: Simplified Decentralized Perpetuals DEX on Hyperion\nProblem Statement\nMost decentralized perpetual exchanges are complicated and overwhelming, with dense interfaces and confusing features that deter new and retail traders. This complexity blocks broader adoption of perpetual trading in DeFi.\nSolution Overview\nDogex is a minimalist, easy-to-use perpetual DEX built on Hyperion’s cutting-edge blockchain platform. Leveraging Hyperion’s parallel transaction execution and onchain AI capabilities, Dogex offers ultra-fast, reliable trade processing and intelligent risk management. The platform’s simple UI and AI-driven alerts make perpetual trading accessible and straightforward for everyone.\nProject Description\nDogex delivers a decentralized perpetual futures exchange optimized for simplicity, speed, and scalability by building on Hyperion’s next-gen infrastructure. Hyperion’s parallelized transactions enable ultra-low latency order execution and state synchronization 10x faster than traditional chains. Integrated onchain AI powers real-time risk assessment and liquidation alerts, helping users manage positions confidently without complexity. Dogex’s clean, intuitive interface focuses on essential features like one-click position entry/exit, clear margin info, and fast updates. Mobile-friendly and designed for all user levels, Dogex breaks down barriers to perpetual trading by combining powerful Hyperion tech with a smooth, easy experience.\nCommunity Engagement Features\nFair Launch Token Model:\nUsers can buy Dogex tokens only by spending fees accrued on the platform\nToken issuance follows an infinite curve model similar to GMX and Solana projects, ensuring fair and gradual distribution\nThis model aligns incentives and rewards active traders who contribute to platform liquidity and usage\nTestable Features:\nOpening and closing positions\nMargin adjustments\nAI-powered risk alerts\nReward claiming\nPoints System:\nTrades: 10 points\nAI alert interaction: 5 points\nMargin changes: 7 points\nReferrals: 15 points\nGamification:\nPoints unlock badges, leaderboard rankings, and token rewards\nEncourages active use and onboarding\nUser Onboarding:\nStepwise tutorials and gradual feature unlocking\nHelps new traders quickly gain confidence",
        "comments_details": [
            {
                "author": "mrwagmicto",
                "comment": "Project Name\nDogex: Simplified Decentralized Perpetuals DEX on Hyperion\nProblem Statement\nMost decentralized perpetual exchanges are complicated and overwhelming, with dense interfaces and confusing features that deter new and retail traders. This complexity blocks broader adoption of perpetual trading in DeFi.\nSolution Overview\nDogex is a minimalist, easy-to-use perpetual DEX built on Hyperion’s cutting-edge blockchain platform. Leveraging Hyperion’s parallel transaction execution and onchain AI capabilities, Dogex offers ultra-fast, reliable trade processing and intelligent risk management. The platform’s simple UI and AI-driven alerts make perpetual trading accessible and straightforward for everyone.\nProject Description\nDogex delivers a decentralized perpetual futures exchange optimized for simplicity, speed, and scalability by building on Hyperion’s next-gen infrastructure. Hyperion’s parallelized transactions enable ultra-low latency order execution and state synchronization 10x faster than traditional chains. Integrated onchain AI powers real-time risk assessment and liquidation alerts, helping users manage positions confidently without complexity. Dogex’s clean, intuitive interface focuses on essential features like one-click position entry/exit, clear margin info, and fast updates. Mobile-friendly and designed for all user levels, Dogex breaks down barriers to perpetual trading by combining powerful Hyperion tech with a smooth, easy experience.\nCommunity Engagement Features\nFair Launch Token Model:\nUsers can buy Dogex tokens only by spending fees accrued on the platform\nToken issuance follows an infinite curve model similar to GMX and Solana projects, ensuring fair and gradual distribution\nThis model aligns incentives and rewards active traders who contribute to platform liquidity and usage\nTestable Features:\nOpening and closing positions\nMargin adjustments\nAI-powered risk alerts\nReward claiming\nPoints System:\nTrades: 10 points\nAI alert interaction: 5 points\nMargin changes: 7 points\nReferrals: 15 points\nGamification:\nPoints unlock badges, leaderboard rankings, and token rewards\nEncourages active use and onboarding\nUser Onboarding:\nStepwise tutorials and gradual feature unlocking\nHelps new traders quickly gain confidence"
            },
            {
                "author": "han",
                "comment": "This is a very exciting initiative and looks incredibly user-friendly!\nAs a potential user, my question is:\nDogex’s simplicity is a huge plus, especially for newcomers. But with perpetuals, managing risk is key. How does the AI-powered alert system work in real-time during volatile market conditions?\nCan users customize these alerts based on their risk appetite (e.g., liquidation thresholds or price movements), and are there safeguards in place to avoid spammy or overly sensitive notifications?"
            },
            {
                "author": "priyankg3",
                "comment": "hello\n@mrwagmicto\n, What specific UI/UX decisions did you take to make Dogex more beginner-friendly compared to existing perpetual DEXs?\nHow does Dogex handle liquidation risk in volatile market conditions—especially during sharp spikes or network congestion?"
            },
            {
                "author": "mrwagmicto",
                "comment": "Real-Time AI Alerts: Dogex monitors market volatility and your positions 24/7, sending smart alerts for risks like liquidation, big price swings, or funding changes. Like monitor it once per second or smth, I tihnk it couldn’t be super real time\nFully Customizable & Spam-Free: Users set their own alert rules (e.g. price % moves, margin levels), with built-in safeguards to avoid spammy or repetitive notifications."
            },
            {
                "author": "han",
                "comment": "Sounds useful if tuned well real-time is ambitious, but even near real-time with smart filters could make a big difference. Curious to see how accurate and non-spammy it stays in practice."
            },
            {
                "author": "mrwagmicto",
                "comment": "1. Beginner-Friendly UI/UX Decisions:\n1-click Trading Mode: Simplified interface with no clutter — just set size and direction.\nVisual Risk Meter: Real-time margin health bar with color-coded alerts makes liquidation risk easy to understand.\n2. Liquidation Risk Management During Volatility:\nAI-Powered Risk Alerts: Real-time monitoring of price + position risk, with early warnings before liquidation zones.\nAuto-Deleveraging Logic: If network congestion hits, Dogex can auto-partially close risky positions to protect users."
            },
            {
                "author": "mrwagmicto",
                "comment": "Yeah, in theory it all sounds great, but we need some real, practical results to see how it actually works with live positions"
            },
            {
                "author": "han",
                "comment": "Exactly, theory’s solid, but live stress tests will show if it holds up. Let’s see how it performs under real market pressure."
            },
            {
                "author": "priyankg3",
                "comment": "Appreciate the detailed breakdown! The 1-click trading and visual risk meter definitely feel like a huge win for onboarding.\nKeen to try it out in a live market soon!"
            },
            {
                "author": "mrwagmicto",
                "comment": "update: we create a prototype with components structure. Now it’s a base point of our project:\nmiro.com\nSprint Planning\nworing on details rn"
            },
            {
                "author": "mrwagmicto",
                "comment": "miro.com\nSprint Planning\nupdated wireframe with details, it’s time to start a vibe codding!"
            },
            {
                "author": "CrisMetis",
                "comment": "Cool idea, and a DEX that uses the speed of Hyperion to build something better is obviously a great move. Why should trading be complicated when tech like AI and Hyperion can make it smooth, right???"
            },
            {
                "author": "mrwagmicto",
                "comment": "yeah it can be much easier then we used to see"
            },
            {
                "author": "mrwagmicto",
                "comment": "Today I dove into the perpetual DEX market.\nIt’s my first time building a perp DEX — but with 10 years in dev, I was able to make a few important decisions.\nThe foundation of my project will be based on GMX, a battle-tested perp protocol with open-source MIT-licensed contracts.\nWhy?\nReliable\nOpen\nProven\nFlexible\nI’m not affiliated with GMX. I’m simply leveraging their codebase as a solid technical base — and improving it with a much better interface + product vision.\nThis is the power of open source.\nI also sketched the first simple mockup of the UI — just a few blocks for now. The MVP will be laser-focused on clarity and simplicity."
            },
            {
                "author": "priyankg3",
                "comment": "Will wait for the first look for UI of DEX"
            },
            {
                "author": "mrwagmicto",
                "comment": "Today, I focused on the technical side of the project. I think over the next few days (or even weeks), I’ll mostly be coding — and also trying to learn how to clearly communicate what I’ve been working on.\nI launched the frontend of GMX and played with it, sketched out its future architecture, explored what I’ll need to implement it, and created an implementation plan."
            },
            {
                "author": "mrwagmicto",
                "comment": "Today I focused on technical research:\nRevisited GMX contracts\nStudied the basics of perpetual futures trading to better understand the market side\nExperimented with opening positions\nI also launched the first mini-marketing effort to start building the initial community:\nCreated a Twitter for Dogex, and started looking for marketers to help grow the first community."
            },
            {
                "author": "mrwagmicto",
                "comment": "project’s twitter: https://x.com/DogexPerps\nceo: https://x.com/mr_wagmi_cto\nfeel free to subsribe and mention that you’re from Hyperion some way I wanna subscribe all projects and ceos"
            },
            {
                "author": "mrwagmicto",
                "comment": "Today I’m diving deep into GMX v1 vs v2 to decide what’s better for my MVP.\nMy key criteria (in order of priority):\nReliability\nEase of dev & fast iteration\nFlexibility for custom logic\nFull understanding of the codebase\nThis first version must be simple, fast & clear. Let’s go"
            },
            {
                "author": "mrwagmicto",
                "comment": "Crypto Startup MVP in 30 Days – 1st WEEK\n1st week down. Here’s everything I did in 7 days building from scratch:\n1. Shifted my mindset\nFrom “quick cash grab” → to building a startup that creates long-term sustainable value & income.\n2. Launched my Twitter + started building in public\nShowed up every day. Shared progress.\nThis is my first step into real startup marketing.\n3. Explored tons of ideas → picked one that clicks\nThe one that excites me. The one I want to wake up for.\n4. Designed first UI mockups\nGot the visual side of the product moving. First screen = first step to real product.\n5. Understood the tech architecture\nHow everything connects: smart contracts, data flows, frontend logic.\n6. Learned by walking in the user’s shoes\nI tried trading perps.\nI tried providing liquidity.\nNow I feel what my user needs. That’s gold.\n7. Made big tech decisions\nAfter deep research, I chose GMX V1 as the base. It’s stable, simple, well-documented. Perfect for MVP.\n8. Realized the scale of the journey\nIt’s long.\nIt’s exciting.\nAnd I’m all in.\nWhat went well:\nI made decisions with clarity\nI worked on my mindset\nI found a vision that gives me fire in the eyes\nMistakes I made:\nDived too deep into tech too early\nShould’ve explored UX flows & user journey before obsessing over smart contracts.\nPlan for next week (week 2):\nFocus hard on the technical build:\n– Build a simple frontend to open positions\n– Dive deep into smart contract structure\n– Connect frontend + contracts on Arbitrum testnet\nIdeal outcome = MVP skeleton working.\nThanks to everyone who’s followed this journey so far.\nNow it’s time to breathe, reset, and get ready for WEEK 2.\nLet’s keep building"
            }
        ]
    },
    {
        "id": "b7d809a6c074fc75",
        "topic_id": "6374",
        "title": "The Role of DevRel in Shaping Product Roadmaps",
        "url": "https://forum.ceg.vote/t/the-role-of-devrel-in-shaping-product-roadmaps/6374",
        "views": "",
        "comments": "0",
        "created_date": "Jul 15, 2025 4:54 pm",
        "latest_activity": null,
        "content": "(Spoiler: It’s not just about reporting bugs)\nOne of the most underrated aspects of DevRel is how much it quietly shapes product direction — often without being formally asked to.\nWe’re not just docs or demos.\nWe’re on the frontlines:\nHearing friction in real-time\nWatching what devs build vs what we thought they would\nSpotting patterns that haven’t made it into Jira yet\nSo what does that look like, practically?\nTranslating feedback\nNot all devs write feature requests in perfect product-speak. DevRel turns “this is confusing” into something Product can actually use.\nSurfacing the why\nSupport tickets tell what’s broken. DevRel sees what’s missing, what’s being hacked around, and what’s being ignored.\nPrioritizing with context\nWe know what’s noisy vs what’s painful — because we’re close to the conversations that don’t make it to sprint planning.\nAdvocating for invisible needs\nStuff like better error messages, dev console improvements, or onboarding tweaks often get deprioritized — but DevRel knows how much they matter.\nReal talk:\nDevRel shouldn’t “own” the roadmap.\nBut if we’re not in the room when it’s shaped, we’re missing one of the highest-leverage opportunities we have.\nBecause we don’t just reflect what developers are doing.\nWe help guide what they’ll want to do next.\nWhat’s your take?\nHave you seen DevRel help shift product thinking in ways that weren’t obvious at first?",
        "comments_details": [
            {
                "author": "nidhinakranii",
                "comment": "(Spoiler: It’s not just about reporting bugs)\nOne of the most underrated aspects of DevRel is how much it quietly shapes product direction — often without being formally asked to.\nWe’re not just docs or demos.\nWe’re on the frontlines:\nHearing friction in real-time\nWatching what devs build vs what we thought they would\nSpotting patterns that haven’t made it into Jira yet\nSo what does that look like, practically?\nTranslating feedback\nNot all devs write feature requests in perfect product-speak. DevRel turns “this is confusing” into something Product can actually use.\nSurfacing the why\nSupport tickets tell what’s broken. DevRel sees what’s missing, what’s being hacked around, and what’s being ignored.\nPrioritizing with context\nWe know what’s noisy vs what’s painful — because we’re close to the conversations that don’t make it to sprint planning.\nAdvocating for invisible needs\nStuff like better error messages, dev console improvements, or onboarding tweaks often get deprioritized — but DevRel knows how much they matter.\nReal talk:\nDevRel shouldn’t “own” the roadmap.\nBut if we’re not in the room when it’s shaped, we’re missing one of the highest-leverage opportunities we have.\nBecause we don’t just reflect what developers are doing.\nWe help guide what they’ll want to do next.\nWhat’s your take?\nHave you seen DevRel help shift product thinking in ways that weren’t obvious at first?"
            }
        ]
    },
    {
        "id": "2220dec7e5c44bb3",
        "topic_id": "6370",
        "title": "Vibesflow",
        "url": "https://forum.ceg.vote/t/vibesflow/6370",
        "views": "",
        "comments": "0",
        "created_date": "Jul 15, 2025 4:17 pm",
        "latest_activity": null,
        "content": "Project Name\nVibesflow AI\nProblem Statement\nNo existing solution (AI or otherwise) for real-time music-generaration based on motion. Only text-based, and not in real-time\nSolution Overview\nAn economically incentivized, mobile app to generate music based on user’s motion.\nVibesFlow is the first app that lets you create music through your motion - be autonomous, create your own rhythm.\nProject Description\nA motion (expo-sensors inputs) to music generation mobile-native app. Music is produced continuously, and it adapts in real time to user’s movements.\nThere is a “group” mode as well - for private parties and/or event organizers to let others in the vicinity to connect to their streams.\nIt introduces a new financial asset as well, which I call RTA: Real-time Asset: an RWA-like asset which acquires value in real-time.\nThree main contracts:\nRTA\nstream (for continuous payments during group-mode)\nroyalties (which distributes monthly-subscriptions revenues based on how many times a “chunk” - 60-sec .wav extracted during the music stream and uploaded to Filecoin - is played respect to the total plays. It’s a fairer model, which allows co-ownership - potentially, in a dj set of 60 minutes (with 60 individual chunkIDs) there could be 60 different shareholders - and favors section-plays over song-plays, trackable through queries and verifiable through Filecoin PDP provenance to drastically reduce manipulation).\nCommunity Engagement Features\nGroup mode, create & share, marketplace\nGetting Involved\nHelp with frontend integration ; spreading the word ; use and enjoy the app",
        "comments_details": [
            {
                "author": "Jabyl",
                "comment": "Project Name\nVibesflow AI\nProblem Statement\nNo existing solution (AI or otherwise) for real-time music-generaration based on motion. Only text-based, and not in real-time\nSolution Overview\nAn economically incentivized, mobile app to generate music based on user’s motion.\nVibesFlow is the first app that lets you create music through your motion - be autonomous, create your own rhythm.\nProject Description\nA motion (expo-sensors inputs) to music generation mobile-native app. Music is produced continuously, and it adapts in real time to user’s movements.\nThere is a “group” mode as well - for private parties and/or event organizers to let others in the vicinity to connect to their streams.\nIt introduces a new financial asset as well, which I call RTA: Real-time Asset: an RWA-like asset which acquires value in real-time.\nThree main contracts:\nRTA\nstream (for continuous payments during group-mode)\nroyalties (which distributes monthly-subscriptions revenues based on how many times a “chunk” - 60-sec .wav extracted during the music stream and uploaded to Filecoin - is played respect to the total plays. It’s a fairer model, which allows co-ownership - potentially, in a dj set of 60 minutes (with 60 individual chunkIDs) there could be 60 different shareholders - and favors section-plays over song-plays, trackable through queries and verifiable through Filecoin PDP provenance to drastically reduce manipulation).\nCommunity Engagement Features\nGroup mode, create & share, marketplace\nGetting Involved\nHelp with frontend integration ; spreading the word ; use and enjoy the app"
            }
        ]
    },
    {
        "id": "0f6f67bd79f069d8",
        "topic_id": "5579",
        "title": "iYield– DeFAI Smart Vaults",
        "url": "https://forum.ceg.vote/t/iyield-defai-smart-vaults/5579",
        "views": "",
        "comments": "12",
        "created_date": "Jun 13, 2025 3:55 pm",
        "latest_activity": "Jul 15, 2025 4:03 pm",
        "content": "Project Name\niYield– DeFAI Smart Vaults\nProblem Statement\nYield farming in DeFi is complex, resource-intensive, and often inaccessible to non-expert users. Retail investors struggle to keep up with rapidly changing market conditions and protocols, leading to suboptimal yield and high risks. There’s a need for a system that automates intelligent yield allocation while remaining transparent, secure, and accessible.\nSolution Overview\niYield is an on-chain AI-powered vault protocol that automates capital allocation across yield strategies. Leveraging Hyperion’s parallel execution and on-chain AI capabilities, iYield dynamically rebalances funds across multiple DeFi protocols to optimize returns. Our system democratizes advanced yield optimization, removing the barrier of technical know-how while ensuring transparency and performance. By bringing AI workflows directly on-chain, iYield introduces fully verifiable, trustless DeFi asset management for everyone.\nProject Description\niYield is a modular DeFAI protocol offering Smart Vaults, AI-driven investment vaults that manage yield strategies in real-time. It uses a rebalancing engine built on on-chain AI models to evaluate yield rates, risk metrics, gas costs, and liquidity across various DeFi protocols. Users deposit into Smart Vaults, which then allocate funds automatically based on performance and risk profiles determined by the AI.\nWe plan to leverage Hyperion’s high-throughput parallel execution, real-time inference for LLMs, and Optimistic Rollup support to enable seamless AI decision-making directly on-chain. Core features will include vault creation, AI strategy selection, real-time performance analytics, and dynamic allocation. What excites us is the possibility of making DeFi investment smarter, faster, and fairer thus empowering users with minimal effort and maximum transparency.\nCommunity Engagement Features\nTo incentivize engagement, iYield will integrate a gamified testnet experience:\nTestable Tasks: Deposit into a Super Vault, simulate a rebalancing operation, vote on a community strategy proposal, and complete an educational quiz.\nPoints System: Each task earns users points (e.g., Deposit = 20 pts, Rebalance Sim = 30 pts, Vote = 15 pts, Quiz = 10 pts).\nGamification Mechanics: Leaderboards, NFT badges for milestones, and early-user rewards tied to accumulated points.\nGetting Involved\nCommunity members can join via:\nDiscord/Telegram: Contribute feedback, ideas, and test features.\nGitHub: Collaborate on smart contract development or audit code.\nContent Creation: Help with educational materials, documentation, or translations.\nEarly Access: Sign up as a beta tester to help shape iYield and earn rewards.\nMORE INFO SOON",
        "comments_details": [
            {
                "author": "devarogundade",
                "comment": "Project Name\niYield– DeFAI Smart Vaults\nProblem Statement\nYield farming in DeFi is complex, resource-intensive, and often inaccessible to non-expert users. Retail investors struggle to keep up with rapidly changing market conditions and protocols, leading to suboptimal yield and high risks. There’s a need for a system that automates intelligent yield allocation while remaining transparent, secure, and accessible.\nSolution Overview\niYield is an on-chain AI-powered vault protocol that automates capital allocation across yield strategies. Leveraging Hyperion’s parallel execution and on-chain AI capabilities, iYield dynamically rebalances funds across multiple DeFi protocols to optimize returns. Our system democratizes advanced yield optimization, removing the barrier of technical know-how while ensuring transparency and performance. By bringing AI workflows directly on-chain, iYield introduces fully verifiable, trustless DeFi asset management for everyone.\nProject Description\niYield is a modular DeFAI protocol offering Smart Vaults, AI-driven investment vaults that manage yield strategies in real-time. It uses a rebalancing engine built on on-chain AI models to evaluate yield rates, risk metrics, gas costs, and liquidity across various DeFi protocols. Users deposit into Smart Vaults, which then allocate funds automatically based on performance and risk profiles determined by the AI.\nWe plan to leverage Hyperion’s high-throughput parallel execution, real-time inference for LLMs, and Optimistic Rollup support to enable seamless AI decision-making directly on-chain. Core features will include vault creation, AI strategy selection, real-time performance analytics, and dynamic allocation. What excites us is the possibility of making DeFi investment smarter, faster, and fairer thus empowering users with minimal effort and maximum transparency.\nCommunity Engagement Features\nTo incentivize engagement, iYield will integrate a gamified testnet experience:\nTestable Tasks: Deposit into a Super Vault, simulate a rebalancing operation, vote on a community strategy proposal, and complete an educational quiz.\nPoints System: Each task earns users points (e.g., Deposit = 20 pts, Rebalance Sim = 30 pts, Vote = 15 pts, Quiz = 10 pts).\nGamification Mechanics: Leaderboards, NFT badges for milestones, and early-user rewards tied to accumulated points.\nGetting Involved\nCommunity members can join via:\nDiscord/Telegram: Contribute feedback, ideas, and test features.\nGitHub: Collaborate on smart contract development or audit code.\nContent Creation: Help with educational materials, documentation, or translations.\nEarly Access: Sign up as a beta tester to help shape iYield and earn rewards.\nMORE INFO SOON"
            },
            {
                "author": "priyankg3",
                "comment": "Hello\n@devarogundade\n,\nHow does iYield’s Smart Vault differ from traditional yield aggregators like Yearn or Beefy?\nIs the iYield protocol non-custodial, and do users retain control over their funds at all times?"
            },
            {
                "author": "devarogundade",
                "comment": "iYield’s Smart Vaults are similar in structure to platforms like Beefy or Yearn, offering users a selection of Vaults/Pools where they can deposit and manage multiple yield-generating strategies. However, what sets iYield apart is our Autopilot feature, a layer powered by AI agents with distinct behavioral traits like Predictive Learner, Short-Term Flipper, Long-Term Holder, Yield DCA Agent, Stablecoin Maximalist.\nThese AI agents analyze user manual/on-chain activity patterns and leverage trained data models to:\nAutomatically allocate user capital to the most optimal Vaults/Pools (if Autopilot is fully enabled).\nSuggest the best strategies for manual selection (if Autopilot is partially enabled).\nThis allows users to benefit from personalized, data-driven yield optimization without needing deep DeFi expertise.\nNon-Custodial by Design\nYes, the iYield protocol is fully non-custodial. Users retain control over their funds at all times. Deposits and withdrawals can be made directly from Vaults/Pools at any time — we never take ownership or custody of user assets."
            },
            {
                "author": "priyankg3",
                "comment": "Thank you\n@devarogundade\nfor the detailed explanation . Looking forward to trying out the Smart Vaults and seeing the AI agents in action!"
            },
            {
                "author": "han",
                "comment": "it looks like a thoughtful step toward simplifying DeFi for everyday users.\nQuick question: Will users be able to customize their risk preferences within the Smart Vaults, or will the AI handle all risk profiling autonomously?"
            },
            {
                "author": "devarogundade",
                "comment": "User flexibility is key in our design. While our AI agents assist with portfolio decisions, users can set explicit preferences to control what the Smart Vault is allowed to do.\nFor example, a user might permit their Smart Vault to automatically exit positions when risk thresholds are breached, but require manual approval for new deposits.\nThis hybrid model ensures that users remain in control while still benefiting from intelligent automation.\nWe’re also exploring additional risk management features, such as customizable risk-reward ratios. While risk can’t be completely eliminated, we aim to minimize it as much as possible.\nEach AI agent is defined by a set of traits, and each trait carries a specific risk factor. Based on this, users can assess the cumulative risk of their Smart Vaults and make informed decisions."
            },
            {
                "author": "han",
                "comment": "Love the hybrid control approach smart automation with user-defined boundaries is the way to go.\nCurious though: will users be able to simulate different trait combinations to see potential risk outcomes before deploying a Smart Vault?"
            },
            {
                "author": "devarogundade",
                "comment": "That’s a great point, we actually hadn’t considered that, but it’s definitely something worth exploring. One idea could be to offer a testnet environment where users can simulate different trait combinations and Smart Vault configurations to assess potential risk outcomes before using real funds."
            },
            {
                "author": "devarogundade",
                "comment": "Hi everyone following our journey,\nWe’ve been building quietly behind the scenes, working hard to turn our big idea into something tangible. After weeks of development, we’re finally approaching the moment we’ve all been waiting for.\nThe IYield MVP is almost ready — and very soon, we’ll be sharing live demo links so anyone can test our first public release.\nIf you’re reading this, thank you for your patience and support. The wait is nearly over.\nStay tuned."
            },
            {
                "author": "CrisMetis",
                "comment": "This iYield sounds like a great idea, especially the fact that DeFi should be accessible to everyone. Making smart DeFi investing easier and more approachable for everyone. Curious to see how it evolves"
            },
            {
                "author": "CrisMetis",
                "comment": "Just saw this, happy to try out the MVP mate!"
            },
            {
                "author": "crypto4ell",
                "comment": "Can you tell me when the product will be launched? I really want to test it."
            },
            {
                "author": "devarogundade",
                "comment": "We’re currently preparing a step-by-step guide with visuals to help you test the dApp smoothly and with ease.\nThis guide will walk you through everything you need to know.\nTesting update goes live on Thursday, July 17th at 16:00 UTC.\nStay tuned — and thank you for being part of this journey!"
            }
        ]
    },
    {
        "id": "1f98934bb2c11541",
        "topic_id": "6093",
        "title": "HyperHack Stage 3: Stress-Testing Phase",
        "url": "https://forum.ceg.vote/t/hyperhack-stage-3-stress-testing-phase/6093",
        "views": "",
        "comments": "3",
        "created_date": "Jul 1, 2025 1:45 pm",
        "latest_activity": "Jul 15, 2025 4:00 pm",
        "content": "HyperHack Stage 3: Stress-Testing Phase - Reminder\nTimeline: July 15 - August 7, 2025\nWhat’s Happening in Stage 3?\nThis phase is all about real-world validation of your dApp. We’ll be putting your projects through their paces to ensure they’re ready for prime time.\nKey Focus Areas\nVulnerability Assessment\nIdentifying potential security weaknesses in your projects\nComprehensive security review of smart contracts and application logic\nBug Hunting & UX Analysis\nCollecting detailed bug reports from community testing\nGathering user experience feedback from real users\nPerformance monitoring under various load conditions\nStress Testing\nCreating well-scoped test scenarios for your dApp\nConducting thorough testing of all submitted applications\nValidating functionality under real-world usage patterns\nIdentifying performance bottlenecks and UX friction points\nAction Items for Developers\nPrepare Your Ideathon Post\nInclude the link to your DApp\nProvide comprehensive guides and documentation\nMake it easy for community members to test your dApp\nDocumentation Requirements\nUser guides for testing your application\nSetup instructions for testers\nKnown limitations or prerequisites\nCommunity Engagement\nBe responsive to tester feedback\nMonitor your project channels for bug reports\nEngage with community members trying your dApp\nWhy This Stage Matters:\nThis feedback is CRITICAL for your project’s success. Stage 3 gives you a unique opportunity to:\nIdentify and fix issues before final submission\nImprove user experience based on real user feedback\nOptimize performance bottlenecks\nStrengthen security posture\nRefine your product-market fit\nImportant Deadline:\nFinal submissions are due August 7th. Use the feedback from this stress-testing phase to make essential UX improvements and bug fixes before the deadline.\nPro Tips:\nBe Proactive: Don’t wait for feedback to come to you - actively seek it out\nDocument Everything: Keep track of all feedback and how you’re addressing it\nPrioritize UX: Small UX improvements can have massive impact on your final evaluation\nTest Early, Test Often: Use this phase to iterate quickly on user feedback\nRemember: The community participation in this stage directly impacts your project’s final quality. Make it count!",
        "comments_details": [
            {
                "author": "0xthiru",
                "comment": "HyperHack Stage 3: Stress-Testing Phase - Reminder\nTimeline: July 15 - August 7, 2025\nWhat’s Happening in Stage 3?\nThis phase is all about real-world validation of your dApp. We’ll be putting your projects through their paces to ensure they’re ready for prime time.\nKey Focus Areas\nVulnerability Assessment\nIdentifying potential security weaknesses in your projects\nComprehensive security review of smart contracts and application logic\nBug Hunting & UX Analysis\nCollecting detailed bug reports from community testing\nGathering user experience feedback from real users\nPerformance monitoring under various load conditions\nStress Testing\nCreating well-scoped test scenarios for your dApp\nConducting thorough testing of all submitted applications\nValidating functionality under real-world usage patterns\nIdentifying performance bottlenecks and UX friction points\nAction Items for Developers\nPrepare Your Ideathon Post\nInclude the link to your DApp\nProvide comprehensive guides and documentation\nMake it easy for community members to test your dApp\nDocumentation Requirements\nUser guides for testing your application\nSetup instructions for testers\nKnown limitations or prerequisites\nCommunity Engagement\nBe responsive to tester feedback\nMonitor your project channels for bug reports\nEngage with community members trying your dApp\nWhy This Stage Matters:\nThis feedback is CRITICAL for your project’s success. Stage 3 gives you a unique opportunity to:\nIdentify and fix issues before final submission\nImprove user experience based on real user feedback\nOptimize performance bottlenecks\nStrengthen security posture\nRefine your product-market fit\nImportant Deadline:\nFinal submissions are due August 7th. Use the feedback from this stress-testing phase to make essential UX improvements and bug fixes before the deadline.\nPro Tips:\nBe Proactive: Don’t wait for feedback to come to you - actively seek it out\nDocument Everything: Keep track of all feedback and how you’re addressing it\nPrioritize UX: Small UX improvements can have massive impact on your final evaluation\nTest Early, Test Often: Use this phase to iterate quickly on user feedback\nRemember: The community participation in this stage directly impacts your project’s final quality. Make it count!"
            },
            {
                "author": "Sheyda",
                "comment": "Thanks Thiru, would you please share the link where to start the testing for community users?"
            },
            {
                "author": "pavel",
                "comment": "If you are a hyperhack project, please submit using this link: ClickUp Forms"
            }
        ]
    },
    {
        "id": "68d4c6cb134584d5",
        "topic_id": "5537",
        "title": "[MetaPay] A Circulating Basic Income Model with Digital Currency",
        "url": "https://forum.ceg.vote/t/metapay-a-circulating-basic-income-model-with-digital-currency/5537",
        "views": "",
        "comments": "37",
        "created_date": "Jun 12, 2025 11:25 pm",
        "latest_activity": "Jul 15, 2025 3:19 pm",
        "content": "Live Link: https://meta-pay-p2-p-clean-7aig.vercel.app/\n[MetaPay] A Circulating Basic Income Model with Digital Currency\nOverview\nMetaPay is a programmable, circulating basic income system that distributes funds through digital wallets and recollects a fixed percentage to ensure sustainability — without raising taxes or relying on additional government budgets.\nProblem\nMost basic income proposals fail due to unrealistic funding models. They often depend on higher taxation, increasing national debt, or complex redistribution mechanisms that generate political resistance and economic inefficiencies.\nOur Solution\nMetaPay operates on a simple yet powerful loop:\nAn initial fund of 250 trillion KRW\nDistributed over 10 months (25 trillion KRW/month)\nStarting from month 10, 10% of each wallet’s remaining balance is recollected at the end of each month\nThe recollected funds are used to fund the next cycle\nThis creates a self-sustaining system with zero net government burden and maximum benefit for citizens.\nKey Features\nAll payments and recollections are processed exclusively via digital currency\nWallets automatically split payments: 50% MetaPay + 50% cash or card\nNo restrictions on how the income is used\nHigher-income users contribute more through greater spending, while lower-income users retain full benefit\nFully trackable, automated, and transparent\nWhat We Need\nWe are seeking collaborators who can support:\nSmart contract development\nTokenomics modeling and analysis\nUX/UI simulation and digital wallet architecture\nStress testing on the Hyperion Testnet\nLet’s bring MetaPay to life — and demonstrate how real-world programmable basic income can scale sustainably and fairly.",
        "comments_details": [
            {
                "author": "metapay_gyuha",
                "comment": "Live Link: https://meta-pay-p2-p-clean-7aig.vercel.app/\n[MetaPay] A Circulating Basic Income Model with Digital Currency\nOverview\nMetaPay is a programmable, circulating basic income system that distributes funds through digital wallets and recollects a fixed percentage to ensure sustainability — without raising taxes or relying on additional government budgets.\nProblem\nMost basic income proposals fail due to unrealistic funding models. They often depend on higher taxation, increasing national debt, or complex redistribution mechanisms that generate political resistance and economic inefficiencies.\nOur Solution\nMetaPay operates on a simple yet powerful loop:\nAn initial fund of 250 trillion KRW\nDistributed over 10 months (25 trillion KRW/month)\nStarting from month 10, 10% of each wallet’s remaining balance is recollected at the end of each month\nThe recollected funds are used to fund the next cycle\nThis creates a self-sustaining system with zero net government burden and maximum benefit for citizens.\nKey Features\nAll payments and recollections are processed exclusively via digital currency\nWallets automatically split payments: 50% MetaPay + 50% cash or card\nNo restrictions on how the income is used\nHigher-income users contribute more through greater spending, while lower-income users retain full benefit\nFully trackable, automated, and transparent\nWhat We Need\nWe are seeking collaborators who can support:\nSmart contract development\nTokenomics modeling and analysis\nUX/UI simulation and digital wallet architecture\nStress testing on the Hyperion Testnet\nLet’s bring MetaPay to life — and demonstrate how real-world programmable basic income can scale sustainably and fairly."
            },
            {
                "author": "priyankg3",
                "comment": "Hello\n@metapay_gyuha\n, What happens if users withdraw all funds from their wallet before the 10% recollection?\nHow does the automatic 50/50 split with MetaPay and fiat work at merchant checkouts?"
            },
            {
                "author": "han",
                "comment": "Thanks for sharing the MetaPay vision. really inspiring! With 10% of my wallet balance being recollected monthly, will there be a transparent interface to track this process? Also, can the recollection rate be personalized based on my spending behavior?"
            },
            {
                "author": "metapay_gyuha",
                "comment": "Thank you for your great question and your interest in MetaPay!\nLet me answer each part in detail:\n1. Transparent Interface for Recollection Tracking\nMetaPay is designed so that all users can track both the distribution and recollection of funds in real time through their digital wallets.\nAt the end of each month, users will be able to clearly see:\nThe amount recollected (10% of remaining balance)\nThe amount distributed\nCurrent wallet balance\nFull transaction and recollection history\nMonthly reports will also be provided via the mobile app or web-based wallet interface to ensure full transparency.\n2. About Personalizing the Recollection Rate\nMetaPay maintains a fixed 10% recollection rate for all users.\nThis is because the recollected amount is directly used as the fund for the next month’s distribution.\nIf the rate were to vary by individual, it would break the balance of this self-sustaining cycle and threaten the long-term stability of the system.\nHowever, small demographic changes (such as births or deaths) can be handled through government budget adjustments or annual fiscal planning, without affecting the core 10% structure.\nIf you’re curious about the full MetaPay model, please feel free to visit our YouTube channel.\nWe’ve uploaded videos that explain the core mechanics and philosophy of MetaPay in detail:\nMain Intro Video\nMetaPay – A Circulating Basic Income: Whose Time Are You Living?\nhttps://youtu.be/e4lH_uGN-ck\nVisit Our Channel\nhttps://www.youtube.com/@MetaPayProject\nThank you again for engaging with the project. If you have more questions, we’d love to continue the conversation!\n— MetaPay Project Team"
            },
            {
                "author": "metapay_gyuha",
                "comment": "Thank you for your thoughtful questions! Let me explain each point clearly.\n1. What happens if a user withdraws all MetaPay before the 10% recollection at the end of the month?\nMetaPay is a closed-loop digital system that cannot be freely withdrawn as cash.\nAll MetaPay balances are managed within your digital wallet and cannot be transferred directly to others or exchanged into fiat currency.\nEven if you attempt to use up all of your balance before the end of the month, the system will calculate the recollection amount based on your wallet balance at that exact time (e.g., 10% of the remaining amount on the last day of the month).\nThis ensures fairness and sustainability, regardless of spending patterns.\n2. How does the automatic 50/50 split payment work between MetaPay and fiat currency?\nWhenever you make a payment at a registered merchant, your wallet automatically splits the transaction:\n50% is paid using MetaPay, and 50% using your existing payment method (cash, credit, etc.).\nThis is enforced by the system and does not require manual input by the user or merchant, maintaining simplicity and compliance.\nIt also ensures MetaPay is circulated and reclaimed properly within the system.\nWant to explore the MetaPay model in detail?\nCheck out the official video and YouTube channel, where we explain the philosophy and mechanism of MetaPay.\nIntro Video\nMetaPay Circulating Basic Income – “Whose time is it, really?”\n메타페이순환형 기본소득 : 당신의 시간은 누구의 것입니까?\nFull Channel\nYouTube\nMetaPay Project\nShare your videos with friends, family, and the world\nWe believe MetaPay is not just about distributing money—\nit’s about restoring your time, freedom, and dignity.\nLet’s build this future together."
            },
            {
                "author": "priyankg3",
                "comment": "Thanks for the detailed explanation! That clears up both points really well.\nWill definitely check out the video to understand the bigger picture better. Appreciate the quick response!"
            },
            {
                "author": "metapay_gyuha",
                "comment": "[HyperHack Submission] MetaPay – A Circular Basic Income Simulator on Web3\nProject Name: MetaPay\nOne-line Description:\nA self-sustaining basic income simulator using smart contracts and Web3 wallets to solve inequality, restore political trust, and reduce welfare inefficiencies.\nProblem Statement\nMost basic income models struggle due to three major reasons:\nUnsustainable funding (e.g., new taxes or debt)\nPublic distrust in fair distribution\nDisruption to existing welfare systems\nMetaPay introduces a fully digital, autonomous solution that avoids new taxation, ensures transparency via smart contracts, and operates in parallel with current welfare structures.\nSolution\nMetaPay distributes ₩500,000 (~$370) monthly to 50 million citizens via Web3 wallets.\nAll transactions are digitally trackable\nSmart contracts govern issuance, use, and recollection\nAfter 10 months, 10% of remaining wallet balances are recollected to fund the next round, creating a circular, self-replenishing cycle\nUser Flow (Example)\nA citizen receives ₩500,000 in their MetaPay wallet\nThey make a purchase—payment is split 50:50 between MetaPay and cash/card\nUnused MetaPay remains untouched\nAt the end of month 10, 10% of the remaining amount is recollected\nThat amount funds the next distribution\nNo expiration, no loss if spent—just gentle nudging toward use\nSimulation Results (Based on Pilot Assumptions)\n84% average utilization rate per user/month\n19% increase in local SME revenue\nEstimated ₩2.3 trillion additional tax revenue in first year\nNo inflation impact due to controlled injection/recollection loop\n(Detailed modeling in SSRN paper)\nTech Stack\nWeb3 Wallets (MetaMask, Hyperion Wallet)\nEVM-Compatible Smart Contracts (ERC20-like logic)\nAlith ZK-ID Integration (for Sybil resistance)\nAI Policy Simulation Engine (Python ML)\nUX/UI Design Tools (Figma, no-code prototypes)\nAlith ZK-ID Scenario\nTo ensure fairness in decentralized networks:\nEach wallet is linked to a unique identity via Zero-Knowledge Proofs\nNo personal data shared—privacy fully preserved\nPrevents wallet duplication or “Sybil attacks” during distribution\nThis enables equitable and secure distribution even across unbanked or pseudonymous populations.\nWhy MetaPay Matters\nNo new taxes, no system overhaul\nTransparent governance via open-source contracts\nRestores political trust and boosts civic engagement\nReduces unemployment without discouraging job-seeking\nWorks alongside existing welfare programs\nDemo & Repos\nDemo video: https://youtu.be/e4lH_uGN-ck\nGitHub: MetaPay – A Web3-based Circular Basic Income Simulator\nTestnet dApp: MetaPay UI Demo\nPilot & Collaboration Plan\nWe are seeking to pilot MetaPay with:\nSmall EU municipalities (e.g., Estonia, Portugal)\nDecentralized communities or DAOs\nNGOs & academic institutions interested in Web3-driven policy\nLet’s test a real-world basic income loop without the usual frictions.\nForum ID: metapay_gyuha\nLooking Forward\nMetaPay isn’t just a simulator—it’s a prototype for real policy.\nJoin us to co-create the next generation of digital, fair, and circular basic income.\nLet’s build not only systems, but trust.\nDM or comment below if you’d like to collaborate, test, or fork MetaPay."
            },
            {
                "author": "metapay_gyuha",
                "comment": "MetaPay Circulation Structure Visualization (Updated)\nMetaPay is not just about distribution—it is a self-sustaining, circular basic income model that continuously operates through automatic recollection and redistribution using digital currency.\nWithout any need for long-term tax increases or additional government spending, the initial KRW 250 trillion investment enters an infinite loop of monthly distribution and recollection—creating a durable, automated system.\nThe chart below visualizes how the MetaPay system operates over time:\nInitial Capital: KRW 250 trillion (distributed over 10 months at KRW 25 trillion per month)\nImportantly, this initial capital is not a sunk cost.\nAs basic income boosts consumption and economic activity, increased tax revenue can be used to repay the original KRW 250 trillion—without cutting existing programs or raising new taxes.\nRecollection Start: From month 10.5 onward, 10% of each wallet’s remaining balance is automatically recollected at the end of every month\nRecollected Funds: Fully reused as the source of next month’s distribution\nResult: A perfectly circular economic loop with zero net fiscal burden\n“This model can be piloted in small EU nations by adjusting the distribution-to-recollection ratio to fit local GDP.”\nChart Breakdown\nGreen Bars (Distribution): KRW 25 trillion distributed each month\nRed Bars (Recollection): KRW 25 trillion recollected monthly starting at month 10.5\nBlue Line (Cumulative Balance): Tracks the total circulating balance\n→ It rises for the first 10 months, then stabilizes at KRW 250 trillion\n→ This equilibrium is maintained as long as distribution and recollection stay synchronized.\nGlobal Applicability & Pilot Readiness\nMetaPay is designed with a simple mathematical formula that is independent of any specific country’s tax laws or welfare system:\nDistribution (B) = Fixed amount (e.g. 25T)\nRecollection (R) = 10% of wallet balance at the end of the month\nIf B = R → The system becomes self-sustaining\nBecause of this, MetaPay can be implemented anywhere by adjusting only the base amount according to local GDP or population. For instance:\nA small EU country with 5 million people could adjust the monthly benefit per person according to national GDP, while keeping the 10% recollection rule intact.\nThis makes MetaPay ideal for pilot testing in:\nSmall EU member states (e.g., Estonia, Slovenia, Portugal)\nDecentralized communities or digital welfare zones\nInternational policy labs with limited fiscal risk\nMetaPay proves that basic income can be self-sustaining, programmable, and globally adaptable—without requiring new taxes.\nLet’s co-create a fairer digital future that begins with circulation, not debt.\nComing next: Technical Architecture & DID-based Identity Integration (Bonus Track)"
            },
            {
                "author": "metapay_gyuha",
                "comment": "MetaPay Technical Architecture & Identity Layer (Bonus Track)\nTo complement the policy design, this section introduces the technical backbone of MetaPay—integrating decentralized identity, biometric verification, and programmable smart contracts.\nThis architecture enables a secure, automated, and globally scalable basic income system using blockchain and verifiable digital identity.\nSystem Overview\nMetaPay operates through the following core technical layers:\nBiometric Verification (Alice)\nFace recognition ensures each user holds only one MetaPay Wallet (1-person-1-wallet).\nDecentralized ID (DID) + Verifiable Credential (VC)\nAfter facial verification, users are issued a VC that proves their identity without exposing private information.\nSmart Contract\nGoverns income distribution, 10% recollection, and identity verification logic.\nMetaPay Wallet\nAutomatically receives monthly income and recollects 10% of the remaining balance.\nOff-chain Ledger\nOptionally used by governments or institutions to transparently log transactions without storing personal data.\nFlow Summary\nAlice verifies the user’s face during onboarding.\nA Verifiable Credential (VC) is issued and linked to the user’s DID.\nThe VC is submitted to the Smart Contract for validation.\nOnce approved, the contract distributes monthly income to the user’s MetaPay Wallet.\nAt the end of each month, 10% of the wallet’s remaining balance is automatically recollected.\nAll events are transparently recorded to a government or institutional ledger (if applicable).\nTech Stack\nSmart Contracts: Solidity-based, Ethereum-compatible logic\nID Layer: DID + VC + biometric (Alice) integration\nZKP (Zero-Knowledge Proofs): Enables identity verification without revealing personal data\nWallet: MetaMask / Hyperion Wallet customized for MetaPay circulation\nLedger: Off-chain transparency layer for auditing (regional option)\nGlobal Scalability\nThis architecture supports:\nCross-border pilot projects in digital ID-ready regions (e.g., Estonia, Slovenia, Portugal)\nFull compliance with EU Digital Identity Wallet (EUDI Wallet) standards\nAdjustable payout amounts based on national GDP, while maintaining the fixed 10% recollection structure\nArchitecture Diagram – Identity-Integrated Circulation Flow\nVisual representation of MetaPay’s end-to-end system:\nFacial verification (Alice)\nCredential issuance (DID + VC)\nSmart contract logic\nWallet automation\nTransparent recordkeeping\nDiagram: Secure identity-linked basic income distribution and recollection process\nMetaPay is not just a basic income system—\nIt’s verifiable, programmable, and globally adaptable by design.\nLet’s co-create a transparent economic future that begins with circulation, not debt.\nArchitecture Diagram – Identity-Integrated Circulation Flow\nDiagram: Secure identity-linked basic income distribution and recollection process"
            },
            {
                "author": "priyankg3",
                "comment": "Hello\n@metapay_gyuha\n, It would be great to see your project featured in a Vibe session! If you’re interested in applying and showcasing then, I’d really love to see how Hyperion is involved in your project’s vision. If you have a demo to show us, that would be even better."
            },
            {
                "author": "metapay_gyuha",
                "comment": "Thank you\n@priyankg3\nfor your kind message — I’m honored that MetaPay is being considered for a Vibe session!\nTo be transparent, the demo DApp is currently in development, and we’ve encountered a technical issue during Remix deployment. That said, the core logic — including distribution, recollection, and the self-sustaining loop — has already been implemented.\nThe simulation is designed to demonstrate how Hyperion-compatible wallets and smart contracts automate the cycle. We’re actively working to resolve the issue and finalize a testnet version.\nI’d love to share the demo here as soon as it’s ready.\nAppreciate the opportunity and look forward to contributing further!"
            },
            {
                "author": "metapay_gyuha",
                "comment": "MetaPay – A Circulating Basic Income Model Using Digital Currency\nTechnical Overview for Ideathon Submission\n1. Project Summary\nProject Name: MetaPay\nDomain: Web3, Digital Currency, Public Policy, Universal Basic Income, Privacy (ZK-ID)\nMetaPay is a programmable, circulating basic income system that enables sustainable redistribution without raising taxes. It operates entirely through digital currency and blockchain infrastructure, ensuring economic inclusion and policy transparency. Importantly, MetaPay is designed to work alongside existing welfare programs—supporting, not replacing, traditional social protections.\n2. Technical Structure & Flow\nCore Mechanism:\nAn initial capital of 250 trillion KRW is distributed over 10 months (25 trillion/month) via Web3 wallets. From month 11, 10% of each wallet’s remaining balance is automatically recollected and reused for the next cycle—forming an infinite redistribution loop that requires no additional taxes or external funding.\nDistribution Cycle:\nEach citizen receives 500,000 KRW per month in MetaPay\nPayments are made through digital wallets\nAll purchases are auto-split: 50% MetaPay + 50% fiat (cash, card, etc.)\nPayment patterns are transparently trackable, no manual input needed\nRecollection Cycle:\nAt the end of each month (starting month 11), 10% of leftover wallet balance is recollected\nThese funds become the source of the next month’s universal distribution\nNo penalties or restrictions—recollection applies only to unused MetaPay\nZK-ID Integration: To ensure fairness and prevent abuse:\nFacial recognition via Alice biometric layer during onboarding\nDID (Decentralized ID) and VC (Verifiable Credential) issued per person\nSmart contracts verify uniqueness (1 wallet per person) without revealing private data\n3. Policy Relevance & Feasibility\nSubmitted to South Korea’s national digital democracy platform\nPolitically safe: No interference with welfare or pension systems\nTechnically versatile: Works with national ID infrastructure or ZK-ID-only regions\nFinancially circular: System sustains itself without future tax increases\n4. Public Engagement & Tools\nTestnet-based simulator (distribute → recollect → redistribute)\nYouTube explainer: “Whose Time Are You Living?”\nAll smart contracts are open-source and modular (on GitHub)\nSystem interoperable with Polygon ID, Semaphore, Worldcoin ZK stack\n5. Technical Stack\nSmart Contracts: Solidity (ERC20 logic, programmable recollection)\nWallet: MetaMask, Hyperion Wallet (custom UI with auto-split logic)\nIdentity: Biometric face scan + DID + VC (ZK-proof)\nLedger: Optional off-chain ledger for institutional use\nFrontend: React, Web3.js\nSimulation: Vercel-hosted interactive DApp\nMetaPay is more than a prototype. It’s a scalable blueprint for fair, transparent, and programmable digital basic income."
            },
            {
                "author": "metapay_gyuha",
                "comment": "MetaPay – Visual Tech Summary\nThis 1-page summary illustrates how MetaPay enables a sustainable circular basic income using digital wallets, DID/ZK-ID verification, and smart automated fund recycling. Designed to be clear for both developers and policymakers.\nKey structure:\n• ₩25T distributed monthly\n• 10% recollected from wallet balances every month-end\n• Reused for next cycle – no tax increase needed\n• Verified via secure ZK-ID logic\nPDF Download: MetaPay_Visual_TechSummary_EN.pdf\nContact: metapay.gyuha@gmail.com\nYouTube Explainer: https://youtu.be/e4IH_uGN-ck"
            },
            {
                "author": "metapay_gyuha",
                "comment": "MetaPay – Circulating Basic Income DApp: Full Test Completed\nFollowing the previous policy design submission, we have now completed a working DApp prototype of the MetaPay model – a self-sustaining, tax-free basic income system based on monthly distribution and digital recollection.\nThe DApp was developed using:\nSolidity for smart contract logic\nVite + React for front-end\nMetaMask integration for all transactions (wallet connection, signing, gas usage)\nEthers.js for contract interaction\nLocal simulation of wallet ecosystem (1 owner + 5 virtual wallets)\nThe core mechanism is as follows:\nEvery month, the owner (government) distributes ₩500,000 worth of basic income to each citizen’s wallet.\nOn the 10th month, 10% of the remaining balance is automatically recollected per wallet.\nThis collected amount (₩25 trillion equivalent in simulation) becomes the next month’s funding source.\nThe cycle then repeats endlessly without the need for new taxation or deficit spending.\nIn the simulation:\nWe distributed funds 5 times to 5 wallets.\nEach distribution reduced the owner balance and increased user balances accurately.\nAfter triggering collect(), exactly 10% of each balance was recollected and transferred back to the owner.\nAll balances were checked in real-time through the UI.\nMetaMask popped up for every transaction (signing/confirmation), confirming real smart contract interaction.\nWe recorded a 2-minute full-screen demo video showing:\nWallet connection\n5x distributions (with UI & balance changes)\nFinal recollection (with updated balances and contract status)\nMetaMask interactions\nVisual proof of automatic logic and gas-based validation\nThis prototype reflects the technical feasibility of the architecture I submitted in the Bonus Track, including:\nIdentity-linked DID logic (to be integrated later)\nTransparent on-chain tracking\nPeriodic smart contract triggers\nReal wallet-based simulation of macro-scale economy\nMetaPay aims to solve a universal economic challenge: how to provide universal basic income without additional taxation or inflation, while ensuring transparency and long-term sustainability.\nI’d love to present this prototype in an unofficial Vibe Session, if possible. Please let me know if that could be arranged\nThe video demo and DApp can be shared upon request. Feedback and collaboration welcome!"
            },
            {
                "author": "metapay_gyuha",
                "comment": "Can Basic Income Work Without Taxes?\nMetaPay DApp Simulation Completed – Feedback Welcome\nHi HyperHack team and community\nI’ve developed a DApp prototype of the MetaPay Circulating Basic Income Model, which demonstrates a structure where a single initial fund circulates permanently without new taxes.\nThis post shares our simulation results and invites your feedback on the current build.\nTL;DR\nDistributed ₩500,000 to each of 5 wallets (5 rounds tested)\n10% recollection per wallet works as expected\nReal-time UI updates + MetaMask integration confirmed\nAll actions are manually triggered via buttons\nFeedback requested on real wallet usage & automated logic\nWhat Works in the Current Version\nThe admin wallet (government) successfully distributed ₩500,000 to each of 5 test wallets, five times\nOn clicking collect(), 10% of each wallet’s balance was recollected and returned to the admin wallet\nBoth distribution and recollection are executed manually via user-triggered buttons\nThe demo video shows 5 rounds of distribution followed by 1 recollection, all via visible button clicks\nAll balances updated in real-time through the UI, and all transactions were processed via MetaMask with proper gas fees and confirmation\nSmart Contract Core Logic\ndistribute() – sends ₩500,000 to each user in the list\ncollect() – recalls 10% of each wallet’s current balance\nBalances are stored in: mapping(address => uint256) public balanceOf\nAll actions require MetaMask signature and gas confirmation\nWhy We Used a Simplified Test Setup\nTo ensure stability and repeatability, the simulation used 5 hard-coded virtual wallet addresses\nInitial tests with real MetaMask wallets encountered intermittent issues (e.g., gas estimation failure, RPC errors)\nSo, we focused first on verifying the core distribution-recollection loop in a controlled environment\nWhat’s Next\nIntegrate real MetaMask-connected user wallets\nAdd DID or ZK-based identity verification\nImplement scheduled/condition-based triggers for distribution & recollection\nScale test with 100+ wallets for full simulation and stress testing\nDemo Video (2 minutes)\nThe video demonstrates how MetaPay works in practice:\nWallet connection → 5x distribution via button clicks → 1 recollection → UI balance updates → MetaMask confirmations\nWatch the Demo (Google Drive)\nFeedback Requested\nIf you have a moment, we’d really appreciate your thoughts on:\nIs it acceptable to use hard-coded virtual wallets for PoC simulations at this stage? (Yes/No)\nAny known tips or best practices for stabilizing real wallet use in test environments?\nDo you recommend specific tools (e.g., Chainlink, schedulers) for automating periodic smart contract execution?\nMetaPay is an experimental attempt to turn a tax-free, self-sustaining basic income system into functioning code.\nWe know it’s not perfect yet, but we hope it sparks curiosity and collaboration.\nThank you very much for your time"
            },
            {
                "author": "metapay_gyuha",
                "comment": "Can Basic Income Work Without Taxes?\nMetaPay DApp Simulation Completed – Feedback Welcome\nHi HyperHack team and community\nI’ve developed a DApp prototype of the MetaPay Circulating Basic Income Model, which demonstrates a structure where a single initial fund circulates permanently without new taxes.\nThis post shares our simulation results and invites your feedback on the current build.\nTL;DR\nDistributed ₩500,000 to each of 5 wallets (5 rounds tested)\n10% recollection per wallet works as expected\nReal-time UI updates + MetaMask integration confirmed\nAll actions are manually triggered via buttons\nFeedback requested on real wallet usage & automated logic\nWhat Works in the Current Version\nThe admin wallet (government) successfully distributed ₩500,000 to each of 5 test wallets, five times\nOn clicking collect(), 10% of each wallet’s balance was recollected and returned to the admin wallet\nBoth distribution and recollection are executed manually via user-triggered buttons\nThe demo video shows 5 rounds of distribution followed by 1 recollection, all via visible button clicks\nAll balances updated in real-time through the UI, and all transactions were processed via MetaMask with proper gas fees and confirmation\nSmart Contract Core Logic\ndistribute() – sends ₩500,000 to each user in the list\ncollect() – recalls 10% of each wallet’s current balance\nBalances are stored in: mapping(address => uint256) public balanceOf\nAll actions require MetaMask signature and gas confirmation\nWhy We Used a Simplified Test Setup\nTo ensure stability and repeatability, the simulation used 5 hard-coded virtual wallet addresses\nInitial tests with real MetaMask wallets encountered intermittent issues (e.g., gas estimation failure, RPC errors)\nSo, we focused first on verifying the core distribution-recollection loop in a controlled environment\nWhat’s Next\nIntegrate real MetaMask-connected user wallets\nAdd DID or ZK-based identity verification\nImplement scheduled/condition-based triggers for distribution & recollection\nScale test with 100+ wallets for full simulation and stress testing\nDemo Video (2 minutes)\nThe video demonstrates how MetaPay works in practice:\nWallet connection → 5x distribution via button clicks → 1 recollection → UI balance updates → MetaMask confirmations\nWatch the Demo (Google Drive)\nFeedback Requested\nIf you have a moment, we’d really appreciate your thoughts on:\nIs it acceptable to use hard-coded virtual wallets for PoC simulations at this stage? (Yes/No)\nAny known tips or best practices for stabilizing real wallet use in test environments?\nDo you recommend specific tools (e.g., Chainlink, schedulers) for automating periodic smart contract execution?\nMetaPay is an experimental attempt to turn a tax-free, self-sustaining basic income system into functioning code.\nWe know it’s not perfect yet, but we hope it sparks curiosity and collaboration.\nThank you very much for your time"
            },
            {
                "author": "metapay_gyuha",
                "comment": "@han\nHello! I wanted to kindly bring to your attention a feedback request I shared above on the MetaPay DApp simulation. It’s a PoC exploring tax-free basic income through digital currency. If you have a moment to take a look or share any insights, it would mean a lot. Thank you in advance!"
            },
            {
                "author": "han",
                "comment": "Thanks for the reminder! I’ll check out the MetaPay DApp simulation soon and share my thoughts. Appreciate you looping me in!"
            },
            {
                "author": "metapay_gyuha",
                "comment": "MetaPay – Looking for UI/UX feedback and simulation testers!\nHi builders and thinkers\nI’m currently working on MetaPay, a Web3-based circular basic income simulator designed to prove that Universal Basic Income (UBI) can be sustainable — without raising taxes.\nWhat is MetaPay?\nMost UBI models struggle with:\nLack of sustainable funding\nTax burdens and redistribution resistance\nOne-way payouts with no structural loop\nMetaPay solves this through a self-sustaining cycle:\nDistribute 500 MetaPay tokens monthly to users\nReclaim 10% of unspent MetaPay at the end of each round\nUse reclaimed tokens to fund the next round\n→ A repeatable “Distribute → Reclaim → Redistribute” loop\n→ Inflation-proof, transparent, and gamified via smart contracts\nTech Stack\nVite + React + ethers.js (Frontend)\nSolidity (EVM Smart Contract)\nManual wallet simulation for now (Next: full automation)\n10 test wallets simulate circulation\nFull code & ABI on GitHub\nResources\nLive DApp (manual simulation):\nhttps://meta-pay.vercel.app\nGitHub repo:\nhttps://github.com/metapay-creator/MetaPay\nDemo video:\nhttps://drive.google.com/file/d/1e-N4DTBXr-xJYKlSI05Vw90m7eNmLPCQ/view\nYouTube intro (Concept & simulation):\nhttps://youtu.be/e4lH_uGN-ck\nI Need Help With:\nUI/UX feedback for wallet view + token flow clarity\nSuggestions for gamification (leaderboard? badges?)\nHelp with animation, dashboard graphs or time-loop UI\nAny thoughts on economic/policy realism & terminology\nI’m also planning a real-time simulation event (with 10 users, multiple rounds over 20 minutes). If you’re interested, let me know — you’ll receive a MetaPay test wallet and get featured on X\nComment or DM if you want to test, collaborate, or just share ideas.\nLet’s build something that can shift real-world policy with transparent code\n\n#HyperHack #MetaPay #BasicIncome #Web3 #SocialImpact #Hackathon #BuildInPublic"
            },
            {
                "author": "metapay_gyuha",
                "comment": "Project: MetaPay – Circulating Basic Income with Smart Contracts\nMetaPay is a self-sustaining basic income system built on smart contracts and digital currency.\nIt distributes a fixed amount monthly to citizen wallets and recollects a small portion of unused balances to fund future payments.\nThis creates a sustainable economic loop without requiring additional taxation.\nGitHub (Source code): GitHub - metapay-creator/MetaPay-\nDemo Video: Link will be posted after the Vibe session (July 2nd)\nTest DApp: Not deployed yet – available in GitHub repository\nFeedback and collaboration are always welcome!"
            }
        ]
    },
    {
        "id": "090a7eefe1ef6745",
        "topic_id": "6368",
        "title": "Some colorful event",
        "url": "https://forum.ceg.vote/t/some-colorful-event/6368",
        "views": "",
        "comments": "0",
        "created_date": "Jul 15, 2025 3:11 pm",
        "latest_activity": "Jul 15, 2025 3:11 pm",
        "content": "Welcome to Hyperion Announcements\nJUL\n18\nTest colorful event\nPublic\n·\nCreated by\nAndrei\nFri, Jul 18 3:08 PM → 4:08 PM (Abidjan)\n2",
        "comments_details": [
            {
                "author": "Andrei",
                "comment": "Welcome to Hyperion Announcements\nJUL\n18\nTest colorful event\nPublic\n·\nCreated by\nAndrei\nFri, Jul 18 3:08 PM → 4:08 PM (Abidjan)\n2"
            }
        ]
    },
    {
        "id": "065a7cd24b767b99",
        "topic_id": "5233",
        "title": "BOLTIS - Real Time Decentralized Card Battle",
        "url": "https://forum.ceg.vote/t/boltis-real-time-decentralized-card-battle/5233",
        "views": "",
        "comments": "11",
        "created_date": "Jun 4, 2025 1:08 pm",
        "latest_activity": "Jul 15, 2025 2:56 pm",
        "content": "Live Link: https://boltis.fun/\nProject Name\nBOLTIS - Real Time Decentralized Card Battle\nProblem Statement\nTraditional mobile card games like Uno suffer from fundamental transparency issues - players cannot verify if games are rigged or fair due to closed-source, centralized systems. Additionally, these games are platform-locked (Uno mobile only works on mobile devices) and require downloads, installations, and updates that create accessibility barriers. Meanwhile, existing “GameFi” projects claiming to be on-chain still rely on off-chain servers for actual multiplayer gameplay, only tokenizing surface-level assets as NFTs. Current fully on-chain games sacrifice real-time responsiveness, creating frustrating delays that break the flow of competitive card gaming.\nSolution Overview\nBOLTIS delivers the first truly decentralized, real-time multiplayer card game that maintains competitive speed through METIS blockchain’s HYPERION rollup technology. Unlike traditional mobile games that are platform-locked and require installations, BOLTIS runs instantly in any browser on any device - desktop, mobile, tablet - without downloads or updates. Every move is transparently verifiable on-chain, eliminating concerns about rigged gameplay. Unlike other GameFi projects, the entire game logic runs on-chain with 250ms response times, proving that decentralized gaming can match centralized performance while being universally accessible.\nProject Description\nBOLTIS revolutionizes card gaming by solving trust, performance, and accessibility issues plaguing both traditional and blockchain games. Unlike Uno mobile games locked to mobile platforms with unverifiable shuffles, BOLTIS works on any device with instant browser access and every action cryptographically verified on-chain.\nUsing Three.js runtime engine, players instantly jump into decentralized multiplayer matches from desktop, mobile, or tablet without downloads. The METIS HYPERION rollup executes complete game logic on-chain with 250ms response times, proving true decentralization doesn’t sacrifice performance.\nUnlike GameFi projects that only tokenize assets while running gameplay on centralized servers, BOLTIS runs everything on-chain - ensuring transparent, provably fair competition. Players engage in fast-paced, skill-intensive card battles requiring quick thinking and strategy.\nWhat excites us most is creating the first truly trustless card gaming experience more accessible than traditional mobile games. Players compete from anywhere, knowing every move is cryptographically guaranteed fair. This combination of proven fairness, universal accessibility, and addictive gameplay creates unprecedented gaming where skill determines victory, not platform limitations or hidden algorithms.\nCommunity Engagement Features\nTestable Features & Gamification:\nQuick Match (10 pts): Complete a match under 5 minutes\nTutorial Completion (25 pts): Finish skill-based tutorial\nToken Staking (50 pts): Participate in competitive room match\nCross-Device Play (30 pts): Play same account on mobile and desktop\nWin Streak (75 pts): Win 3 consecutive matches\nTransparency Check (40 pts): Verify on-chain moves via block explorer\nPerformance Test (35 pts): Document HYPERION response times\nPoints unlock exclusive card designs, tournament access, and beta rankings with potential token rewards.\nGetting Involved\nJoin the BOLTIS Community:\nAlpha Testing: Sign up for early access at our team discord Theras Labs, we won multiple cross-chain game previously and continue to build, and now we intend to build card-game to test core gameplay and provide feedback. This game also will be open in discord game section beside within our website\nDiscord Community: Join our active Discord server for real-time discussions, strategy sharing, and direct developer interaction\nDeveloper Contributions: Submit pull requests for open-source components, particularly Three.js optimizations and blockchain integration improvements\nContent Creation: Help create tutorials, strategy guides, or promotional content for community rewards\nTournament Organization: Experienced players can organize community tournaments and events\nFeedback & Testing: Participate in weekly testing sessions and help refine game balance through structured feedback sessions\nContact: Reach out via Discord Theras Labs , TG @theraslabs , or X-Twitter https://x.com/theras_labs or email contact@theras.xyz for specific contribution interests.",
        "comments_details": [
            {
                "author": "0xdellwatson",
                "comment": "Live Link: https://boltis.fun/\nProject Name\nBOLTIS - Real Time Decentralized Card Battle\nProblem Statement\nTraditional mobile card games like Uno suffer from fundamental transparency issues - players cannot verify if games are rigged or fair due to closed-source, centralized systems. Additionally, these games are platform-locked (Uno mobile only works on mobile devices) and require downloads, installations, and updates that create accessibility barriers. Meanwhile, existing “GameFi” projects claiming to be on-chain still rely on off-chain servers for actual multiplayer gameplay, only tokenizing surface-level assets as NFTs. Current fully on-chain games sacrifice real-time responsiveness, creating frustrating delays that break the flow of competitive card gaming.\nSolution Overview\nBOLTIS delivers the first truly decentralized, real-time multiplayer card game that maintains competitive speed through METIS blockchain’s HYPERION rollup technology. Unlike traditional mobile games that are platform-locked and require installations, BOLTIS runs instantly in any browser on any device - desktop, mobile, tablet - without downloads or updates. Every move is transparently verifiable on-chain, eliminating concerns about rigged gameplay. Unlike other GameFi projects, the entire game logic runs on-chain with 250ms response times, proving that decentralized gaming can match centralized performance while being universally accessible.\nProject Description\nBOLTIS revolutionizes card gaming by solving trust, performance, and accessibility issues plaguing both traditional and blockchain games. Unlike Uno mobile games locked to mobile platforms with unverifiable shuffles, BOLTIS works on any device with instant browser access and every action cryptographically verified on-chain.\nUsing Three.js runtime engine, players instantly jump into decentralized multiplayer matches from desktop, mobile, or tablet without downloads. The METIS HYPERION rollup executes complete game logic on-chain with 250ms response times, proving true decentralization doesn’t sacrifice performance.\nUnlike GameFi projects that only tokenize assets while running gameplay on centralized servers, BOLTIS runs everything on-chain - ensuring transparent, provably fair competition. Players engage in fast-paced, skill-intensive card battles requiring quick thinking and strategy.\nWhat excites us most is creating the first truly trustless card gaming experience more accessible than traditional mobile games. Players compete from anywhere, knowing every move is cryptographically guaranteed fair. This combination of proven fairness, universal accessibility, and addictive gameplay creates unprecedented gaming where skill determines victory, not platform limitations or hidden algorithms.\nCommunity Engagement Features\nTestable Features & Gamification:\nQuick Match (10 pts): Complete a match under 5 minutes\nTutorial Completion (25 pts): Finish skill-based tutorial\nToken Staking (50 pts): Participate in competitive room match\nCross-Device Play (30 pts): Play same account on mobile and desktop\nWin Streak (75 pts): Win 3 consecutive matches\nTransparency Check (40 pts): Verify on-chain moves via block explorer\nPerformance Test (35 pts): Document HYPERION response times\nPoints unlock exclusive card designs, tournament access, and beta rankings with potential token rewards.\nGetting Involved\nJoin the BOLTIS Community:\nAlpha Testing: Sign up for early access at our team discord Theras Labs, we won multiple cross-chain game previously and continue to build, and now we intend to build card-game to test core gameplay and provide feedback. This game also will be open in discord game section beside within our website\nDiscord Community: Join our active Discord server for real-time discussions, strategy sharing, and direct developer interaction\nDeveloper Contributions: Submit pull requests for open-source components, particularly Three.js optimizations and blockchain integration improvements\nContent Creation: Help create tutorials, strategy guides, or promotional content for community rewards\nTournament Organization: Experienced players can organize community tournaments and events\nFeedback & Testing: Participate in weekly testing sessions and help refine game balance through structured feedback sessions\nContact: Reach out via Discord Theras Labs , TG @theraslabs , or X-Twitter https://x.com/theras_labs or email contact@theras.xyz for specific contribution interests."
            },
            {
                "author": "zuzuzu",
                "comment": "what an interesting game .. i have few question for the game\nHow fast is the gameplay if everything runs on-chain?\nWhat kind of rewards can players earn through the gamified point system?\nHow can I join the alpha test or get involved with the community?"
            },
            {
                "author": "0xdellwatson",
                "comment": "It is using Hyperion, L2 Metis, and can roughly do 250ms per txs, which is enough for a card game or turn-based player. I have made a game with Ephemeral Rollup on another blockchain with 10ms txs for Third person mmo game, and you can find it on my Twitter account. So this time, I’m making card game battle which is addictive as well.\nPlayers earn token rewards, which they will use to compete back into the game. If you know the Uno Mobile game, it would be similar, and players with a lower amount of tokens will compete in different leagues. The gamified system is normal because this is a game where earning points through activities, leaderboards, etc. is a default feature for a game.\nAnyone can join directly through the browser, as it’s a browser game with WebGPU. There’s no need for installation, and fast load render on website, so you can open it immediately. The dev team can provide quick updates to due to the nature of browser development. Unlike other games built on engines such as Unity, they need to bake it into the application, so every iteration update is also overwhelming to make it a public update and involve the community even if it’s unity-browser game."
            },
            {
                "author": "0xdellwatson",
                "comment": "Testing for card gameplay, this will be a 3D game in the browser. Although I have built other 3D MMO-platformers in the browser, the game doesn’t need to be at the AAA level to be addictive.\nUno Mobile has proven that a simple multiplayer card battle can be engaging for hours.\nI’ve created a new type of board game. This game will have element-based battles (currently starting with 3-5 basic elements: fire, water, plant, thunder, ground). I’m looking for feedback on the card battle idea, which should be ready by the end of June if the idea is still approved.\nSneakpeak of simple visual 3D cards here."
            },
            {
                "author": "priyankg3",
                "comment": "Hello\n@0xdellwatson\n, How are you?\nIs the gameplay more like Uno, Poker, or something completely different?"
            },
            {
                "author": "0xdellwatson",
                "comment": "This is the dev-mode picture, no-animation, just pure functionality for debugging flow.\nYou will see the rules and can try the game immediately with a bot. I will provide the link soon after June 15th.\nIt’s already fun because it’s a new board-game idea. Previously the game idea was a bit different with joker’s card but now, the gameplay will almost be like Uno mobile.\nThere will be no +2 or +4 wild cards. Instead, there will be elemental and black hole cards. A skillful player must remember all the cards that have been drawn, as they will be re-used.\nAfter that, we will make it into a blockchain multiplayer game with HYPERION. I’m expecting to be done even before July, so everyone can immediately experience the HYPERION rollup.\nThen proceed to go mainnet before August. So everyone can compete with real token"
            },
            {
                "author": "0xdellwatson",
                "comment": "GM GM,\nThe frontend is ready for testing. All of you can access it at https://boltis.fun. Currently, you can play against bots and try to learn. Please provide your feedback.\nSoon, we will be testing on publishers like Crazy-Gamers first, and on Steam, the Play Store, and the App Store to acquire more testers and players with off-chain server multiplayer.\nIn July, we will be creating the smart contract game server with Hyperion, shifting the game server into a smart contract."
            },
            {
                "author": "0xdellwatson",
                "comment": "Ah, I also make it open-source here, everyone feel free to see the code and contribute too.\nThis is generated with bolt ai-prompt, around end of July. we will change it into 3D look for high-end devices with more vfx.\nWe are also submitted into bolt hackathon and here’s our submission.\nI’m really transparent about everything, and want to promote the growth of open-source here.\nI’m indeed develop this software card-game around June 2025. A new fresh innovation for game-card battle.\nSo feel free to give me your feedback as the game will be adjusted according to the community, to make it fully balanced and fun.\nI’m welcoming to anyone who wants to join the team Theras Labs Inc too.\nWe have other project, but this BOLTIS is solo innovated and built by me."
            },
            {
                "author": "groworpay",
                "comment": "The game looks fun, I will join via Discord on follow on Twitter"
            },
            {
                "author": "CrisMetis",
                "comment": "Cool idea, I will definitely join Discord and join the Alpha test."
            },
            {
                "author": "crypto4ell",
                "comment": "The CIS community is ready to test your platform. Can you tell me if it is possible to do this in the very near future?"
            },
            {
                "author": "0xdellwatson",
                "comment": "you can try with the bots first now.\nbut with metis-testnet token and RT game server is really soon, should be within this week.\nfinalizing the leaderboards setup"
            }
        ]
    },
    {
        "id": "448fc9535969f249",
        "topic_id": "6177",
        "title": "Spotlight Campaign Timeline Update",
        "url": "https://forum.ceg.vote/t/spotlight-campaign-timeline-update/6177",
        "views": "",
        "comments": "3",
        "created_date": "Jul 7, 2025 4:09 pm",
        "latest_activity": "Jul 15, 2025 2:43 pm",
        "content": "Spotlight Campaign Update!\nDue to overwhelming demand and numerous requests from developers, we’ve extended the application deadline for the Spotlight Campaign!\nNew Application Deadline: July 11\nWe’ve heard you! To give more projects a chance to participate, we’ve extended the application period. Don’t miss out!\nUpdated Campaign End Date: August 7\nWe’ve also updated the campaign’s end date to ensure that projects who joined the Building Phase later have more time to participate and showcase their progress.",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "Spotlight Campaign Update!\nDue to overwhelming demand and numerous requests from developers, we’ve extended the application deadline for the Spotlight Campaign!\nNew Application Deadline: July 11\nWe’ve heard you! To give more projects a chance to participate, we’ve extended the application period. Don’t miss out!\nUpdated Campaign End Date: August 7\nWe’ve also updated the campaign’s end date to ensure that projects who joined the Building Phase later have more time to participate and showcase their progress."
            },
            {
                "author": "Norbert",
                "comment": "Giving more time for the community to apply, amplifying this! HyperHack Spotlight Campaign: Step-by-Step Playbook for Web3 Growth - #2"
            },
            {
                "author": "Ransome",
                "comment": "Thanks for giving the community a listening ear and extending the Spotlight Campaign\nBuildoors are happy!"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "I am confused, the spotlight was postponed twice now?"
            }
        ]
    },
    {
        "id": "b53a5f64ff7caf70",
        "topic_id": "6356",
        "title": "Say goodbye to overpriced audits. Say hello to MetaThink",
        "url": "https://forum.ceg.vote/t/say-goodbye-to-overpriced-audits-say-hello-to-metathink/6356",
        "views": "",
        "comments": "3",
        "created_date": "Jul 14, 2025 11:34 pm",
        "latest_activity": "Jul 15, 2025 2:38 pm",
        "content": "MetaThink AI — The Ultimate AI Companion for Web3\nThe ultimate assistant for devs and degens living on Web3.\nMetaThink AI is the first modular toolset made for devs and degens who live deep in Web3.\nCore Features\nCrypto Expert Bot – Token analysis, project insights & risk scores in seconds.\nSmart Audit – Analyze your contract, detect vulnerabilities, and generate a full PDF audit report.\nCreator Mode – Instantly generate threads, memes & branded content in crypto-native tones.\nPowered by $MTAI\n$MTAI is the utility token behind MetaThink—used as credits to run prompts, launch agents, and unlock premium features. Every AI interaction consumes $MTAI, directly linking token utility to intelligence output.\nTeam\nCEO — Martín Guerrero (https://www.linkedin.com/in/guerrerofounder/) (Has over 4 years of Web3 experience, driving projects such as: Spatial, (https://www.spatial.io/) Ora Protocol, (https://www.ora.io/) and Coindesk (https://www.coindesk.com/) across marketing, research, and business development roles.)\nGrowth — Lucas Barranco (https://www.linkedin.com/in/lucas-barranco-305b3935a/) (Leads MetaThink’s growth strategy, bringing experience from Render Network (https://rendernetwork.com/) and Internet Computer Protocol to expand crypto and DeFi ecosystems)\nCTO — Micaela Marca (Leads (https://www.linkedin.com/in/micaela-marca-martinez-91962235a/) MetaThink’s tech development, with experience at Ripple (Financial Infrastructure & Blockchain Technology Solutions | Ripple) and Polkadot (https://polkadot.com/) building scalable, secure Web3 applications.)\nCMO — Santi Mancini (https://www.linkedin.com/in/facundomancini/) (Drives MetaThink’s brand and community growth, with a background leading content at Spatial (https://www.spatial.io/) and managing Web3 project communities.)\nStrategic Advisors:\n– Isaac Wellner (Particle Network – Binance Listed) (https://www.linkedin.com/in/isaac-wellner/)\nYen Ray ( Prev 500 Global Vc and RHL Ventures ) (https://www.linkedin.com/in/yen-ray-ng?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app)\n– Mikhail Gaponenko (Galxe-Xyro) (https://www.linkedin.com/in/gaponenko-mikhail/)\n– Regan Peng ( Co founder Pin AI +10M Funding ) (https://www.linkedin.com/in/reganpeng/)\n– Min (Web3 Games, Twitter: @MinWeb3Games) (https://x.com/MinWeb3Games)\n– Daniel “0xShakesBeare” (Ora Protocol, Twitter: @0xShakesBeare) (https://x.com/0xShakesBeare)\nAnton Germashev ( CTO - Datai Network ) Main support for our coding. (Anton Germashev - Datai Network | LinkedIn)\nStrategic Highlights\n– Tier 1 Exchange Listings slated for Q3 2025\n– 2,500+ organic signups in under 14 days\n5.000+ Smart Contracts Analyzed\nWebsite (https://metathinkai.com/) |\nDocs (Intro | Meta Think AI) |\nLinkedIn (MetaThink AI | LinkedIn) |\nTokenomics (METATHINK $MTAI Tokenomics v1 - Google Sheets) |\nPitch Deck (https://www.canva.com/design/DAGqJ9S_wT4/QcsaJCGi72xeYv64-pS8PA/edit?utm_content=DAGqJ9S_wT4&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton)|\nSocials (Coming Soon)",
        "comments_details": [
            {
                "author": "MetaThink",
                "comment": "MetaThink AI — The Ultimate AI Companion for Web3\nThe ultimate assistant for devs and degens living on Web3.\nMetaThink AI is the first modular toolset made for devs and degens who live deep in Web3.\nCore Features\nCrypto Expert Bot – Token analysis, project insights & risk scores in seconds.\nSmart Audit – Analyze your contract, detect vulnerabilities, and generate a full PDF audit report.\nCreator Mode – Instantly generate threads, memes & branded content in crypto-native tones.\nPowered by $MTAI\n$MTAI is the utility token behind MetaThink—used as credits to run prompts, launch agents, and unlock premium features. Every AI interaction consumes $MTAI, directly linking token utility to intelligence output.\nTeam\nCEO — Martín Guerrero (https://www.linkedin.com/in/guerrerofounder/) (Has over 4 years of Web3 experience, driving projects such as: Spatial, (https://www.spatial.io/) Ora Protocol, (https://www.ora.io/) and Coindesk (https://www.coindesk.com/) across marketing, research, and business development roles.)\nGrowth — Lucas Barranco (https://www.linkedin.com/in/lucas-barranco-305b3935a/) (Leads MetaThink’s growth strategy, bringing experience from Render Network (https://rendernetwork.com/) and Internet Computer Protocol to expand crypto and DeFi ecosystems)\nCTO — Micaela Marca (Leads (https://www.linkedin.com/in/micaela-marca-martinez-91962235a/) MetaThink’s tech development, with experience at Ripple (Financial Infrastructure & Blockchain Technology Solutions | Ripple) and Polkadot (https://polkadot.com/) building scalable, secure Web3 applications.)\nCMO — Santi Mancini (https://www.linkedin.com/in/facundomancini/) (Drives MetaThink’s brand and community growth, with a background leading content at Spatial (https://www.spatial.io/) and managing Web3 project communities.)\nStrategic Advisors:\n– Isaac Wellner (Particle Network – Binance Listed) (https://www.linkedin.com/in/isaac-wellner/)\nYen Ray ( Prev 500 Global Vc and RHL Ventures ) (https://www.linkedin.com/in/yen-ray-ng?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app)\n– Mikhail Gaponenko (Galxe-Xyro) (https://www.linkedin.com/in/gaponenko-mikhail/)\n– Regan Peng ( Co founder Pin AI +10M Funding ) (https://www.linkedin.com/in/reganpeng/)\n– Min (Web3 Games, Twitter: @MinWeb3Games) (https://x.com/MinWeb3Games)\n– Daniel “0xShakesBeare” (Ora Protocol, Twitter: @0xShakesBeare) (https://x.com/0xShakesBeare)\nAnton Germashev ( CTO - Datai Network ) Main support for our coding. (Anton Germashev - Datai Network | LinkedIn)\nStrategic Highlights\n– Tier 1 Exchange Listings slated for Q3 2025\n– 2,500+ organic signups in under 14 days\n5.000+ Smart Contracts Analyzed\nWebsite (https://metathinkai.com/) |\nDocs (Intro | Meta Think AI) |\nLinkedIn (MetaThink AI | LinkedIn) |\nTokenomics (METATHINK $MTAI Tokenomics v1 - Google Sheets) |\nPitch Deck (https://www.canva.com/design/DAGqJ9S_wT4/QcsaJCGi72xeYv64-pS8PA/edit?utm_content=DAGqJ9S_wT4&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton)|\nSocials (Coming Soon)"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "I would like to know the problems meta think solves, there should be more to the story."
            },
            {
                "author": "MetaThink",
                "comment": "Thanks for the question!\nMetaThink Audit focuses on making fast, reliable smart contract security accessible to every builder and degen — without the heavy costs and delays of traditional audits.\nKey vulnerabilities we detect:\nReentrancy attacks\nInteger underflow & overflow\nUnchecked low-level calls\nUse of tx.origin for authentication\nTimestamp dependency\nDenial of Service (DoS) via gas block\nUnprotected public/external functions\nState variable shadowing\nUninitialized storage pointers\nInsecure use of delegatecall\nThese are just part of our growing database of over 150+ vulnerability detectors.\nWatch a quick demo of how MetaThink Audit works:\n[ Watch video (Loom)]: How to use MetaThink! | Loom)\nCompatible with any EVM chain\nOur tool works with any Solidity-based smart contract — whether it’s for NFTs, tokens, or DeFi protocols."
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "This is quite intuitive, and I must say it’s a great pitch."
            }
        ]
    },
    {
        "id": "7a0fb759649915ad",
        "topic_id": "6366",
        "title": "DevRel Metrics That Actually Matter (And No, It’s Not Just Twitter Likes)",
        "url": "https://forum.ceg.vote/t/devrel-metrics-that-actually-matter-and-no-it-s-not-just-twitter-likes/6366",
        "views": "",
        "comments": "0",
        "created_date": "Jul 15, 2025 2:38 pm",
        "latest_activity": null,
        "content": "If you’ve worked in DevRel, you know the question’s coming sooner or later:\n“So… how do we measure all this?”\nIt’s a fair ask — but the answer is rarely simple. Because DevRel doesn’t sit neatly in one function. It touches product, marketing, community, and support. That means traditional metrics often miss the mark.\nSo here’s a breakdown of the DevRel signals I’ve found actually useful — especially in early-stage ecosystems:\n1. Developer Activation, Not Just Signups\nVanity: # of developers who registered\nReal: # of developers who built something or used your SDK within 7 days\n2. Meaningful Community Engagement\nVanity: Discord member count\nReal: % of community members participating in technical threads, answering others’ questions, or submitting GitHub issues\n3. Documentation Feedback Loop\nReal DevRel impact shows up in how often your docs get flagged, updated, or improved — and who’s driving that loop (hint: engaged developers)\n4. Time to First Hello World\nHow long does it actually take a dev to go from “I heard about this” → to “I deployed a test project”?\nThe shorter that path, the stronger your DevRel + DX are.\n5. Developer Sentiment (Yes, It’s Qualitative)\nIf the only signals you track are quant, you’ll miss the why.\nSurveys, interviews, casual 1:1s — these are your best leading indicators.\nDevRel isn’t just about reach. It’s about developer momentum.\nWhat other signals have you tracked that actually showed impact?",
        "comments_details": [
            {
                "author": "nidhinakranii",
                "comment": "If you’ve worked in DevRel, you know the question’s coming sooner or later:\n“So… how do we measure all this?”\nIt’s a fair ask — but the answer is rarely simple. Because DevRel doesn’t sit neatly in one function. It touches product, marketing, community, and support. That means traditional metrics often miss the mark.\nSo here’s a breakdown of the DevRel signals I’ve found actually useful — especially in early-stage ecosystems:\n1. Developer Activation, Not Just Signups\nVanity: # of developers who registered\nReal: # of developers who built something or used your SDK within 7 days\n2. Meaningful Community Engagement\nVanity: Discord member count\nReal: % of community members participating in technical threads, answering others’ questions, or submitting GitHub issues\n3. Documentation Feedback Loop\nReal DevRel impact shows up in how often your docs get flagged, updated, or improved — and who’s driving that loop (hint: engaged developers)\n4. Time to First Hello World\nHow long does it actually take a dev to go from “I heard about this” → to “I deployed a test project”?\nThe shorter that path, the stronger your DevRel + DX are.\n5. Developer Sentiment (Yes, It’s Qualitative)\nIf the only signals you track are quant, you’ll miss the why.\nSurveys, interviews, casual 1:1s — these are your best leading indicators.\nDevRel isn’t just about reach. It’s about developer momentum.\nWhat other signals have you tracked that actually showed impact?"
            }
        ]
    },
    {
        "id": "66f9511994e67bd7",
        "topic_id": "6056",
        "title": "HyperHack Spotlight Campaign: Step-by-Step Playbook for Web3 Growth",
        "url": "https://forum.ceg.vote/t/hyperhack-spotlight-campaign-step-by-step-playbook-for-web3-growth/6056",
        "views": "",
        "comments": "3",
        "created_date": "Jun 30, 2025 3:02 pm",
        "latest_activity": "Jul 15, 2025 2:33 pm",
        "content": "You are a Web3 builder challenging for the $200k prize pool in the HyperHack. You also would not mind a share of the Spotlight Campaign $7500 prize pool. So ‘wen marketing’? Now it is time to make the most of your $500 marketing credits and build an initial community and user base.\nThis post gives you a set of specific growth strategies you can copy or adapt. Many brilliant developers are not sure how to approach marketing. That is completely normal. These ideas are designed to give you a structured template or just a starting point.\nUse these steps exactly as written or get creative and put your own twist on them. And remember, you are free to use the $500 however you want. Any creative marketing tactic is fair game.\nI. Foundation: Define Growth Goals and Core Metrics\nBefore spending anything, get clear on what success looks like.\nSet Clear Objectives\nDo you want more dApp testers, Twitter followers, DAO voters, or product feedback? Pick one or two core goals and let them guide all your actions.\nIdentify Target Audiences\nAre you speaking to developers, early users, Metis fans, or curious crypto explorers? Your content should meet them where they are.\nII. User Acquisition: Low-Cost, High-Impact Plays\nYour $500 is enough to bring in users fast. Focus on plays that drive visibility and measurable results.\nQuest Campaigns (TaskOn, Magic Square, Zealy)\nThese platforms let you reward users for completing actions like following your Twitter, testing your dApp, or joining your Telegram. TaskOn and Magic Square are partners of HyperHack so we highly recommend them and they will be fast to support you if you run into any issues.\nQuest Playbook:\nChoose your platform\nAdd 5 to 7 simple engaging tasks\nTasks can be interacting with your key tweets, joining socials, onchain interactions, promoting your project etc\nSet aside $100 to $150 in rewards\nPromote across Twitter and the Hyperion Forum\nTwitter Ads for Targeted Growth\nTwitter is where your early users live. Whether you are building for devs, degen traders, or DAO voters, this is where they spend time. Use part of your budget to get in front of them.\nYou have two options:\nBoost Promote a tweet:\nPick a tweet with a strong call to action. Major announcements and creative marketing tweets can be boosted. It should explain your value clearly and include a link to your dApp, quest board, or community.\nUse the built-in Promote Boost feature.\nBoost Tweet Playbook:\nClick the Promote button in the right hand corner of the tweet\nSelect one country to target\nSelect a specific age range (for example, 18 to 45)\nStart with a $10 boost over 24 hours and assess results\nTrack analytics and iterate\nCreate a sponsored Ad campaign\nThis gives you deeper targeting options. You can reach people based on who they follow and what keywords they engage with. This approach works if you are looking for a precise type of people to connect with. For example Web3 AI developers or AI product testers.\nSponsored Ad Playbook:\nUse Twitter’s Ads Manager\nSelect your preferred targeting options (location, demographics, keywords, interests etc)\nRun a few $10 Ads over 24 hours and wait until you have a decent performing Ad before you scale up the spending\nHigh performing Ads in crypto in general can have something like a Cost Per Click (CPC) of $0.5 and engagement rates of 5%+. However, this varies largely depending on your specific demographic targeting.\nShort Video Content\nSpend around $100 on a 10-20 second trailer that shows off your product, vision, or vibe.\nVideo Playbook:\nKeep it short and energetic\nInclude exciting background music, key words, product screenshots, clips of your UX etc\nPost it on Twitter and pin it\nBoost the tweet to reach more people\nYou can create the video yourself if you have basic editing skills\nHire a third party for around $100\nIf you need help finding someone, reach out to the Metis team for recommendations. Check this Forum post for more video creation tips.\nIt does not have to be a video either. You could create GIFs, memes, tutorials, infographics, or other visual content that quickly communicates your value and grabs attention. This type of content gives a strong first impression and helps convert curious visitors into active users.\nIII. Engagement and Retention: Keep Users Coming Back\nInitial traction is important. Long-term loyalty is what wins.\nHost a Twitter Space AMA\nHost one or more casual Spaces AMA on Twitter. Consider offering $50 to $100 in prizes to listeners who ask great questions or a random winner in a lucky draw to increase attendee numbers.\nAMA Spaces Playbook:\nPromote the Space 3-7 days before\nConnect with Metis influencers, ecosystem players, the main account to see if they will share it or join\nUse the opportunity to tell you and the projects story, get early user feedback, be personal\nRun a Q+A\nGive listeners call to actions like test your product or join socials\nJoin a Hyperion Vibe Session\nEvery Spotlight team must join one. This is your live moment with the Metis community.\nVibe Session Playbook:\nKeep your pitch under 20 minutes\nShare your screen and show the product/website/anything you have\nKeep it interactive by asking the DevRel team questions to make sure they are on the same page and understanding your pitch\nMonitor the youtube live chat and answer any questions that pop up live\nEnd with clear calls to action like test this app or join our group\nThis is your first impression for many in the ecosystem. Make it count.\nStay Active in the Hyperion Forum\nUse the HyperHack section of the Hyperion Forum to share progress updates, ask for feedback, and connect with other builders. This is your space to be visible and build momentum.\nFinal Advice: Copy What Works and Make It Yours\nFeel free to copy these playbooks directly. That is what they are here for. But do not be afraid to go off script and build your own version. If you team are not confident with marketing then we strongly recommend you consider bringing in a marketer.\nDon’t know one? Share your project and needs in the Marketing Guild and connect with marketers here.\nYou are building something great. Now show the world. Get creative and make your $500 marketing credit count!",
        "comments_details": [
            {
                "author": "Liametis",
                "comment": "You are a Web3 builder challenging for the $200k prize pool in the HyperHack. You also would not mind a share of the Spotlight Campaign $7500 prize pool. So ‘wen marketing’? Now it is time to make the most of your $500 marketing credits and build an initial community and user base.\nThis post gives you a set of specific growth strategies you can copy or adapt. Many brilliant developers are not sure how to approach marketing. That is completely normal. These ideas are designed to give you a structured template or just a starting point.\nUse these steps exactly as written or get creative and put your own twist on them. And remember, you are free to use the $500 however you want. Any creative marketing tactic is fair game.\nI. Foundation: Define Growth Goals and Core Metrics\nBefore spending anything, get clear on what success looks like.\nSet Clear Objectives\nDo you want more dApp testers, Twitter followers, DAO voters, or product feedback? Pick one or two core goals and let them guide all your actions.\nIdentify Target Audiences\nAre you speaking to developers, early users, Metis fans, or curious crypto explorers? Your content should meet them where they are.\nII. User Acquisition: Low-Cost, High-Impact Plays\nYour $500 is enough to bring in users fast. Focus on plays that drive visibility and measurable results.\nQuest Campaigns (TaskOn, Magic Square, Zealy)\nThese platforms let you reward users for completing actions like following your Twitter, testing your dApp, or joining your Telegram. TaskOn and Magic Square are partners of HyperHack so we highly recommend them and they will be fast to support you if you run into any issues.\nQuest Playbook:\nChoose your platform\nAdd 5 to 7 simple engaging tasks\nTasks can be interacting with your key tweets, joining socials, onchain interactions, promoting your project etc\nSet aside $100 to $150 in rewards\nPromote across Twitter and the Hyperion Forum\nTwitter Ads for Targeted Growth\nTwitter is where your early users live. Whether you are building for devs, degen traders, or DAO voters, this is where they spend time. Use part of your budget to get in front of them.\nYou have two options:\nBoost Promote a tweet:\nPick a tweet with a strong call to action. Major announcements and creative marketing tweets can be boosted. It should explain your value clearly and include a link to your dApp, quest board, or community.\nUse the built-in Promote Boost feature.\nBoost Tweet Playbook:\nClick the Promote button in the right hand corner of the tweet\nSelect one country to target\nSelect a specific age range (for example, 18 to 45)\nStart with a $10 boost over 24 hours and assess results\nTrack analytics and iterate\nCreate a sponsored Ad campaign\nThis gives you deeper targeting options. You can reach people based on who they follow and what keywords they engage with. This approach works if you are looking for a precise type of people to connect with. For example Web3 AI developers or AI product testers.\nSponsored Ad Playbook:\nUse Twitter’s Ads Manager\nSelect your preferred targeting options (location, demographics, keywords, interests etc)\nRun a few $10 Ads over 24 hours and wait until you have a decent performing Ad before you scale up the spending\nHigh performing Ads in crypto in general can have something like a Cost Per Click (CPC) of $0.5 and engagement rates of 5%+. However, this varies largely depending on your specific demographic targeting.\nShort Video Content\nSpend around $100 on a 10-20 second trailer that shows off your product, vision, or vibe.\nVideo Playbook:\nKeep it short and energetic\nInclude exciting background music, key words, product screenshots, clips of your UX etc\nPost it on Twitter and pin it\nBoost the tweet to reach more people\nYou can create the video yourself if you have basic editing skills\nHire a third party for around $100\nIf you need help finding someone, reach out to the Metis team for recommendations. Check this Forum post for more video creation tips.\nIt does not have to be a video either. You could create GIFs, memes, tutorials, infographics, or other visual content that quickly communicates your value and grabs attention. This type of content gives a strong first impression and helps convert curious visitors into active users.\nIII. Engagement and Retention: Keep Users Coming Back\nInitial traction is important. Long-term loyalty is what wins.\nHost a Twitter Space AMA\nHost one or more casual Spaces AMA on Twitter. Consider offering $50 to $100 in prizes to listeners who ask great questions or a random winner in a lucky draw to increase attendee numbers.\nAMA Spaces Playbook:\nPromote the Space 3-7 days before\nConnect with Metis influencers, ecosystem players, the main account to see if they will share it or join\nUse the opportunity to tell you and the projects story, get early user feedback, be personal\nRun a Q+A\nGive listeners call to actions like test your product or join socials\nJoin a Hyperion Vibe Session\nEvery Spotlight team must join one. This is your live moment with the Metis community.\nVibe Session Playbook:\nKeep your pitch under 20 minutes\nShare your screen and show the product/website/anything you have\nKeep it interactive by asking the DevRel team questions to make sure they are on the same page and understanding your pitch\nMonitor the youtube live chat and answer any questions that pop up live\nEnd with clear calls to action like test this app or join our group\nThis is your first impression for many in the ecosystem. Make it count.\nStay Active in the Hyperion Forum\nUse the HyperHack section of the Hyperion Forum to share progress updates, ask for feedback, and connect with other builders. This is your space to be visible and build momentum.\nFinal Advice: Copy What Works and Make It Yours\nFeel free to copy these playbooks directly. That is what they are here for. But do not be afraid to go off script and build your own version. If you team are not confident with marketing then we strongly recommend you consider bringing in a marketer.\nDon’t know one? Share your project and needs in the Marketing Guild and connect with marketers here.\nYou are building something great. Now show the world. Get creative and make your $500 marketing credit count!"
            },
            {
                "author": "Gigabriansmith",
                "comment": "Very helpful step by step! helps to have something which simplifies it to just: do this and see what happens rather than me keep wondering"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "Step is very helpful, but there have not been announcements partaining to the projects that are being spot-lighted. Or I would like an update on my own project success or failure in the spot light campaign."
            }
        ]
    },
    {
        "id": "121f622c9c84ba35",
        "topic_id": "6349",
        "title": "Most products don’t fail because of tech - they fail because no one cares enough to return",
        "url": "https://forum.ceg.vote/t/most-products-don-t-fail-because-of-tech-they-fail-because-no-one-cares-enough-to-return/6349",
        "views": "",
        "comments": "1",
        "created_date": "Jul 14, 2025 5:15 pm",
        "latest_activity": "Jul 15, 2025 1:44 pm",
        "content": "We spend months building, fixing bugs, polishing features. But the real question isn’t “does it work” or “is it fast.” It’s “why would anyone come back to this after day one.” Most projects don’t fail because the tech was bad. They fail because the product had no emotional gravity. No real pull. No identity people could attach to.\nYou can launch with hype, get a few thousand users, maybe even secure a grant. But what happens after the first use. After the first quest. After the airdrop is over. If your product doesn’t give people a reason to return, whether through ownership, recognition, progression, or even curiosity, it fades.\nThat’s an operational problem as much as a product one. Retention starts with how you build, how you design incentives, how you surface small wins, how you make users feel seen. And it’s something ops should own, not just marketing or product.\nSo I’m throwing this to the guild. What systems or strategies are you using to build return loops. Not just rewards and points, but real emotional anchors. What has worked in your ops to turn one-time users into regulars.\nLet’s dig into the difference between launch success and lasting impact.",
        "comments_details": [
            {
                "author": "Norbert",
                "comment": "We spend months building, fixing bugs, polishing features. But the real question isn’t “does it work” or “is it fast.” It’s “why would anyone come back to this after day one.” Most projects don’t fail because the tech was bad. They fail because the product had no emotional gravity. No real pull. No identity people could attach to.\nYou can launch with hype, get a few thousand users, maybe even secure a grant. But what happens after the first use. After the first quest. After the airdrop is over. If your product doesn’t give people a reason to return, whether through ownership, recognition, progression, or even curiosity, it fades.\nThat’s an operational problem as much as a product one. Retention starts with how you build, how you design incentives, how you surface small wins, how you make users feel seen. And it’s something ops should own, not just marketing or product.\nSo I’m throwing this to the guild. What systems or strategies are you using to build return loops. Not just rewards and points, but real emotional anchors. What has worked in your ops to turn one-time users into regulars.\nLet’s dig into the difference between launch success and lasting impact."
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "I think a way to solve the player retention is for games locking players into a progression loop built on three pillars: competitive token extraction, social-driven objectives, and reputation-based rewards.\nInstead of rewarding only early adopters or wallet size, we reward consistency, skill, and contribution. Whether you’re extracting loot, completing faction quests, or shaping the world narrative, your actions echo visibly.\nPlayers don’t just log in for tokens they log in to protect their name, gain social currency, and influence the outcome of their faction’s future.\nEvery match matters. Every player counts. And that’s why they stay."
            }
        ]
    }
]