[
    {
        "id": "8782fd0923ee0e40",
        "topic_id": "5539",
        "title": "[Bonus Track] MetaPay – Alith Integration",
        "url": "https://forum.ceg.vote/t/bonus-track-metapay-alith-integration/5539",
        "views": "",
        "comments": "8",
        "created_date": "Jun 12, 2025 11:53 pm",
        "latest_activity": "Jul 9, 2025 11:50 pm",
        "content": "This submission is for the Bonus Track of the HyperHack Ideathon.\nProject Overview\nTitle: MetaPay – Circulating Basic Income Using Digital Currency\nMain Submission: [HyperHack Submission] MetaPay – A Circular Basic Income Simulator on Web3\nMetaPay proposes a fully electronic, self-replenishing universal basic income (UBI) system using digital currency.\nThe model distributes ₩500,000 monthly per person for 10 months and recollects 10% of wallet balances at the end of each cycle, creating a sustainable closed-loop financial system.\nTo enhance fairness, prevent Sybil attacks, and ensure that each person receives only one UBI wallet, MetaPay integrates Alith’s decentralized identity (DID) protocol.\nAlith Integration Highlights\nMetaPay uses Alith ZK-ID technology to:\nVerify wallet uniqueness: Every UBI wallet is tied to a verified digital identity.\nPrevent abuse: Limits one MetaPay account per real individual by integrating DID logic.\nEnsure fairness: Everyone receives the same UBI payment without duplicate claims.\nThis approach guarantees that MetaPay remains a people-centered UBI system by excluding fake or mass-generated addresses.\nTechnical Architecture\nLayer Technology\nDID Verification Alith SDK (ZK-ID)\nWallet React + Web3 + MetaPay UI\nSmart Contract Solidity (ERC20 variant)\nBackend Node.js + Express\nChain Metis Sepolia Testnet\nIntegration Method:\nAlith API is called at wallet sign-up.\nZK-proof is required to complete wallet registration.\nVerified identity → Unique MetaPay wallet → Monthly UBI distribution.\nDemo & Repos\nDemo video: https://youtu.be/e4lH_uGN-ck\nGitHub: GitHub - metapay-creator/MetaPay: A Web3-based Circular Basic Income Simulator\nTestnet dApp: https://meta-nv3jploud4-metapaygyuhas-projects.vercel.app\nImpact of Integration\nNo duplicate accounts → trustable UBI system\nNo need for manual ID review → scalable deployment\nTransparent, privacy-preserving identity layer\nAlith makes MetaPay more robust, scalable, and reliable for real-world adoption.\nMetaPay is more than just a system for distributing money.\nIts fundamental purpose is the restoration of time—and through it, freedom.\nWe believe that when people are no longer bound solely by the demands of survival, they gain the power to shape their own futures.\nWhile countries like South Korea can implement MetaPay using national ID systems, the model is also adaptable to other contexts through ZK-ID (Zero-Knowledge Identity) authentication, ensuring fairness and privacy even without centralized identity infrastructures.\nThrough this hackathon, I look forward to working with technical experts to refine and prototype the system.\nWe are not simply sharing money—we are sharing the right to choose how to live.\nClosing\nMetaPay isn’t just a UBI project.\nIt’s a system designed to give time and freedom back to people through a digitally controlled, fair income cycle.\nThanks to Alith, MetaPay achieves the transparency and trust that true universal income needs.\nMain submission: [HyperHack Submission] MetaPay – A Circular Basic Income Simulator on Web3\nBonus Track submission: (this post)\nThank you for your consideration.\n– by Gyuha Yoon (윤규하) | Forum ID: metapay_gyuha",
        "comments_details": [
            {
                "author": "metapay_gyuha",
                "comment": "This submission is for the Bonus Track of the HyperHack Ideathon.\nProject Overview\nTitle: MetaPay – Circulating Basic Income Using Digital Currency\nMain Submission: [HyperHack Submission] MetaPay – A Circular Basic Income Simulator on Web3\nMetaPay proposes a fully electronic, self-replenishing universal basic income (UBI) system using digital currency.\nThe model distributes ₩500,000 monthly per person for 10 months and recollects 10% of wallet balances at the end of each cycle, creating a sustainable closed-loop financial system.\nTo enhance fairness, prevent Sybil attacks, and ensure that each person receives only one UBI wallet, MetaPay integrates Alith’s decentralized identity (DID) protocol.\nAlith Integration Highlights\nMetaPay uses Alith ZK-ID technology to:\nVerify wallet uniqueness: Every UBI wallet is tied to a verified digital identity.\nPrevent abuse: Limits one MetaPay account per real individual by integrating DID logic.\nEnsure fairness: Everyone receives the same UBI payment without duplicate claims.\nThis approach guarantees that MetaPay remains a people-centered UBI system by excluding fake or mass-generated addresses.\nTechnical Architecture\nLayer Technology\nDID Verification Alith SDK (ZK-ID)\nWallet React + Web3 + MetaPay UI\nSmart Contract Solidity (ERC20 variant)\nBackend Node.js + Express\nChain Metis Sepolia Testnet\nIntegration Method:\nAlith API is called at wallet sign-up.\nZK-proof is required to complete wallet registration.\nVerified identity → Unique MetaPay wallet → Monthly UBI distribution.\nDemo & Repos\nDemo video: https://youtu.be/e4lH_uGN-ck\nGitHub: GitHub - metapay-creator/MetaPay: A Web3-based Circular Basic Income Simulator\nTestnet dApp: https://meta-nv3jploud4-metapaygyuhas-projects.vercel.app\nImpact of Integration\nNo duplicate accounts → trustable UBI system\nNo need for manual ID review → scalable deployment\nTransparent, privacy-preserving identity layer\nAlith makes MetaPay more robust, scalable, and reliable for real-world adoption.\nMetaPay is more than just a system for distributing money.\nIts fundamental purpose is the restoration of time—and through it, freedom.\nWe believe that when people are no longer bound solely by the demands of survival, they gain the power to shape their own futures.\nWhile countries like South Korea can implement MetaPay using national ID systems, the model is also adaptable to other contexts through ZK-ID (Zero-Knowledge Identity) authentication, ensuring fairness and privacy even without centralized identity infrastructures.\nThrough this hackathon, I look forward to working with technical experts to refine and prototype the system.\nWe are not simply sharing money—we are sharing the right to choose how to live.\nClosing\nMetaPay isn’t just a UBI project.\nIt’s a system designed to give time and freedom back to people through a digitally controlled, fair income cycle.\nThanks to Alith, MetaPay achieves the transparency and trust that true universal income needs.\nMain submission: [HyperHack Submission] MetaPay – A Circular Basic Income Simulator on Web3\nBonus Track submission: (this post)\nThank you for your consideration.\n– by Gyuha Yoon (윤규하) | Forum ID: metapay_gyuha"
            },
            {
                "author": "han",
                "comment": "Alith’s ZK-ID clearly adds crucial trust and fairness to MetaPay.\nMy question is: How is user privacy preserved during ZK-ID verification? In other words, how does the system ensure uniqueness without knowing the individual’s actual identity?"
            },
            {
                "author": "metapay_gyuha",
                "comment": "[Bonus Track] MetaPay – Alith Integration\nMetaPay is more than just a system for distributing money.\nIts fundamental purpose is the restoration of time—and through it, freedom.\nWe believe that when people are no longer bound solely by the demands of survival, they gain the power to shape their own futures.\nWhile countries like South Korea can implement MetaPay using national ID systems, the model is also adaptable to other contexts through ZK-ID (Zero-Knowledge Identity) authentication, ensuring fairness and privacy even without centralized identity infrastructures.\nThrough this hackathon, I look forward to working with technical experts to refine and prototype the system.\nWe are not simply sharing money—we are sharing the right to choose how to live.\nZK-ID & Global Applicability\nZK-ID enables proof of uniqueness and eligibility without revealing personal data.\nHowever, in countries like South Korea with strong ID infrastructure, MetaPay can run securely without ZK-ID.\nKorea can issue MetaPay wallets per person, auto-block duplicates and manage lifecycle securely.\nOther nations can use eIDAS, Aadhaar, social numbers, or DID on-chain proofs.\nCirculation Model Overview\nDistribute ₩25 trillion monthly from Month 1–10\nStart recollection of 10% balance at end of Month 10\nReissue the recollected ₩25 trillion on Month 11, 00:00\nThis creates a sustainable closed loop, without new taxes.\nTransaction Structure\nEvery purchase =\n→ 50% MetaPay\n→ 50% regular money (cash, card, etc.)\nPrevents MetaPay hoarding\nKeeps usage visible without revealing identities\nEnsures fairness, fluidity, and traceability\nWhy MetaPay?\nMetaPay isn’t just a UBI project.\nIt gives people time and freedom to live with dignity and purpose.\nWith basic security provided by MetaPay, people can:\nReflect and participate in democracy\nCare for family or pursue education\nFocus on creativity, community, and climate solutions\nWe believe that time is the true currency of freedom.\nLearn More\nIntro Video:\nMetaPay – A Circulating Basic Income: Whose Time Are You Living?\nhttps://youtu.be/e4lH_uGN-ck\nYouTube Channel:\nhttps://www.youtube.com/@MetaPayProject\nCirculation Flow Diagram\nThis chart illustrates MetaPay’s closed-loop design — distributing 25T monthly, reclaiming 10% at month-end, and maintaining fiscal balance without additional taxes.\nThe chart below shows the circulation loop of MetaPay:\n₩25T distributed monthly, 10% recollected from balances, then redistributed — with no new tax burden.\nBalance stabilizes around ₩250T\nSelf-sustaining public loop\nSimple, transparent, and scalable\nThank you for your consideration.\n— by Gyuha Yoon (윤규하) | Forum ID: metapay_gyuha"
            },
            {
                "author": "metapay_gyuha",
                "comment": "MetaPay Circulation Model – Visual Summary\nThis diagram illustrates MetaPay’s automated basic income system:\n₩25T is distributed monthly for 10 months\n10% of unused balance is recollected at the end of each month\nRecollected funds are fully recycled for next month’s payment\nNo additional taxes or inflationary issuance required\nThis creates a self-sustaining, closed-loop basic income system ensuring fiscal stability and fairness.\nGreen bars = Distribution (₩25T/month)\nRed bars = Recollection (10% of unused balance)\nBlue line = Cumulative total (peaking at ₩250T, then stabilizing)\nIntro Video: “Whose Time Are You Living?”\nYouTube Channel\n— Gyuha Yoon | Forum ID: metapay_gyuha"
            },
            {
                "author": "metapay_gyuha",
                "comment": "Reply to han (Marketing Guild Insider):\nThank you for your thoughtful question.\nZK-ID (Zero-Knowledge Identity) ensures both uniqueness and privacy through cryptographic proofs that verify identity attributes without revealing the underlying personal information.\nHere’s how MetaPay leverages it:\nUniqueness is achieved by assigning each participant a cryptographic identifier derived from secure credentials (e.g., passport, government-issued ID, or biometric hash). The proof ensures one-person-one-wallet, but the original ID data is never shared or stored.\nPrivacy is maintained because the system only verifies the “truth” of the statement (e.g., “this person hasn’t claimed basic income elsewhere”) without knowing who the person is.\nFair access across jurisdictions is supported, since even in countries lacking a central ID system, ZK-ID frameworks like Alith’s enable decentralized identity verification.\nThis allows MetaPay to maintain fairness, prevent double claims, and build trust—all while preserving anonymity.\nLet me know if you’d like a technical breakdown or would be interested in trying the simulation interface when it’s ready!\n— Gyuha (metapay_gyuha)"
            },
            {
                "author": "han",
                "comment": "Thank you for the detailed and insightful explanation, Gyuha! This clarifies how ZK-ID balances privacy and uniqueness perfectly. Looking forward to exploring the simulation interface when available."
            },
            {
                "author": "metapay_gyuha",
                "comment": "Additional Perspective – For Bonus Track Review\nWhile my earlier post focused on the technical mechanism behind MetaPay’s distribution and recollection cycle, I’d like to share a few broader aspects that highlight the system’s adaptability, policy relevance, and long-term potential.\nZK-ID Stack Agnosticism\nAlthough the prototype currently uses Alith ZK-ID, MetaPay’s architecture is fully compatible with other ZK identity systems like Polygon ID, Semaphore, or Worldcoin’s ZK stack. This ensures it can be adopted across diverse regulatory or social environments without requiring architectural changes.\nOn-Chain DID Compatibility\nWe are preparing to integrate decentralized identifiers (DIDs) in future iterations, enabling persistent identity verification and reusability. This enhances Sybil resistance and allows each verified user to maintain a secure, on-chain identity anchor—without compromising privacy.\nPolicy Alignment & Government Use Case\nMetaPay has been submitted to national policy platforms in South Korea as a practical, tax-free basic income pilot. Since it operates in parallel with existing welfare systems, it remains politically feasible and socially non-disruptive—making it an attractive option for government-led trials.\nLow-Risk Simulation for Public Engagement\nThe testnet-based simulator allows anyone to experience the full-cycle UBI logic (distribute → reclaim → redistribute) with zero real-world financial risk. This encourages civic participation and enables policymakers to evaluate the system before real-world deployment.\nOpen Source & Interoperability\nAll smart contracts are modular, auditable, and open-source—designed to be forked, customized, or integrated into other UBI implementations. MetaPay is more than a demo; it’s a policy-grade architecture that invites global collaboration and innovation.\nMetaPay is not just a Web3 application—it’s a bridge between technical innovation and social equity. Thank you for the opportunity to present it through this Bonus Track."
            },
            {
                "author": "Xomi",
                "comment": "So what does alith do for this project ?"
            },
            {
                "author": "metapay_gyuha",
                "comment": "Hi\n@Xomi\n, welcome to the community!\nThank you for your first post — I’m honored that it’s on the MetaPay thread\nLet me explain what Alith does for this project — it’s actually a core pillar of how MetaPay works.\n1. ZK-ID: Privacy-Preserving Identity Verification\nAlith provides Zero-Knowledge Identity (ZK-ID) technology to ensure that:\nEach person receives only one MetaPay wallet\nWithout revealing personal identity (e.g., name, ID number, etc.)\nThis helps us prevent Sybil attacks and duplicate claims while keeping all users fully anonymous.\nIn countries with national ID systems (like Korea), wallets can be issued automatically at birth and deactivated at death.\nIn other countries, Alith ZK-ID provides a decentralized way to prove uniqueness without centralized ID databases.\nFair. Private. Scalable.\n2. Alith AI: Intelligent Monitoring & Governance\nMetaPay also integrates Alith AI, which acts as a real-time financial and governance assistant:\nA. Monitors:\nTotal payouts and recollections\nWallet activity across the network\nDemographic trends (e.g., births/deaths)\nSurplus or deficit in each payment cycle\nB. Predicts:\nThe impact of adjusting payout or collection rates\nProvides data-driven recommendations to the DAO before any proposal is voted on\nC. Detects Abuse:\nIdentifies unusual transaction patterns (e.g., wage manipulation or bypassed recollection)\nAlerts the DAO or National Tax Service for audits\nThis helps ensure that MetaPay stays fair, usable, and protected from misuse.\n3. Enforces Hybrid Payment Rule: 50% MetaPay + 50% Fiat\nWith every purchase, wallets auto-split payments:\nHalf from MetaPay\nHalf from user’s linked fiat (cash, card, etc.)\nIf this balance becomes inefficient, Alith AI suggests a new ratio (like 60:40), and the DAO can vote on adjustments.\nSummary\nAlith = The brain and immune system of MetaPay.\nIt secures identity, protects fairness, guides economic policy, and adapts in real time.\nThanks again for your thoughtful question, and once again — welcome aboard!\nIf you’d like a technical breakdown or want to try the simulation, I’d be happy to share.\n— Gyuha Yoon (metapay_gyuha)"
            }
        ]
    },
    {
        "id": "f91f6e61306ca2b9",
        "topic_id": "6112",
        "title": "How to Qualify for Guild Leadership Campaign",
        "url": "https://forum.ceg.vote/t/how-to-qualify-for-guild-leadership-campaign/6112",
        "views": "",
        "comments": "10",
        "created_date": "Jul 2, 2025 4:28 pm",
        "latest_activity": "Jul 9, 2025 7:27 pm",
        "content": "How to Qualify for Guild Leadership Campaign\nWant to lead a Guild? Here’s your step-by-step checklist.\nIf you’re ready to take on a Guild leadership role on the Hyperion Forum, that’s great.\nBefore applying, you’ll need to unlock a few key badges that prove you’re an active, knowledgeable, and supportive community member.\nBelow is a breakdown of each requirement and how to earn it.\nApplication Requirements\nTo be eligible, you must earn the following:\nMember badge (TL2)\nCampaigner badge – invite 3 users who reach TL1\nAppreciated badge – receive 1 like on 20 separate posts\nCertified badge – complete the Discourse beginner tutorial\nLicensed badge – complete the Discourse advanced tutorial\n1. Achieve Trust Level 2 – Member Badge (TL2)\nThis badge shows you’re a consistent and trusted contributor to the Forum.\nTo earn TL2, you need to:\nVisit the Forum on at least 15 different days\nRead over 100 posts\nSpend time reading and engaging with threads\nGive and receive a few likes\nOnce you meet these milestones, the Member badge will be awarded automatically.\n2. Campaigner Badge\nThis badge shows you’re helping grow the community.\nTo earn it:\nInvite 3 new users to the Forum\nEach invited user must reach TL1 (Basic level) by reading posts, engaging, and spending some time in the Forum\nYou can track your invites under your Forum profile > invites.\n3. Appreciated Badge\nThis badge demonstrates that people enjoy your contributions and find them valuable.\nTo earn it:\nReceive at least 1 like on 20 different posts you’ve written\nThe best way to get there is by posting helpful, thoughtful, or fun content that others want to engage with.\n4. Certified and Licensed Badges\nThese badges prove that you understand how to use the Forum tools, essential for anyone in a leadership or moderation role.\nCertified Badge\nGo to your Forum DMs\nLook for the welcome message from Discobot\nReply with:\n@discobot start tutorial\nFollow the guided tutorial to learn the basics\nOnce complete, you’ll receive the Certified badge\nLicensed Badge\nIn the same DM thread, reply with:\n@discobot start advanced tutorial\nFollow the advanced tutorial, which covers editing, linking, and more advanced features\nYou’ll receive the Licensed badge upon completion\nThe full process takes around 5 minutes.\nFinal Step: You’re Ready\nOnce you have all five of these:\nMember (TL2)\nCampaigner\nAppreciated\nCertified\nLicensed\n…you’re officially eligible to apply for Guild Leadership.\nIf you have any questions or run into issues, feel free to reach out in Discord or tag a community mod on the Forum.\nApply for Guilds leader campaign: ClickUp Forms\nRead more about the campaign: Guilds Campaign\nUseful links:\nLearn more about Forum badge and point system: Badge and Point System User Guide\nHow to check your referral status: Check your Referral link status\nHow to create a referral link: Step-by-step guide to create a Referral Link",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "How to Qualify for Guild Leadership Campaign\nWant to lead a Guild? Here’s your step-by-step checklist.\nIf you’re ready to take on a Guild leadership role on the Hyperion Forum, that’s great.\nBefore applying, you’ll need to unlock a few key badges that prove you’re an active, knowledgeable, and supportive community member.\nBelow is a breakdown of each requirement and how to earn it.\nApplication Requirements\nTo be eligible, you must earn the following:\nMember badge (TL2)\nCampaigner badge – invite 3 users who reach TL1\nAppreciated badge – receive 1 like on 20 separate posts\nCertified badge – complete the Discourse beginner tutorial\nLicensed badge – complete the Discourse advanced tutorial\n1. Achieve Trust Level 2 – Member Badge (TL2)\nThis badge shows you’re a consistent and trusted contributor to the Forum.\nTo earn TL2, you need to:\nVisit the Forum on at least 15 different days\nRead over 100 posts\nSpend time reading and engaging with threads\nGive and receive a few likes\nOnce you meet these milestones, the Member badge will be awarded automatically.\n2. Campaigner Badge\nThis badge shows you’re helping grow the community.\nTo earn it:\nInvite 3 new users to the Forum\nEach invited user must reach TL1 (Basic level) by reading posts, engaging, and spending some time in the Forum\nYou can track your invites under your Forum profile > invites.\n3. Appreciated Badge\nThis badge demonstrates that people enjoy your contributions and find them valuable.\nTo earn it:\nReceive at least 1 like on 20 different posts you’ve written\nThe best way to get there is by posting helpful, thoughtful, or fun content that others want to engage with.\n4. Certified and Licensed Badges\nThese badges prove that you understand how to use the Forum tools, essential for anyone in a leadership or moderation role.\nCertified Badge\nGo to your Forum DMs\nLook for the welcome message from Discobot\nReply with:\n@discobot start tutorial\nFollow the guided tutorial to learn the basics\nOnce complete, you’ll receive the Certified badge\nLicensed Badge\nIn the same DM thread, reply with:\n@discobot start advanced tutorial\nFollow the advanced tutorial, which covers editing, linking, and more advanced features\nYou’ll receive the Licensed badge upon completion\nThe full process takes around 5 minutes.\nFinal Step: You’re Ready\nOnce you have all five of these:\nMember (TL2)\nCampaigner\nAppreciated\nCertified\nLicensed\n…you’re officially eligible to apply for Guild Leadership.\nIf you have any questions or run into issues, feel free to reach out in Discord or tag a community mod on the Forum.\nApply for Guilds leader campaign: ClickUp Forms\nRead more about the campaign: Guilds Campaign\nUseful links:\nLearn more about Forum badge and point system: Badge and Point System User Guide\nHow to check your referral status: Check your Referral link status\nHow to create a referral link: Step-by-step guide to create a Referral Link"
            },
            {
                "author": "daryl",
                "comment": "To make your progress easier to track, I’ve created 2 badges that recognize your progress towards Guild Leadership:\nGuild Initiate\nCongrats to the following users who will earn this badge automatically overnight!\n@Sheyda\n@priyankg3\n@han\n@4ngel\n@irinaina\n@daryl\n@MK-Quen\n@Julie0xnana\n@Lizzy\n@ThalaZikol\n@Ameliadupontttm\n@Aryanzutshi\n@zuzuzu\n@spxctr00m\nGuild Apprentice\nCongrats to\n@priyankg3\nfor meeting the conditions to earn the Guild Apprentice badge already! (system will assign overnight)\nNotes:\nThe system checks once daily (I believe at midnight UTC) and awards all eligible users the corresponding badges.\nTo check who has the above badges, click the images or links above. Remember it may take up to 24hrs for the system to assign the badge once you meet the conditions.\nTo check which badges you have, go to the Badges Page and there will be a “Green Check” in the top right corner of all the badges you’ve earned, as per this image:"
            },
            {
                "author": "daryl",
                "comment": "Also just to note, there’s a bunch of you that are ALMOST THERE!\nThe following users need just one more to earn the Guild Initiate Badge:\n@metapay_gyuha\n@Liametis\n@nidhinakranii\n@Elenaisplaying\n@pavel\n@i_am_supaman_lj\n@Norbert\n@Andrei\n@arbilearn\n@grace\n@Ransome\n@Bells\n@kvnchtw\n@David\n@CrisMetis\n@Rosita\n@Emreahmet12\n@amardeep\nThe following users need just one more to earn the Guild Apprentice Badge:\n@4ngel\n@Aryanzutshi\n@spxctr00m\nRemember, the 5 badges required for Guild Leadership are:\nMember\nCampaigner\nAppreciated\nCertified\nLicensed\nIf you need help with any of them, reply here! (more details are also above in\n@Sheyda\n’s original post)"
            },
            {
                "author": "priyankg3",
                "comment": "daryl:\nCongrats to\n@priyankg3\nfor meeting the conditions to earn the Guild Apprentice badge already! (system will assign overnight)\nThank you Daryl, its look cool btw. Hope we will get the custom flair for Guild Initate and Guild Apprentice for this."
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "I am only confused about the the campaigner badge, i have had over 3 invites and i still have not gotten the badge. and i have had this for more than a month or so. whats the actual invite like?"
            },
            {
                "author": "daryl",
                "comment": "Sheyda:\nEach invited user must reach TL1 (Basic level) by reading posts, engaging, and spending some time in the Forum\nYou’re so close! In fact 6 users have accepted your invites so far, but 3 of them need to engage enough to earn the Basic Badge. Requirements are very minimal, most people who engage even just a little bit earn this badge the first or second day:\nEntering at least 5 topics\nReading at least 30 posts (includes replies)\nSpend a total of 10 minutes reading posts"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "It’s meant to be more, I pasted the link in one of the communities I belong.\nHow did you know I have only 6, i want to church myself."
            },
            {
                "author": "daryl",
                "comment": "Right in your profile, click on invites then redeemed\n@i_am_supaman_lj\n𝕊𝕌ℙ𝔸𝕄𝔸ℕ.𝕃𝕁\nIkorodu\nfracturepoint.netlify.app/\nWeb3 gaming critic & builder | Roasting flops, building utility-driven games | Advocate for community-first decentralized play | DM for collabs or pitches.\nJoined May 20, 2025\nIn your case, people joined via your link less than 24h ago, and the system awards most badges once every 24h. Check back tomorrow!"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "I have another issue in my dm, I was reached out to by someone from the spotlight campaign. I clicked the message and replied but got an error in delivering and the dm disappeared. I forgot the name, I would not mind if you could help me out.\nI was suppose to provide my project contract addresses, and CEG referer link."
            },
            {
                "author": "daryl",
                "comment": "@0xthiru\nPlease have a look!"
            }
        ]
    },
    {
        "id": "a588ef262157116c",
        "topic_id": "5966",
        "title": "HyperHack Spotlight Campaign is Live",
        "url": "https://forum.ceg.vote/t/hyperhack-spotlight-campaign-is-live/5966",
        "views": "",
        "comments": "23",
        "created_date": "Jun 25, 2025 2:10 pm",
        "latest_activity": "Jul 9, 2025 7:24 pm",
        "content": "Gm Metisians, the Spotlight Campaign is here to supercharge your HyperHack journey!\nWe are giving selected project teams a chance at the $7500 bonus prize pool, $500 in marketing credit, access to guild talent, and the chance to earn tiered ecosystem rewards. The goal is to boost your visibility and help you grow real users.\nApply here\nCampaign Objective\nTo empower HyperHack teams to market their projects using a real budget. This is about helping builders grow their audience, activate users, and showcase their dApps across the Metis ecosystem.\nHow It Works\n$500 marketing credit for each project, 50 projects at maximum\n$7500 extra prize pool for top projects\nEach selected project will receive $500 in marketing credit, split into:\n$300 upfront to start your campaign\n$200 unlocked later if performance goals are met by August 1\n$500 Marketing Credit\nEach project must create a dedicated X account for their HyperHack product and have at least one marketer (internal or from the Forum Marketing Guild) who will:\nLead the project’s marketing strategy\nUse the $500 to drive short-term traffic\nJoin a Vibe Session to introduce the dapp\nShare referral links via X posts to their forum showcase\nApproved Marketing Tactics:\nQuest Campaigns (TaskOn, Zealy, Magic Square): e.g. “Follow + Retweet + Test dapp + Join Forum”\nAMA Airdrops: Host AMAs on X and airdrop to the Metis community\nTwitter Ads: Use paid ads to boost visibility (marketer must help set this up)\nCustom Strategies: Teams are also encouraged to try any other creative ideas tailored to their product and audience\nNote: Marketer’s name and focus must be listed in the application (e.g., Marketing Lead: @Handle – Focus: Memes & Spaces).\nHow We Track Performance\nProjects will be scored across three categories during July 15 to August 1:\n75% X account growth and quality (verified via TwitterAudit)\n20% user activity on your dApp (measured onchain)\n5% users driven to your Forum thread using referral links\nRewards for Top Projects\nTotal Prize Pool: $7500\nTier 1: HyperHack Spotlight Champion\n$3000 bonus for the top project\nForum pin for 14 days\nPriority DevRel support for 6 months\nNewsletter spotlight\n25 bonus points for the final judging phase\nTier 2: Growth Catalysts\n$3000 prize pool\nForum pin for 7 days\nDevRel support for 3 months\nNewsletter spotlight\n15 bonus points\nTier 3: Community Stars\n$1500 prize pool\nDevRel support for 1 month\nNewsletter spotlight\n10 bonus points\nKey Dates\nApplication period: June 25-July 8\nApplication review: July 9- 15\nCampaign period: July 15- August 1\nRules\nFunds must be used for approved marketing activities only\nBot traffic is not allowed and will be checked\nYour marketing strategy must be made public in your Forum thread\nThe Spotlight Campaign is designed to help real builders grow real audiences.\nApply here\nFor questions, reply below.\nGL to all!",
        "comments_details": [
            {
                "author": "Liametis",
                "comment": "Gm Metisians, the Spotlight Campaign is here to supercharge your HyperHack journey!\nWe are giving selected project teams a chance at the $7500 bonus prize pool, $500 in marketing credit, access to guild talent, and the chance to earn tiered ecosystem rewards. The goal is to boost your visibility and help you grow real users.\nApply here\nCampaign Objective\nTo empower HyperHack teams to market their projects using a real budget. This is about helping builders grow their audience, activate users, and showcase their dApps across the Metis ecosystem.\nHow It Works\n$500 marketing credit for each project, 50 projects at maximum\n$7500 extra prize pool for top projects\nEach selected project will receive $500 in marketing credit, split into:\n$300 upfront to start your campaign\n$200 unlocked later if performance goals are met by August 1\n$500 Marketing Credit\nEach project must create a dedicated X account for their HyperHack product and have at least one marketer (internal or from the Forum Marketing Guild) who will:\nLead the project’s marketing strategy\nUse the $500 to drive short-term traffic\nJoin a Vibe Session to introduce the dapp\nShare referral links via X posts to their forum showcase\nApproved Marketing Tactics:\nQuest Campaigns (TaskOn, Zealy, Magic Square): e.g. “Follow + Retweet + Test dapp + Join Forum”\nAMA Airdrops: Host AMAs on X and airdrop to the Metis community\nTwitter Ads: Use paid ads to boost visibility (marketer must help set this up)\nCustom Strategies: Teams are also encouraged to try any other creative ideas tailored to their product and audience\nNote: Marketer’s name and focus must be listed in the application (e.g., Marketing Lead: @Handle – Focus: Memes & Spaces).\nHow We Track Performance\nProjects will be scored across three categories during July 15 to August 1:\n75% X account growth and quality (verified via TwitterAudit)\n20% user activity on your dApp (measured onchain)\n5% users driven to your Forum thread using referral links\nRewards for Top Projects\nTotal Prize Pool: $7500\nTier 1: HyperHack Spotlight Champion\n$3000 bonus for the top project\nForum pin for 14 days\nPriority DevRel support for 6 months\nNewsletter spotlight\n25 bonus points for the final judging phase\nTier 2: Growth Catalysts\n$3000 prize pool\nForum pin for 7 days\nDevRel support for 3 months\nNewsletter spotlight\n15 bonus points\nTier 3: Community Stars\n$1500 prize pool\nDevRel support for 1 month\nNewsletter spotlight\n10 bonus points\nKey Dates\nApplication period: June 25-July 8\nApplication review: July 9- 15\nCampaign period: July 15- August 1\nRules\nFunds must be used for approved marketing activities only\nBot traffic is not allowed and will be checked\nYour marketing strategy must be made public in your Forum thread\nThe Spotlight Campaign is designed to help real builders grow real audiences.\nApply here\nFor questions, reply below.\nGL to all!"
            },
            {
                "author": "4ngel",
                "comment": "This is huge !!! Good luck to every participant, let’s get it"
            },
            {
                "author": "Elenaisplaying",
                "comment": "Such a great news. Good luck everyone"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "I got a hiccup in the marketers forum ID and the Project owner forum ID. I don’t really know how to find that, any form of assistance would be greatly appreciated."
            },
            {
                "author": "Ghostt",
                "comment": "You will see that on your profile, and your own forum id is\n@i_am_supaman_lj\n. If you click the @ sign you will get it."
            },
            {
                "author": "priyankg3",
                "comment": "Thats wonderful, this is the golden chance for developers to build and polish with your project with marketing as well.."
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "Thanks a lot, I was actually hoping I would work with you. Since you are one of the first that saw the potential of Fracturepoint as a solution to the recent web3 gaming failure trends."
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "Thanks for the help, we can go on with the plan already now right ?"
            },
            {
                "author": "Sheyda",
                "comment": "Fantastic, do you have a list of Marketers?"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "List?\nI thought only one ."
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "Specified one marketer on the form Thats why I sort for one"
            },
            {
                "author": "mrwagmicto",
                "comment": "Hey everyone!\nI’m looking for a marketing partner to join me on an exciting crypto project and help drive this campaign forward.\nIf you’re passionate about Web3 marketing, community building, or growth hacking — let’s talk!\nFeel free to DM me. Would love to connect!"
            },
            {
                "author": "Ghostt",
                "comment": "I have teamed up with him and applied to the campaign. Looking forward to the result."
            },
            {
                "author": "0xdellwatson",
                "comment": "is it possible to also co-join with other campaign ?\nDM for more exposure with our team!"
            },
            {
                "author": "arbilearn",
                "comment": "This is great opportunity"
            },
            {
                "author": "Invnex",
                "comment": "Excited, and we’ve applied for Invnex."
            },
            {
                "author": "sagarjethi",
                "comment": "Such a great news. Good luck everyone"
            },
            {
                "author": "metapay_gyuha",
                "comment": "Hi! I’m one of the Spotlight Campaign applicants and already submitted my form.\nI’d like to submit my detailed marketing strategy as an additional document.\nCan I upload it to Google Drive and share the link here? Or should I send it via email?\nThanks a lot for this opportunity!\n–\n@metapay_gyuha"
            }
        ]
    },
    {
        "id": "de8d867d2ad31d4d",
        "topic_id": "6174",
        "title": "Campaigner Badgeholders!",
        "url": "https://forum.ceg.vote/t/campaigner-badgeholders/6174",
        "views": "",
        "comments": "8",
        "created_date": "Jul 7, 2025 3:48 pm",
        "latest_activity": "Jul 9, 2025 6:55 pm",
        "content": "Hi all, I just wanted to share a big thanks to all the Campaigner Badgeholders! As of July 7th, congrats to:\n@Helen\n@Fet\n@Serega\n@Masha\n@Lucy\n@Ameliadupontttm\n@ThalaZikol\n@Lizzy\n@MK-Quen\n@afixyz\n@Bjk_15\n@Julie0xnana\n@priyankg3\n@han\n@Sheyda\nAs the badge text says:\nThis badge is granted when you’ve invited 3 people who subsequently spent enough time on the site to become basic users. A vibrant community needs a regular infusion of newcomers who regularly participate and add new voices to the conversations.\nTHIS is my idea of a meaningful contribution, and just one of the MANY ways that discourse has built QUALITY into the system. It’s not just about volume of new people that you invite in, but also about their subsequent contributions.\nAs a reminder, anyone can create an invite, just click on “Invite” in the left menu, and follow the prompts:\nFor those setting their sights even higher, there’s also the Hyper badge, which is granted when 5 people you invited become full members (Trust Level 2). Congrats and many thanks to\n@han\nand\n@MK-Quen\n!\nMore info on Basic and Member badges, and trust levels is available here:\nDiscourse – 25 Jun 18\nUnderstanding Discourse Trust Levels\nThe user trust system is a fundamental cornerstone of Discourse. Trust levels are a way of…\nCheers and have an amazing day!",
        "comments_details": [
            {
                "author": "daryl",
                "comment": "Hi all, I just wanted to share a big thanks to all the Campaigner Badgeholders! As of July 7th, congrats to:\n@Helen\n@Fet\n@Serega\n@Masha\n@Lucy\n@Ameliadupontttm\n@ThalaZikol\n@Lizzy\n@MK-Quen\n@afixyz\n@Bjk_15\n@Julie0xnana\n@priyankg3\n@han\n@Sheyda\nAs the badge text says:\nThis badge is granted when you’ve invited 3 people who subsequently spent enough time on the site to become basic users. A vibrant community needs a regular infusion of newcomers who regularly participate and add new voices to the conversations.\nTHIS is my idea of a meaningful contribution, and just one of the MANY ways that discourse has built QUALITY into the system. It’s not just about volume of new people that you invite in, but also about their subsequent contributions.\nAs a reminder, anyone can create an invite, just click on “Invite” in the left menu, and follow the prompts:\nFor those setting their sights even higher, there’s also the Hyper badge, which is granted when 5 people you invited become full members (Trust Level 2). Congrats and many thanks to\n@han\nand\n@MK-Quen\n!\nMore info on Basic and Member badges, and trust levels is available here:\nDiscourse – 25 Jun 18\nUnderstanding Discourse Trust Levels\nThe user trust system is a fundamental cornerstone of Discourse. Trust levels are a way of…\nCheers and have an amazing day!"
            },
            {
                "author": "han",
                "comment": "Thank you Daryl , and congrats to all Campaigner Badgeholders! Really appreciate the support and recognition"
            },
            {
                "author": "priyankg3",
                "comment": "This is really awesome and congrats to all Campaigner Badgeholders!"
            },
            {
                "author": "4ngel",
                "comment": "Congrats to all of you guys"
            },
            {
                "author": "Norbert",
                "comment": "Impressive!! Congratulations y’all"
            },
            {
                "author": "ceeny007",
                "comment": "Congratulations guys"
            },
            {
                "author": "David",
                "comment": "Congratulations guys"
            },
            {
                "author": "ThalaZikol",
                "comment": "Congrats to all Campaigner Badgeholders!"
            },
            {
                "author": "daryl",
                "comment": "Kind reminder that badges are only awarded every 24h, so if you think you should have one, check back tomorrow!\nAlso, to check on your progress for this badge, you can go to your profile then click invites, then redeemed to see the stats of the people who have redeemed your invites. If you click through to their profiles and find 3 that have the Basic badge (Profile > Badges), you’ll be earning the Campaigner badge within 24h if you haven’t already!"
            }
        ]
    },
    {
        "id": "9e9a09f462f46ee5",
        "topic_id": "6261",
        "title": "Building Products That Endure Slumps: Consistency Over Motivation",
        "url": "https://forum.ceg.vote/t/building-products-that-endure-slumps-consistency-over-motivation/6261",
        "views": "",
        "comments": "1",
        "created_date": "Jul 9, 2025 2:14 pm",
        "latest_activity": "Jul 9, 2025 4:00 pm",
        "content": "Consistency is the key\nIn bull markets, it’s easy to feel like your product matters. There’s hype, noise, people engaging. But when things slow down, you realise if you were building for attention or for real utility.\nI’ve seen this across a few cycles now. Projects that last aren’t powered by motivation. They’re built on discipline. When energy is low, consistency is the edge. As seen in the Bear markets don’t kill builders. They expose the ones who were only tweeting🔥\nA few things that help:\n• keep showing up even when it feels pointless\n• talk to users even if it’s just one person a week\n• ship something small often\n• track your own progress not the market\n• share updates no matter the size\nHow are you staying consistent right now. Any routines or systems that help when motivation drops\nDrop them below, might help someone else building in silence too",
        "comments_details": [
            {
                "author": "Norbert",
                "comment": "Consistency is the key\nIn bull markets, it’s easy to feel like your product matters. There’s hype, noise, people engaging. But when things slow down, you realise if you were building for attention or for real utility.\nI’ve seen this across a few cycles now. Projects that last aren’t powered by motivation. They’re built on discipline. When energy is low, consistency is the edge. As seen in the Bear markets don’t kill builders. They expose the ones who were only tweeting🔥\nA few things that help:\n• keep showing up even when it feels pointless\n• talk to users even if it’s just one person a week\n• ship something small often\n• track your own progress not the market\n• share updates no matter the size\nHow are you staying consistent right now. Any routines or systems that help when motivation drops\nDrop them below, might help someone else building in silence too"
            },
            {
                "author": "Gann",
                "comment": "Consistency is so underrated\nIt’s not flashy, it doesn’t go viral, but it quietly compounds.\nWe are in that phase now"
            }
        ]
    },
    {
        "id": "0e311d1c489e6cac",
        "topic_id": "6262",
        "title": "How to join a Guild- Video Tutorial",
        "url": "https://forum.ceg.vote/t/how-to-join-a-guild-video-tutorial/6262",
        "views": "",
        "comments": "0",
        "created_date": "Jul 9, 2025 2:38 pm",
        "latest_activity": null,
        "content": "How to join a Guild\nIf you’re interested in leading a guild and shaping the direction of Hyperion’s community, this is your opportunity! As part of the Guild Leader Campaign (ends on Jul 23), you can earn points, unlock special roles, and even apply to become a Guild Leader. In this tutorial, you’ll learn how to:\nJoin a Guild: Follow the step-by-step guide to explore and join the guild that best matches your skills and interests.\nContribute to Discussions: Get involved in meaningful conversations, share your insights, and contribute to building a vibrant community.\nEarn Points: Participate actively and earn points, helping you progress toward leadership roles, including becoming a Guild Leader.\nHow to Join Hyperion Forum Guilds\nBy participating in the Guilds and becoming a leader, you’ll have the chance to build a strong community, guide discussions, and unlock exclusive rewards. Ready to make an impact? Start referring users and apply to be a Guild Leader today!\nGuild Leadership Campaign: How to Qualify for Guild Leadership Campaign\nApply for Guilds leader campaign: ClickUp Forms\nRead more about the campaign: Guilds Campaign",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "How to join a Guild\nIf you’re interested in leading a guild and shaping the direction of Hyperion’s community, this is your opportunity! As part of the Guild Leader Campaign (ends on Jul 23), you can earn points, unlock special roles, and even apply to become a Guild Leader. In this tutorial, you’ll learn how to:\nJoin a Guild: Follow the step-by-step guide to explore and join the guild that best matches your skills and interests.\nContribute to Discussions: Get involved in meaningful conversations, share your insights, and contribute to building a vibrant community.\nEarn Points: Participate actively and earn points, helping you progress toward leadership roles, including becoming a Guild Leader.\nHow to Join Hyperion Forum Guilds\nBy participating in the Guilds and becoming a leader, you’ll have the chance to build a strong community, guide discussions, and unlock exclusive rewards. Ready to make an impact? Start referring users and apply to be a Guild Leader today!\nGuild Leadership Campaign: How to Qualify for Guild Leadership Campaign\nApply for Guilds leader campaign: ClickUp Forms\nRead more about the campaign: Guilds Campaign"
            }
        ]
    },
    {
        "id": "e59948f131ec9db0",
        "topic_id": "6260",
        "title": "How AI is Changing the Way Developers Learn and Build",
        "url": "https://forum.ceg.vote/t/how-ai-is-changing-the-way-developers-learn-and-build/6260",
        "views": "",
        "comments": "0",
        "created_date": "Jul 9, 2025 1:57 pm",
        "latest_activity": null,
        "content": "As the Developer Experience Lead at Metis, a Layer 2 blockchain project focused on AI integration, I’ve witnessed firsthand how artificial intelligence is fundamentally transforming how developers approach blockchain development. We’re not just seeing incremental improvements, we’re experiencing a complete paradigm shift in how developers learn, build, and deploy applications in the Web3 space.\nAI as First-Class Infrastructure\nAt Metis, we’ve made a strategic decision to treat AI as first-class infrastructure rather than an afterthought. This means AI isn’t just a tool we use occasionally; it’s deeply integrated into every aspect of our developer experience. From our documentation system that has access to all of Metis’ data sources to Alith, our core AI agent framework, we’ve built AI into the foundation of how developers interact with our ecosystem.\nThe impact has been transformative. Just as developers have long relied on boilerplate code to accelerate project development, AI has become the new boilerplate, a foundation where developers can rapidly add features and functions to solve specific problems. This shift has fundamentally changed the development workflow from lengthy setup processes to rapid iteration and deployment.\nThe Alith Framework: Redefining AI Agent Development\nOur flagship contribution to this transformation is Alith, Metis’ main AI agent framework. Alith represents what we believe is the future of blockchain-AI integration, offering several key capabilities:\nLazAI Gateway provides comprehensive wallet management, transaction handling, and access to core privacy features like iDAO, DAT, and verified computing. This eliminates the complexity traditionally associated with blockchain wallet integration.\nMultiple Model Support ensures developers aren’t locked into a single AI provider. We support both small models and large language models from providers like Llama, Grok, OpenAI, and Anthropic, giving developers flexibility in choosing the right tool for their specific use case.\nHigh Extensibility allows developers to customize everything from internal prompts to low-level API access. They can define roles, goals, tools, actions, and behaviors while maintaining clean abstraction layers.\nWorkflow Support enables complex orchestration patterns beyond simple sequential processes. Developers can implement hierarchical processes, conditional branching, and parallel execution—crucial for sophisticated AI applications.\nCross-Language Support with SDKs for Rust, Python, and Node.js makes Alith accessible to developers regardless of their preferred programming language.\nHigh-Performance AI Training and Inference leverages Rust’s performance advantages along with graph optimization, model compression, and JIT/AOT compilation with GPU coprocessors.\nWeb3 Friendly and Secure architecture provides out-of-the-box Web3 plugins that allow developers to securely integrate blockchain capabilities into TEE-based AI agent frameworks.\nVerifiable AI: The Missing Piece in Decentralized Development\nOne of the most critical innovations we’re pioneering is verifiable AI. This concept addresses a fundamental problem in decentralized applications: when we give access to centralized AI providers to manage our actions, those providers can introduce actions that might appear to be AI outputs but are actually provider-introduced manipulations.\nVerifiable AI is the cornerstone of operations in the decentralized space. We achieve this through two primary mechanisms:\nOn-chain Inferencing Records that create an immutable trail of AI decision-making processes\nTrusted Execution Environments (TEEs) that ensure AI runs in secure, isolated environments\nFuture Zero-Knowledge Proofs that will provide cryptographic verification of AI operations\nWhen considering the trade-offs between speed, cost, and complexity, the minimal additional cost of verifiable AI becomes insignificant compared to the security and risk implications of using unverifiable AI in financial and governance applications.\nReal-World Applications: From Hackathons to Production\nThe practical applications emerging from our developer community demonstrate the power of this AI-first approach. In our current hackathon, we’re seeing innovative projects that showcase the potential of verifiable AI in blockchain applications:\nRugRadar: AI-based risk assessment for Web3 projects, providing due diligence and risk scoring\nPortfolioAI: Making DeFi portfolio management more engaging through intelligent automation\nEagleDAC: AI-powered DAC generator and real-time smart contract auditor for building decentralized autonomous companies\nHyperChain Insights: AI-powered real-time transaction analytics for blockchain monitoring\nSentinel: AI tools for analyzing smart contracts and identifying vulnerabilities\nAlithGuard: Real-time AI-powered transaction and dApp sentinel for protecting users from scams and malicious contracts\nThese projects demonstrate that developers are thinking beyond simple automation to create sophisticated security, analytics, and governance tools that leverage AI’s capabilities while maintaining blockchain’s decentralization principles.\nThe Developer Experience Transformation\nFrom my perspective leading developer experience, the most significant change is how AI has accelerated the learning curve for new blockchain developers. Our AI-integrated documentation system allows developers with limited knowledge of the Metis ecosystem to quickly understand available projects and how our blockchain differentiates from others.\nThe common workflow patterns we see include:\nSocial bots for Slack, Telegram, and Twitter that work with Retrieval-Augmented Generation (RAG)\nOn-chain interaction bots that can execute complex blockchain operations\nReal-time analytics systems that process and interpret blockchain data\nSecurity monitoring tools that identify and prevent malicious activities\nChallenges and Education\nThe biggest challenge we face isn’t technical, it’s educational. Most developers have adapted to using AI in their work, from writing proposals to actual code development. However, the concept of verifiable AI requires a fundamental shift in how developers architect their applications.\nThe main pain point we address through our weekly workshops is simply “how to build using Alith.” We’re continuously developing more examples and educational materials to outline proper usage patterns. The key is helping developers understand not just the technical implementation, but the broader purpose of building applications with verifiable AI.\nThe Competitive Landscape\nAs the only Layer 2 blockchain taking this approach of full AI integration at the blockchain level, we’re pioneering a new category of Web3 infrastructure. While other projects are experimenting with AI tools, we’re building a comprehensive suite of tools that make blockchain-AI integration fundamentally easier.\nOur approach differs from traditional AI integrations in several ways:\nAI is built into the protocol level, not just application level\nVerifiability is a core requirement, not an afterthought\nCross-language support ensures broad developer adoption\nTEE-based security provides enterprise-grade protection\nLooking Forward: Sustainability and Refinement\nWithin the next 6-12 months, I expect to see significant refinement of the use cases we’re currently exploring. The challenge isn’t finding applications for blockchain AI, we’re already seeing numerous compelling use cases. The challenge is ensuring these applications are sustainable, secure, and truly valuable to users.\nWe’re focusing on three key areas:\nDeveloper Education: Making verifiable AI concepts accessible to mainstream blockchain developers\nTooling Refinement: Improving the developer experience for building AI-integrated applications\nCommunity Building: Attracting more developers to explore the possibilities of verifiable AI\nThe Skills Evolution\nThe skill requirements for blockchain developers are rapidly evolving. Traditional blockchain development skills remain important, but developers now need to understand:\nAI model integration and management\nVerifiable computing concepts\nTEE-based security architecture\nCross-chain AI orchestration\nPrivacy-preserving AI techniques\nConclusion\nThe transformation I’ve witnessed at Metis represents more than just technological advancement—it’s a fundamental shift in how we approach decentralized application development. AI isn’t replacing developers; it’s amplifying their capabilities and enabling them to solve problems that were previously intractable.\nAs we continue to refine our tools and expand our developer community, I’m convinced that the future of blockchain development will be defined by those who can effectively combine AI’s capabilities with blockchain’s decentralization principles. The projects emerging from our hackathon and developer community demonstrate that this future is already here, and it’s more exciting than we ever imagined.\nThe key to success in this new paradigm is understanding that AI and blockchain aren’t competing technologies, they’re complementary forces that, when properly integrated, can create applications that are both intelligent and truly decentralized. At Metis, we’re committed to leading this transformation and providing developers with the tools they need to build the next generation of Web3 applications.",
        "comments_details": [
            {
                "author": "pavel",
                "comment": "As the Developer Experience Lead at Metis, a Layer 2 blockchain project focused on AI integration, I’ve witnessed firsthand how artificial intelligence is fundamentally transforming how developers approach blockchain development. We’re not just seeing incremental improvements, we’re experiencing a complete paradigm shift in how developers learn, build, and deploy applications in the Web3 space.\nAI as First-Class Infrastructure\nAt Metis, we’ve made a strategic decision to treat AI as first-class infrastructure rather than an afterthought. This means AI isn’t just a tool we use occasionally; it’s deeply integrated into every aspect of our developer experience. From our documentation system that has access to all of Metis’ data sources to Alith, our core AI agent framework, we’ve built AI into the foundation of how developers interact with our ecosystem.\nThe impact has been transformative. Just as developers have long relied on boilerplate code to accelerate project development, AI has become the new boilerplate, a foundation where developers can rapidly add features and functions to solve specific problems. This shift has fundamentally changed the development workflow from lengthy setup processes to rapid iteration and deployment.\nThe Alith Framework: Redefining AI Agent Development\nOur flagship contribution to this transformation is Alith, Metis’ main AI agent framework. Alith represents what we believe is the future of blockchain-AI integration, offering several key capabilities:\nLazAI Gateway provides comprehensive wallet management, transaction handling, and access to core privacy features like iDAO, DAT, and verified computing. This eliminates the complexity traditionally associated with blockchain wallet integration.\nMultiple Model Support ensures developers aren’t locked into a single AI provider. We support both small models and large language models from providers like Llama, Grok, OpenAI, and Anthropic, giving developers flexibility in choosing the right tool for their specific use case.\nHigh Extensibility allows developers to customize everything from internal prompts to low-level API access. They can define roles, goals, tools, actions, and behaviors while maintaining clean abstraction layers.\nWorkflow Support enables complex orchestration patterns beyond simple sequential processes. Developers can implement hierarchical processes, conditional branching, and parallel execution—crucial for sophisticated AI applications.\nCross-Language Support with SDKs for Rust, Python, and Node.js makes Alith accessible to developers regardless of their preferred programming language.\nHigh-Performance AI Training and Inference leverages Rust’s performance advantages along with graph optimization, model compression, and JIT/AOT compilation with GPU coprocessors.\nWeb3 Friendly and Secure architecture provides out-of-the-box Web3 plugins that allow developers to securely integrate blockchain capabilities into TEE-based AI agent frameworks.\nVerifiable AI: The Missing Piece in Decentralized Development\nOne of the most critical innovations we’re pioneering is verifiable AI. This concept addresses a fundamental problem in decentralized applications: when we give access to centralized AI providers to manage our actions, those providers can introduce actions that might appear to be AI outputs but are actually provider-introduced manipulations.\nVerifiable AI is the cornerstone of operations in the decentralized space. We achieve this through two primary mechanisms:\nOn-chain Inferencing Records that create an immutable trail of AI decision-making processes\nTrusted Execution Environments (TEEs) that ensure AI runs in secure, isolated environments\nFuture Zero-Knowledge Proofs that will provide cryptographic verification of AI operations\nWhen considering the trade-offs between speed, cost, and complexity, the minimal additional cost of verifiable AI becomes insignificant compared to the security and risk implications of using unverifiable AI in financial and governance applications.\nReal-World Applications: From Hackathons to Production\nThe practical applications emerging from our developer community demonstrate the power of this AI-first approach. In our current hackathon, we’re seeing innovative projects that showcase the potential of verifiable AI in blockchain applications:\nRugRadar: AI-based risk assessment for Web3 projects, providing due diligence and risk scoring\nPortfolioAI: Making DeFi portfolio management more engaging through intelligent automation\nEagleDAC: AI-powered DAC generator and real-time smart contract auditor for building decentralized autonomous companies\nHyperChain Insights: AI-powered real-time transaction analytics for blockchain monitoring\nSentinel: AI tools for analyzing smart contracts and identifying vulnerabilities\nAlithGuard: Real-time AI-powered transaction and dApp sentinel for protecting users from scams and malicious contracts\nThese projects demonstrate that developers are thinking beyond simple automation to create sophisticated security, analytics, and governance tools that leverage AI’s capabilities while maintaining blockchain’s decentralization principles.\nThe Developer Experience Transformation\nFrom my perspective leading developer experience, the most significant change is how AI has accelerated the learning curve for new blockchain developers. Our AI-integrated documentation system allows developers with limited knowledge of the Metis ecosystem to quickly understand available projects and how our blockchain differentiates from others.\nThe common workflow patterns we see include:\nSocial bots for Slack, Telegram, and Twitter that work with Retrieval-Augmented Generation (RAG)\nOn-chain interaction bots that can execute complex blockchain operations\nReal-time analytics systems that process and interpret blockchain data\nSecurity monitoring tools that identify and prevent malicious activities\nChallenges and Education\nThe biggest challenge we face isn’t technical, it’s educational. Most developers have adapted to using AI in their work, from writing proposals to actual code development. However, the concept of verifiable AI requires a fundamental shift in how developers architect their applications.\nThe main pain point we address through our weekly workshops is simply “how to build using Alith.” We’re continuously developing more examples and educational materials to outline proper usage patterns. The key is helping developers understand not just the technical implementation, but the broader purpose of building applications with verifiable AI.\nThe Competitive Landscape\nAs the only Layer 2 blockchain taking this approach of full AI integration at the blockchain level, we’re pioneering a new category of Web3 infrastructure. While other projects are experimenting with AI tools, we’re building a comprehensive suite of tools that make blockchain-AI integration fundamentally easier.\nOur approach differs from traditional AI integrations in several ways:\nAI is built into the protocol level, not just application level\nVerifiability is a core requirement, not an afterthought\nCross-language support ensures broad developer adoption\nTEE-based security provides enterprise-grade protection\nLooking Forward: Sustainability and Refinement\nWithin the next 6-12 months, I expect to see significant refinement of the use cases we’re currently exploring. The challenge isn’t finding applications for blockchain AI, we’re already seeing numerous compelling use cases. The challenge is ensuring these applications are sustainable, secure, and truly valuable to users.\nWe’re focusing on three key areas:\nDeveloper Education: Making verifiable AI concepts accessible to mainstream blockchain developers\nTooling Refinement: Improving the developer experience for building AI-integrated applications\nCommunity Building: Attracting more developers to explore the possibilities of verifiable AI\nThe Skills Evolution\nThe skill requirements for blockchain developers are rapidly evolving. Traditional blockchain development skills remain important, but developers now need to understand:\nAI model integration and management\nVerifiable computing concepts\nTEE-based security architecture\nCross-chain AI orchestration\nPrivacy-preserving AI techniques\nConclusion\nThe transformation I’ve witnessed at Metis represents more than just technological advancement—it’s a fundamental shift in how we approach decentralized application development. AI isn’t replacing developers; it’s amplifying their capabilities and enabling them to solve problems that were previously intractable.\nAs we continue to refine our tools and expand our developer community, I’m convinced that the future of blockchain development will be defined by those who can effectively combine AI’s capabilities with blockchain’s decentralization principles. The projects emerging from our hackathon and developer community demonstrate that this future is already here, and it’s more exciting than we ever imagined.\nThe key to success in this new paradigm is understanding that AI and blockchain aren’t competing technologies, they’re complementary forces that, when properly integrated, can create applications that are both intelligent and truly decentralized. At Metis, we’re committed to leading this transformation and providing developers with the tools they need to build the next generation of Web3 applications."
            }
        ]
    },
    {
        "id": "3ab319c51e7faba0",
        "topic_id": "6259",
        "title": "How to create a referral link- Tutorial video",
        "url": "https://forum.ceg.vote/t/how-to-create-a-referral-link-tutorial-video/6259",
        "views": "",
        "comments": "0",
        "created_date": "Jul 9, 2025 1:46 pm",
        "latest_activity": null,
        "content": "Want to grow the Hyperion community and earn rewards?\nIn this tutorial, we show you how to create your personal referral link and invite new users to the Forum, earning 10 points per successful referral.\nWhere to find your referral dashboard\nHow to track your invites\nTips for sharing your link with your network\nHow to Create a Referral Link & Invite Friends to Hyperion Forum",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "Want to grow the Hyperion community and earn rewards?\nIn this tutorial, we show you how to create your personal referral link and invite new users to the Forum, earning 10 points per successful referral.\nWhere to find your referral dashboard\nHow to track your invites\nTips for sharing your link with your network\nHow to Create a Referral Link & Invite Friends to Hyperion Forum"
            }
        ]
    },
    {
        "id": "c46458d353c34e8d",
        "topic_id": "4047",
        "title": "Invite Reward System: Quality Matters",
        "url": "https://forum.ceg.vote/t/invite-reward-system-quality-matters/4047",
        "views": "",
        "comments": "23",
        "created_date": "May 14, 2025 7:36 pm",
        "latest_activity": "Jul 9, 2025 1:45 pm",
        "content": "We’re launching an invite system to grow our community with valuable contributors.\nHow It Works:\nEach member can generate unique invite links through your profile settings\nUse the “Create Invite Link” here or in the navigation bar at the left\nShare your link with people who will add value to our discussions\nWe track who joins through your invites\nRewards & Consequences\nMembers who bring in active, positive contributors will receive rewards\nQuality matters more than quantity\nInviting users who contribute thoughtfully earns you recognition\nInviting users who never participate or post low-quality content counts against you\nDeliberately inviting bots or spam accounts may result in account suspension\nWhat We Value\nContributors who engage meaningfully in discussions\nMembers who share knowledge and respectful perspectives\nPeople who follow our community guidelines\nIf your invitees don’t engage or post low-quality content, this reflects poorly on you. Bringing in 100 users who never post or get removed will harm your standing rather than help it.\nQuestions? Reply directly to this post!",
        "comments_details": [
            {
                "author": "daryl",
                "comment": "We’re launching an invite system to grow our community with valuable contributors.\nHow It Works:\nEach member can generate unique invite links through your profile settings\nUse the “Create Invite Link” here or in the navigation bar at the left\nShare your link with people who will add value to our discussions\nWe track who joins through your invites\nRewards & Consequences\nMembers who bring in active, positive contributors will receive rewards\nQuality matters more than quantity\nInviting users who contribute thoughtfully earns you recognition\nInviting users who never participate or post low-quality content counts against you\nDeliberately inviting bots or spam accounts may result in account suspension\nWhat We Value\nContributors who engage meaningfully in discussions\nMembers who share knowledge and respectful perspectives\nPeople who follow our community guidelines\nIf your invitees don’t engage or post low-quality content, this reflects poorly on you. Bringing in 100 users who never post or get removed will harm your standing rather than help it.\nQuestions? Reply directly to this post!"
            },
            {
                "author": "daryl",
                "comment": "My question is this:\nWho can earn the HYPER badge first?"
            },
            {
                "author": "djpablo47",
                "comment": "Great initiative! I’ll make sure to invite thoughtful, high-quality contributors who align with the community’s values."
            },
            {
                "author": "djpablo47",
                "comment": "How I can invite friends? I can’t find the invitation link."
            },
            {
                "author": "daryl",
                "comment": "Top left menu, click “invite” and create a link."
            },
            {
                "author": "djpablo47",
                "comment": "I don’t have this option:"
            },
            {
                "author": "daryl",
                "comment": "Good find! The security settings were just a bit too high. For security purposes, users need a minimum level of activity before they can create invites, specifically Trust Level 1.\n@djpablo47\ncoincidentally you just achieved trust level 1, so if you don’t see the invite button please refresh and it should be there."
            },
            {
                "author": "djpablo47",
                "comment": "Ok! I see it right now! thanks so much for your help."
            },
            {
                "author": "4ngel",
                "comment": "Invite Reward System: Quality Matters\nStarter Kit\nWe’re launching an invite system to grow our community with valuable contributors. How It Works: Each member can generate unique invite links through your profile settings Use the “Create Invite Link” here or in the navigation bar at the left Share your link with people who will add value to our discussions We track who joins through your invites Rewards & Consequences Members who bring in active, positive contributors will receive rewards Quality matters more than quantity Inviting users wh…\nMight be a good idea to bring Kols to this compaign and push the community to participate, they can only win ! And it’s for a long term"
            },
            {
                "author": "Bjk_15",
                "comment": "It is great that you have started such an invitation system that prioritizes the quality of the community. It is the responsibility of all of us to invite members who comply with your community rules, participate in constructive discussions and share information. I am sure we will act with this awareness. Congratulations on this innovative invitation system!"
            },
            {
                "author": "priyankg3",
                "comment": "Great, thanks ., I see the invites, will start to add the friends here"
            },
            {
                "author": "priyankg3",
                "comment": "daryl:\nInviting users who never participate or post low-quality content counts against you\nDeliberately inviting bots or spam accounts may result in account suspension\nthanks to point out these two points, dont you think that for invite = 10 points is much, as might be farmers can take advantage to focusing on only inviting the random/fake members..\ni am not saying currently someone doing but these can be happen too in future,"
            },
            {
                "author": "Keir",
                "comment": "I showed up, contributed meaningfully, completed tasks, and supported throughout the Metis Voyager campaign (W3DV). But in the end, no recognition, no reward. Feels like real community effort wasn’t valued — just hype. If Metis wants to build a sustainable ecosystem, rewarding community contribution should be the foundation.\nWith Hyperion will happens the same?"
            },
            {
                "author": "Norbert",
                "comment": "Hi Keir, thank you for voicing, this your feedback is valid.\nMetis has consistently run over 20+ major incentivized campaigns since 2021, each designed to reward meaningful participation. However, we acknowledge there were issues during the W3DV-led Voyager campaign, especially with the data their team submitted. Our internal audit flagged inconsistencies, which impacted rewards distribution.\nThat said, Hyperion hackathon is another chapter which is fully coordinated by the Metis core team, with a transparent points system, badges, and clear community contribution metrics. Your efforts here won’t go unnoticed.\nFeel free to explore and join in:\nHow to Get Started on Metis Hyperion Layer 2: A Step-by-Step Guide"
            },
            {
                "author": "djpablo47",
                "comment": "Thanks for the contribution, a tutorial is great to get us started with the testnet."
            },
            {
                "author": "djpablo47",
                "comment": "Keir:\nI showed up, contributed meaningfully, completed tasks, and supported throughout the Metis Voyager campaign (W3DV). But in the end, no recognition, no reward. Feels like real community effort wasn’t valued — just hype. If Metis wants to build a sustainable ecosystem, rewarding community contribution should be the foundation.\nWith Hyperion will happens the same?\nThe same thing happened to me, I’m equally disappointed with this, what score did you have in BITS and recognition in $BRO?"
            },
            {
                "author": "Keir",
                "comment": "lıke 60k have bitsss"
            },
            {
                "author": "djpablo47",
                "comment": "I had 140k BITS. I don’t understand it…"
            },
            {
                "author": "daryl",
                "comment": "These are default numbers created by discourse.org, the underlying open source software for the forum. This points structure has been refined over the course of literally decades of thousands of forums using this software. I trust that they got this right.\nAt the same time, you’re absolutely right that when it’s incentivized farmers may be tempted to invite random fake members. There are 2 important points here:\nALL of us need to be flagging low quality, spammy content. This will support the moderation team to remove fake users and sybils, so that only genuine quality users and content is rewarded. Just click the 3 dots below a spammy post and then the flag.\nWe’ll be periodically purging the site of signups of users that haven’t engaged. If we find that a particular account invited many sybils, we’ll take corrective action.\nLike I said in the original post:\nInviting users who never participate or post low-quality content counts against you\nDeliberately inviting bots or spam accounts may result in account suspension"
            },
            {
                "author": "priyankg3",
                "comment": "Thanks for the reply\n@daryl\n, Surely I will mark as a flag if i see some spammy content and one thing i have to ask, Can a topic creator delete the other comment under their topic or we have to mark as flag only ?"
            }
        ]
    },
    {
        "id": "35ac9446bd26c8ff",
        "topic_id": "6257",
        "title": "HyperHack Weekly Vibe Sessions - 8",
        "url": "https://forum.ceg.vote/t/hyperhack-weekly-vibe-sessions-8/6257",
        "views": "",
        "comments": "0",
        "created_date": "Jul 9, 2025 1:44 pm",
        "latest_activity": null,
        "content": "JUL\n29\nHyperHack Weekly Vibe Sessions - 8\nPublic\n·\nCreated by\nNidhinakranii\nTue, Jul 29 4:00 PM → 5:00 PM (Abidjan)\n0 going\nUpcoming event…\nStay tuned…",
        "comments_details": [
            {
                "author": "nidhinakranii",
                "comment": "JUL\n29\nHyperHack Weekly Vibe Sessions - 8\nPublic\n·\nCreated by\nNidhinakranii\nTue, Jul 29 4:00 PM → 5:00 PM (Abidjan)\n0 going\nUpcoming event…\nStay tuned…"
            }
        ]
    },
    {
        "id": "f5ce1f5023921ccf",
        "topic_id": "4646",
        "title": "Top Tools & Libraries to Kickstart Your Hyperion Build",
        "url": "https://forum.ceg.vote/t/top-tools-libraries-to-kickstart-your-hyperion-build/4646",
        "views": "",
        "comments": "5",
        "created_date": "May 23, 2025 6:19 am",
        "latest_activity": "Jul 9, 2025 1:11 pm",
        "content": "Building on Hyperion? Equip yourself with the right tools to save time and build better!\nHere’s a curated list of popular tools that can supercharge your hackathon project:\nDev Tools\nHardhat / Foundry – For smart contract development and testing\nOpenZeppelin Contracts – Secure, reusable smart contract libraries\nMetis SDKs & Docs – Start here: Overview | Metis Docs\nInfrastructure & APIs\nIPFS / Pinata – Store and retrieve metadata or NFTs off-chain\nAlchemy / Chainstack / QuickNode – RPC providers with Metis support\nThe Graph – Index and query blockchain data with ease\nUI & Frontend\nRainbowKit + wagmi – Simplified wallet connections\nEthers.js / Viem – Interact with smart contracts in the frontend\nTailwindCSS – Rapid and beautiful UI styling\nDon’t hesitate to explore and share what’s working for you.\nWhich tools are you using for your Hyperion hack? Drop them below!",
        "comments_details": [
            {
                "author": "arbilearn",
                "comment": "Building on Hyperion? Equip yourself with the right tools to save time and build better!\nHere’s a curated list of popular tools that can supercharge your hackathon project:\nDev Tools\nHardhat / Foundry – For smart contract development and testing\nOpenZeppelin Contracts – Secure, reusable smart contract libraries\nMetis SDKs & Docs – Start here: Overview | Metis Docs\nInfrastructure & APIs\nIPFS / Pinata – Store and retrieve metadata or NFTs off-chain\nAlchemy / Chainstack / QuickNode – RPC providers with Metis support\nThe Graph – Index and query blockchain data with ease\nUI & Frontend\nRainbowKit + wagmi – Simplified wallet connections\nEthers.js / Viem – Interact with smart contracts in the frontend\nTailwindCSS – Rapid and beautiful UI styling\nDon’t hesitate to explore and share what’s working for you.\nWhich tools are you using for your Hyperion hack? Drop them below!"
            },
            {
                "author": "arbilearn",
                "comment": "This is so true, we’ll to the moon!"
            },
            {
                "author": "David",
                "comment": "This is a good one\n@arbilearn\n\nThanks for sharing.\nAre you building any project for HyperHack?"
            },
            {
                "author": "arbilearn",
                "comment": "Yeah, we’re building Festify, you can check the proposal in the idea section"
            },
            {
                "author": "Fiko10",
                "comment": "Hi new day bro everbady happy"
            },
            {
                "author": "_crushrrr",
                "comment": "(post deleted by author)"
            }
        ]
    },
    {
        "id": "3a2fc09525f15758",
        "topic_id": "5545",
        "title": "Defuison - AI-Native and Core-Aligned Projects",
        "url": "https://forum.ceg.vote/t/defuison-ai-native-and-core-aligned-projects/5545",
        "views": "",
        "comments": "11",
        "created_date": "Jun 13, 2025 4:28 am",
        "latest_activity": "Jul 9, 2025 11:58 am",
        "content": "#Project Title: Defusion\nProblem Statement\nAs AI technology rapidly evolves, creators still struggle to find accessible platforms that allow them to turn creativity into real, blockchain-based digital assets. Many platforms offering AI art generation lack ownership validation, fine-tuning capabilities, or Web3-integrated rewards. This creates friction for users who want to generate, own, and monetize AI-powered content seamlessly within the Web3 ecosystem.\nSolution Overview\nDefusion bridges the gap between AI generation and Web3 utility by empowering users to create, mint, and own AI-generated content across multiple chains. With innovative tools like Text-to-Image, Image-to-Video, and LoRA (Low-Rank Adaptation) model training, Defusion makes advanced AI tools accessible for all. On-chain check-ins reward users with credits that fuel their creative sessions, making every interaction purposeful and rewarding. By combining cutting-edge AIGC technology with Web3 ownership and gamified experiences, Defusion is building a true creative economy on-chain.\nProject Description\nDefusion is a Web3-native AIGC platform where creators generate stunning content and mint it as NFTs across 13 supported blockchains. With over 3.6 million images generated and more than 1.1 million transactions, Defusion is redefining how creativity and ownership intersect in the NFT world.\nCore Features:\n• Text-to-Image: Transform written prompts into hyper-realistic artworks using AI\n• Image-to-Video: Animate still images into captivating short videos\n• NFT Minting: Instantly mint creations across 13+ supported chains\n• On-Chain Check-In: Daily check-ins reward users with credits for generation tasks\n• Credits System: Earn credits on-chain, then spend them on image or video generation\n• LoRA Training: Fine-tune Stable Diffusion models using Low-Rank Adaptation to train styles, characters, or themes. Users can export and share their trained LoRA models\n• Achievement Badges: Earn unique, non-transferable badges tied to creative milestones\n• Airdrops & Rewards: Unlock seasonal rewards through active participation\n• Community Hub: Showcase creations, learn from peers, and join themed events\nPowered by Dego Finance, Defusion stands out as a true AIGC + Web3 ecosystem. Users interact via a smooth Telegram bot and web interface that supports both beginners and pro creators. Whether you’re a meme artist, anime creator, or generative art collector, Defusion turns your passion into digital rewards—with ownership and creativity at the core.\nCommunity Engagement Features\nDefusion is built for community-powered creativity, gamifying the entire creation process with incentives and shareable achievements.\nTestable Features/Tasks:\n• Generate an AI image using text prompt\n• Convert an image to video animation\n• Mint your artwork on-chain\n• Train and publish a custom LoRA model\n• Complete daily on-chain check-in to earn credits\n• Use credits to generate new assets\n• Share creations on Twitter with event hashtags\n• Refer a new user who mints an NFT\n• Claim and showcase achievement badges\nPoints & Credits System:\n• On-chain check-in = daily credits\n• Generating images, minting, and using LoRA models = earn points\n• Credits can be spent on Text-to-Image, Image-to-Video, or upcoming AIGC tools\n• Points unlock leaderboard rankings, event prizes, and exclusive model access\nGamification Approach:\n• Every task and interaction is rewarding—either with credits, badges, or visibility\n• LoRA training adds creative depth and technical progression for power users\n• Campaigns like seasonal meme contests, AI art duels, or theme weeks keep the platform dynamic\nUser Onboarding Strategy:\n• No technical background needed—start with Telegram or web interface\n• First-timers earn credits by simply checking in\n• Advanced users can train their own models and monetize creative outputs\n• Community and social features keep users engaged long after their first generation",
        "comments_details": [
            {
                "author": "Defusion",
                "comment": "#Project Title: Defusion\nProblem Statement\nAs AI technology rapidly evolves, creators still struggle to find accessible platforms that allow them to turn creativity into real, blockchain-based digital assets. Many platforms offering AI art generation lack ownership validation, fine-tuning capabilities, or Web3-integrated rewards. This creates friction for users who want to generate, own, and monetize AI-powered content seamlessly within the Web3 ecosystem.\nSolution Overview\nDefusion bridges the gap between AI generation and Web3 utility by empowering users to create, mint, and own AI-generated content across multiple chains. With innovative tools like Text-to-Image, Image-to-Video, and LoRA (Low-Rank Adaptation) model training, Defusion makes advanced AI tools accessible for all. On-chain check-ins reward users with credits that fuel their creative sessions, making every interaction purposeful and rewarding. By combining cutting-edge AIGC technology with Web3 ownership and gamified experiences, Defusion is building a true creative economy on-chain.\nProject Description\nDefusion is a Web3-native AIGC platform where creators generate stunning content and mint it as NFTs across 13 supported blockchains. With over 3.6 million images generated and more than 1.1 million transactions, Defusion is redefining how creativity and ownership intersect in the NFT world.\nCore Features:\n• Text-to-Image: Transform written prompts into hyper-realistic artworks using AI\n• Image-to-Video: Animate still images into captivating short videos\n• NFT Minting: Instantly mint creations across 13+ supported chains\n• On-Chain Check-In: Daily check-ins reward users with credits for generation tasks\n• Credits System: Earn credits on-chain, then spend them on image or video generation\n• LoRA Training: Fine-tune Stable Diffusion models using Low-Rank Adaptation to train styles, characters, or themes. Users can export and share their trained LoRA models\n• Achievement Badges: Earn unique, non-transferable badges tied to creative milestones\n• Airdrops & Rewards: Unlock seasonal rewards through active participation\n• Community Hub: Showcase creations, learn from peers, and join themed events\nPowered by Dego Finance, Defusion stands out as a true AIGC + Web3 ecosystem. Users interact via a smooth Telegram bot and web interface that supports both beginners and pro creators. Whether you’re a meme artist, anime creator, or generative art collector, Defusion turns your passion into digital rewards—with ownership and creativity at the core.\nCommunity Engagement Features\nDefusion is built for community-powered creativity, gamifying the entire creation process with incentives and shareable achievements.\nTestable Features/Tasks:\n• Generate an AI image using text prompt\n• Convert an image to video animation\n• Mint your artwork on-chain\n• Train and publish a custom LoRA model\n• Complete daily on-chain check-in to earn credits\n• Use credits to generate new assets\n• Share creations on Twitter with event hashtags\n• Refer a new user who mints an NFT\n• Claim and showcase achievement badges\nPoints & Credits System:\n• On-chain check-in = daily credits\n• Generating images, minting, and using LoRA models = earn points\n• Credits can be spent on Text-to-Image, Image-to-Video, or upcoming AIGC tools\n• Points unlock leaderboard rankings, event prizes, and exclusive model access\nGamification Approach:\n• Every task and interaction is rewarding—either with credits, badges, or visibility\n• LoRA training adds creative depth and technical progression for power users\n• Campaigns like seasonal meme contests, AI art duels, or theme weeks keep the platform dynamic\nUser Onboarding Strategy:\n• No technical background needed—start with Telegram or web interface\n• First-timers earn credits by simply checking in\n• Advanced users can train their own models and monetize creative outputs\n• Community and social features keep users engaged long after their first generation"
            },
            {
                "author": "CrisMetis",
                "comment": "Nice one so, if I understand correctly with Defusion for example, could someone literally train a custom anime style using LoRA and then mint scenes from it as NFTs across different chains seamlessly ?"
            },
            {
                "author": "zuzuzu",
                "comment": "nice spirit to have, would love to hear the answer about this :\nWhat makes Defusion different from other AI art platforms like Midjourney, DALL·E, or Runway, especially in terms of on-chain integration and user incentives?\nHow does Defusion manage the compute cost of AI generation (e.g., Text-to-Image or Image-to-Video) at scale—especially with a free or credit-based model?"
            },
            {
                "author": "han",
                "comment": "What should I pay attention to when training my first LoRA model on Defusion? Can I share my trained model with other users, and will I earn points for doing so?"
            },
            {
                "author": "priyankg3",
                "comment": "Hello\n@Defusion\n, How are you?\nI have few questions to ask :-\nHow does Defusion’s Text-to-Image tool differ from existing platforms like Midjourney or Leonardo?\nHow is ownership validated when users mint AI-generated content — is it IP-compliant, or just proof-of-creation?"
            },
            {
                "author": "Defusion",
                "comment": "CrisMetis:\nNice one so, if I understand correctly with Defusion for example, could someone literally train a custom anime style using LoRA and then mint scenes from it as NFTs across different chains seamlessly ?\nYes, that’s absolutely correct! With Defusion, creators can train their own custom anime style using LoRA (Low-Rank Adaptation) and then generate high-quality scenes based on that style. Once generated, these scenes can be minted as NFTs across multiple supported blockchains—all from one platform.\nDefusion currently supports 12 chains, making cross-chain minting seamless and efficient. It’s a powerful tool for both artists and collectors who want to bring their unique visions to life and reach audiences across ecosystems."
            },
            {
                "author": "Defusion",
                "comment": "zuzuzu:\nnice spirit to have, would love to hear the answer about this :\nWhat makes Defusion different from other AI art platforms like Midjourney, DALL·E, or Runway, especially in terms of on-chain integration and user incentives?\nHow does Defusion manage the compute cost of AI generation (e.g., Text-to-Image or Image-to-Video) at scale—especially with a free or credit-based model?\nGreat questions—let’s break it down:\n1. What makes Defusion different from platforms like Midjourney, DALL·E, or Runway?\nWhile those platforms focus on high-quality AI generation, Defusion goes a step further by integrating Web3 at its core:\nOn-Chain Integration: Users can mint AI-generated content directly as NFTs across 12+ supported blockchains. It’s not just about creating art—it’s about owning, trading, and showcasing it on-chain.\nUser Incentives: Defusion rewards active users with credits, badges, and airdrops. These come from daily engagement, referrals, leaderboard events, and even community contests—something traditional platforms don’t offer.\nCreator Empowerment: With tools like LoRA training, Defusion lets artists fine-tune their own styles, giving creators full control over their IP and enabling monetization within the Web3 ecosystem.\n2. How does Defusion manage compute cost at scale—especially with a free/credit model?\nDefusion uses a credit-based system to balance accessibility and sustainability:\nFree Onboarding: New users receive daily credits for basic generation (text-to-image, LoRA, etc.), allowing anyone to start creating at no cost.\nScalable Compute Optimization: Behind the scenes, Defusion leverages a combination of cloud GPU scaling and batch optimization techniques to minimize cost per generation.\nIncentivized Ecosystem: Users can earn or purchase credits through engagement, referrals, or holding NFTs. This gamifies the creative process and redistributes costs through community participation.\nIn short, Defusion isn’t just another AI art tool—it’s an on-chain creator platform where AI meets ownership, community, and rewards."
            },
            {
                "author": "Defusion",
                "comment": "han:\nWhat should I pay attention to when training my first LoRA model on Defusion? Can I share my trained model with other users, and will I earn points for doing so?\nGreat question! If you’re training your first LoRA model on Defusion, here are some key tips:\n1. Start with clean, consistent data\nUse high-quality images that clearly represent the style or concept you want to train. Consistency in pose, lighting, and composition helps the model learn more effectively.\n2. Limit the dataset at first\nStart with a small set (e.g., 10–30 images) to test results quickly. You can scale up once you’re familiar with the process.\n3. Monitor training settings\nPay attention to learning rate, training steps, and resolution. Defusion provides default parameters, but adjusting these as you learn will improve output.\n4. Test generations early\nUse checkpoints to preview results before finishing full training. This saves time and compute.\nYes, you can share your trained LoRA model with the community!\nDefusion allows users to publish their LoRA models for others to explore and use. When you share your model:\nIt becomes available in the Discover section.\nYou can earn points, badges, and even rewards based on usage, popularity, or events.\nTop creators often get featured and may receive bonus airdrops.\nSo not only can you showcase your unique style, but you also contribute to the community and get rewarded in the process."
            },
            {
                "author": "Defusion",
                "comment": "How does Defusion’s Text-to-Image tool differ from Midjourney or Leonardo?\nWhile platforms like Midjourney and Leonardo focus on closed-generation ecosystems, Defusion is built with Web3 integration from the ground up:\nCreative Freedom: Defusion offers LoRA support, letting users fine-tune models to their own style—something not available on Midjourney.\nOn-Chain Utility: Every generated image can be minted as an NFT across 12+ blockchains, which turns simple prompts into ownable, tradable digital assets.\nUser Incentives: Users earn credits, badges, and airdrops through activity—creating a gamified, rewarding ecosystem for creators, unlike most AI tools that charge purely for output.\nIn short, Defusion isn’t just about generating images—it’s about building, owning, and monetizing your AI creativity.\nHow is ownership validated when users mint AI-generated content?\nDefusion uses proof-of-creation as the core ownership model:\nWhen you mint your creation, the platform records your wallet as the origin—this becomes a permanent on-chain record of authorship.\nWhile this doesn’t replace traditional IP frameworks, it establishes verifiable provenance, which is widely accepted in Web3 as digital authorship.\nCompliance tools and usage policies help avoid misuse of copyrighted material, but ultimately, creators are responsible for ensuring ethical and compliant content.\nSo in essence, minting on Defusion is proof that you created the content, and that you claimed ownership first—on-chain and transparent."
            },
            {
                "author": "Rohit",
                "comment": "A lot of ideas have come to expose creators but most have failed due to over estimation of the reach thier project solve. Can I knw what major problem defusion solve, and does it align with the major problems associated with onboarding traditional creators to web3."
            },
            {
                "author": "Xomi",
                "comment": "So how do you ensure fairness in rewarding the creators and those that engage."
            },
            {
                "author": "priyankg3",
                "comment": "Defusion seems to be leading the way for a more creator-centric, future-focused AI platform. Can’t wait to see where this goes!\nThanks for answering"
            }
        ]
    },
    {
        "id": "448fc9535969f249",
        "topic_id": "6177",
        "title": "Spotlight Campaign Timeline Update",
        "url": "https://forum.ceg.vote/t/spotlight-campaign-timeline-update/6177",
        "views": "",
        "comments": "2",
        "created_date": "Jul 7, 2025 4:09 pm",
        "latest_activity": "Jul 9, 2025 11:50 am",
        "content": "Spotlight Campaign Update!\nDue to overwhelming demand and numerous requests from developers, we’ve extended the application deadline for the Spotlight Campaign!\nNew Application Deadline: July 11\nWe’ve heard you! To give more projects a chance to participate, we’ve extended the application period. Don’t miss out!\nUpdated Campaign End Date: August 7\nWe’ve also updated the campaign’s end date to ensure that projects who joined the Building Phase later have more time to participate and showcase their progress.",
        "comments_details": [
            {
                "author": "Sheyda",
                "comment": "Spotlight Campaign Update!\nDue to overwhelming demand and numerous requests from developers, we’ve extended the application deadline for the Spotlight Campaign!\nNew Application Deadline: July 11\nWe’ve heard you! To give more projects a chance to participate, we’ve extended the application period. Don’t miss out!\nUpdated Campaign End Date: August 7\nWe’ve also updated the campaign’s end date to ensure that projects who joined the Building Phase later have more time to participate and showcase their progress."
            },
            {
                "author": "Norbert",
                "comment": "Giving more time for the community to apply, amplifying this! HyperHack Spotlight Campaign: Step-by-Step Playbook for Web3 Growth - #2"
            },
            {
                "author": "Ransome",
                "comment": "Thanks for giving the community a listening ear and extending the Spotlight Campaign\nBuildoors are happy!"
            }
        ]
    },
    {
        "id": "cb380610018755c6",
        "topic_id": "4778",
        "title": "Not a Dev, Still Building",
        "url": "https://forum.ceg.vote/t/not-a-dev-still-building/4778",
        "views": "",
        "comments": "6",
        "created_date": "May 26, 2025 9:05 am",
        "latest_activity": "Jul 9, 2025 11:18 am",
        "content": "GM GM frens!\nJust wanted to drop a quick intro as I settle into the forum. I’m someone who kinda stumbled into Web3 out of curiosity — and never left. You know how it goes: one minute you’re reading about Ethereum, next thing you know you’re deep in governance proposals, DeFi rabbit holes, and memecoins with questionable logos\nI’m not a dev or founder (yet), but I’m here to learn, create, and contribute in any way I can. I’m especially into breaking down complex stuff — whether it’s DeFi, L2 scaling, or DAOs — and making it more approachable for others. I believe the more people actually understand this space, the stronger we all get.\nWhether it’s writing threads, making memes, or just asking the “dumb” questions (which are often the best ones), I’m here for the long game.\nIf you’re building, exploring, or just trying to figure things out like me — let’s connect. Web3’s better when we build together.\nExcited to be here and grow with y’all",
        "comments_details": [
            {
                "author": "Evelyn",
                "comment": "GM GM frens!\nJust wanted to drop a quick intro as I settle into the forum. I’m someone who kinda stumbled into Web3 out of curiosity — and never left. You know how it goes: one minute you’re reading about Ethereum, next thing you know you’re deep in governance proposals, DeFi rabbit holes, and memecoins with questionable logos\nI’m not a dev or founder (yet), but I’m here to learn, create, and contribute in any way I can. I’m especially into breaking down complex stuff — whether it’s DeFi, L2 scaling, or DAOs — and making it more approachable for others. I believe the more people actually understand this space, the stronger we all get.\nWhether it’s writing threads, making memes, or just asking the “dumb” questions (which are often the best ones), I’m here for the long game.\nIf you’re building, exploring, or just trying to figure things out like me — let’s connect. Web3’s better when we build together.\nExcited to be here and grow with y’all"
            },
            {
                "author": "Julie0xnana",
                "comment": "Welcome to the Metis Forum, Evelyn!"
            },
            {
                "author": "Liametis",
                "comment": "gm gm welcome to the Metisian squad Evelyn\ni started out cryptocurious just like as you and now im a full time addict lol"
            },
            {
                "author": "priyankg3",
                "comment": "Welcome Evelyn to the Metis Forum"
            },
            {
                "author": "han",
                "comment": "GM! Love the energy- totally relate to the “fell in and never left” vibe."
            },
            {
                "author": "4ngel",
                "comment": "Welcome to the Metis family"
            },
            {
                "author": "Gigabriansmith",
                "comment": "lol that was me too"
            }
        ]
    },
    {
        "id": "66f9511994e67bd7",
        "topic_id": "6056",
        "title": "HyperHack Spotlight Campaign: Step-by-Step Playbook for Web3 Growth",
        "url": "https://forum.ceg.vote/t/hyperhack-spotlight-campaign-step-by-step-playbook-for-web3-growth/6056",
        "views": "",
        "comments": "2",
        "created_date": "Jun 30, 2025 3:02 pm",
        "latest_activity": "Jul 9, 2025 11:14 am",
        "content": "You are a Web3 builder challenging for the $200k prize pool in the HyperHack. You also would not mind a share of the Spotlight Campaign $7500 prize pool. So ‘wen marketing’? Now it is time to make the most of your $500 marketing credits and build an initial community and user base.\nThis post gives you a set of specific growth strategies you can copy or adapt. Many brilliant developers are not sure how to approach marketing. That is completely normal. These ideas are designed to give you a structured template or just a starting point.\nUse these steps exactly as written or get creative and put your own twist on them. And remember, you are free to use the $500 however you want. Any creative marketing tactic is fair game.\nI. Foundation: Define Growth Goals and Core Metrics\nBefore spending anything, get clear on what success looks like.\nSet Clear Objectives\nDo you want more dApp testers, Twitter followers, DAO voters, or product feedback? Pick one or two core goals and let them guide all your actions.\nIdentify Target Audiences\nAre you speaking to developers, early users, Metis fans, or curious crypto explorers? Your content should meet them where they are.\nII. User Acquisition: Low-Cost, High-Impact Plays\nYour $500 is enough to bring in users fast. Focus on plays that drive visibility and measurable results.\nQuest Campaigns (TaskOn, Magic Square, Zealy)\nThese platforms let you reward users for completing actions like following your Twitter, testing your dApp, or joining your Telegram. TaskOn and Magic Square are partners of HyperHack so we highly recommend them and they will be fast to support you if you run into any issues.\nQuest Playbook:\nChoose your platform\nAdd 5 to 7 simple engaging tasks\nTasks can be interacting with your key tweets, joining socials, onchain interactions, promoting your project etc\nSet aside $100 to $150 in rewards\nPromote across Twitter and the Hyperion Forum\nTwitter Ads for Targeted Growth\nTwitter is where your early users live. Whether you are building for devs, degen traders, or DAO voters, this is where they spend time. Use part of your budget to get in front of them.\nYou have two options:\nBoost Promote a tweet:\nPick a tweet with a strong call to action. Major announcements and creative marketing tweets can be boosted. It should explain your value clearly and include a link to your dApp, quest board, or community.\nUse the built-in Promote Boost feature.\nBoost Tweet Playbook:\nClick the Promote button in the right hand corner of the tweet\nSelect one country to target\nSelect a specific age range (for example, 18 to 45)\nStart with a $10 boost over 24 hours and assess results\nTrack analytics and iterate\nCreate a sponsored Ad campaign\nThis gives you deeper targeting options. You can reach people based on who they follow and what keywords they engage with. This approach works if you are looking for a precise type of people to connect with. For example Web3 AI developers or AI product testers.\nSponsored Ad Playbook:\nUse Twitter’s Ads Manager\nSelect your preferred targeting options (location, demographics, keywords, interests etc)\nRun a few $10 Ads over 24 hours and wait until you have a decent performing Ad before you scale up the spending\nHigh performing Ads in crypto in general can have something like a Cost Per Click (CPC) of $0.5 and engagement rates of 5%+. However, this varies largely depending on your specific demographic targeting.\nShort Video Content\nSpend around $100 on a 10-20 second trailer that shows off your product, vision, or vibe.\nVideo Playbook:\nKeep it short and energetic\nInclude exciting background music, key words, product screenshots, clips of your UX etc\nPost it on Twitter and pin it\nBoost the tweet to reach more people\nYou can create the video yourself if you have basic editing skills\nHire a third party for around $100\nIf you need help finding someone, reach out to the Metis team for recommendations. Check this Forum post for more video creation tips.\nIt does not have to be a video either. You could create GIFs, memes, tutorials, infographics, or other visual content that quickly communicates your value and grabs attention. This type of content gives a strong first impression and helps convert curious visitors into active users.\nIII. Engagement and Retention: Keep Users Coming Back\nInitial traction is important. Long-term loyalty is what wins.\nHost a Twitter Space AMA\nHost one or more casual Spaces AMA on Twitter. Consider offering $50 to $100 in prizes to listeners who ask great questions or a random winner in a lucky draw to increase attendee numbers.\nAMA Spaces Playbook:\nPromote the Space 3-7 days before\nConnect with Metis influencers, ecosystem players, the main account to see if they will share it or join\nUse the opportunity to tell you and the projects story, get early user feedback, be personal\nRun a Q+A\nGive listeners call to actions like test your product or join socials\nJoin a Hyperion Vibe Session\nEvery Spotlight team must join one. This is your live moment with the Metis community.\nVibe Session Playbook:\nKeep your pitch under 20 minutes\nShare your screen and show the product/website/anything you have\nKeep it interactive by asking the DevRel team questions to make sure they are on the same page and understanding your pitch\nMonitor the youtube live chat and answer any questions that pop up live\nEnd with clear calls to action like test this app or join our group\nThis is your first impression for many in the ecosystem. Make it count.\nStay Active in the Hyperion Forum\nUse the HyperHack section of the Hyperion Forum to share progress updates, ask for feedback, and connect with other builders. This is your space to be visible and build momentum.\nFinal Advice: Copy What Works and Make It Yours\nFeel free to copy these playbooks directly. That is what they are here for. But do not be afraid to go off script and build your own version. If you team are not confident with marketing then we strongly recommend you consider bringing in a marketer.\nDon’t know one? Share your project and needs in the Marketing Guild and connect with marketers here.\nYou are building something great. Now show the world. Get creative and make your $500 marketing credit count!",
        "comments_details": [
            {
                "author": "Liametis",
                "comment": "You are a Web3 builder challenging for the $200k prize pool in the HyperHack. You also would not mind a share of the Spotlight Campaign $7500 prize pool. So ‘wen marketing’? Now it is time to make the most of your $500 marketing credits and build an initial community and user base.\nThis post gives you a set of specific growth strategies you can copy or adapt. Many brilliant developers are not sure how to approach marketing. That is completely normal. These ideas are designed to give you a structured template or just a starting point.\nUse these steps exactly as written or get creative and put your own twist on them. And remember, you are free to use the $500 however you want. Any creative marketing tactic is fair game.\nI. Foundation: Define Growth Goals and Core Metrics\nBefore spending anything, get clear on what success looks like.\nSet Clear Objectives\nDo you want more dApp testers, Twitter followers, DAO voters, or product feedback? Pick one or two core goals and let them guide all your actions.\nIdentify Target Audiences\nAre you speaking to developers, early users, Metis fans, or curious crypto explorers? Your content should meet them where they are.\nII. User Acquisition: Low-Cost, High-Impact Plays\nYour $500 is enough to bring in users fast. Focus on plays that drive visibility and measurable results.\nQuest Campaigns (TaskOn, Magic Square, Zealy)\nThese platforms let you reward users for completing actions like following your Twitter, testing your dApp, or joining your Telegram. TaskOn and Magic Square are partners of HyperHack so we highly recommend them and they will be fast to support you if you run into any issues.\nQuest Playbook:\nChoose your platform\nAdd 5 to 7 simple engaging tasks\nTasks can be interacting with your key tweets, joining socials, onchain interactions, promoting your project etc\nSet aside $100 to $150 in rewards\nPromote across Twitter and the Hyperion Forum\nTwitter Ads for Targeted Growth\nTwitter is where your early users live. Whether you are building for devs, degen traders, or DAO voters, this is where they spend time. Use part of your budget to get in front of them.\nYou have two options:\nBoost Promote a tweet:\nPick a tweet with a strong call to action. Major announcements and creative marketing tweets can be boosted. It should explain your value clearly and include a link to your dApp, quest board, or community.\nUse the built-in Promote Boost feature.\nBoost Tweet Playbook:\nClick the Promote button in the right hand corner of the tweet\nSelect one country to target\nSelect a specific age range (for example, 18 to 45)\nStart with a $10 boost over 24 hours and assess results\nTrack analytics and iterate\nCreate a sponsored Ad campaign\nThis gives you deeper targeting options. You can reach people based on who they follow and what keywords they engage with. This approach works if you are looking for a precise type of people to connect with. For example Web3 AI developers or AI product testers.\nSponsored Ad Playbook:\nUse Twitter’s Ads Manager\nSelect your preferred targeting options (location, demographics, keywords, interests etc)\nRun a few $10 Ads over 24 hours and wait until you have a decent performing Ad before you scale up the spending\nHigh performing Ads in crypto in general can have something like a Cost Per Click (CPC) of $0.5 and engagement rates of 5%+. However, this varies largely depending on your specific demographic targeting.\nShort Video Content\nSpend around $100 on a 10-20 second trailer that shows off your product, vision, or vibe.\nVideo Playbook:\nKeep it short and energetic\nInclude exciting background music, key words, product screenshots, clips of your UX etc\nPost it on Twitter and pin it\nBoost the tweet to reach more people\nYou can create the video yourself if you have basic editing skills\nHire a third party for around $100\nIf you need help finding someone, reach out to the Metis team for recommendations. Check this Forum post for more video creation tips.\nIt does not have to be a video either. You could create GIFs, memes, tutorials, infographics, or other visual content that quickly communicates your value and grabs attention. This type of content gives a strong first impression and helps convert curious visitors into active users.\nIII. Engagement and Retention: Keep Users Coming Back\nInitial traction is important. Long-term loyalty is what wins.\nHost a Twitter Space AMA\nHost one or more casual Spaces AMA on Twitter. Consider offering $50 to $100 in prizes to listeners who ask great questions or a random winner in a lucky draw to increase attendee numbers.\nAMA Spaces Playbook:\nPromote the Space 3-7 days before\nConnect with Metis influencers, ecosystem players, the main account to see if they will share it or join\nUse the opportunity to tell you and the projects story, get early user feedback, be personal\nRun a Q+A\nGive listeners call to actions like test your product or join socials\nJoin a Hyperion Vibe Session\nEvery Spotlight team must join one. This is your live moment with the Metis community.\nVibe Session Playbook:\nKeep your pitch under 20 minutes\nShare your screen and show the product/website/anything you have\nKeep it interactive by asking the DevRel team questions to make sure they are on the same page and understanding your pitch\nMonitor the youtube live chat and answer any questions that pop up live\nEnd with clear calls to action like test this app or join our group\nThis is your first impression for many in the ecosystem. Make it count.\nStay Active in the Hyperion Forum\nUse the HyperHack section of the Hyperion Forum to share progress updates, ask for feedback, and connect with other builders. This is your space to be visible and build momentum.\nFinal Advice: Copy What Works and Make It Yours\nFeel free to copy these playbooks directly. That is what they are here for. But do not be afraid to go off script and build your own version. If you team are not confident with marketing then we strongly recommend you consider bringing in a marketer.\nDon’t know one? Share your project and needs in the Marketing Guild and connect with marketers here.\nYou are building something great. Now show the world. Get creative and make your $500 marketing credit count!"
            },
            {
                "author": "Gigabriansmith",
                "comment": "Very helpful step by step! helps to have something which simplifies it to just: do this and see what happens rather than me keep wondering"
            }
        ]
    },
    {
        "id": "90b08e111fce3b03",
        "topic_id": "6252",
        "title": "Builders must build daily…AND tweet?",
        "url": "https://forum.ceg.vote/t/builders-must-build-daily-and-tweet/6252",
        "views": "",
        "comments": "0",
        "created_date": "Jul 9, 2025 11:01 am",
        "latest_activity": "Jul 9, 2025 11:01 am",
        "content": "recently came across this video with @danielesesta and @elliotrades claiming that Founders should be active on social media as well as building:\nthe video tweet link is here.\nhow far does this extend to lead devs and web3 builders?\ni think it’s becoming more and more important for founders and lead devs to stay active on social (especially x)\nshipping real tech takes time. Communities need more than just final releases, they need ongoing updates, a sense of momentum, and personal connection. Being part of the public build journey keeps everyone engaged and aligned",
        "comments_details": [
            {
                "author": "Liametis",
                "comment": "recently came across this video with @danielesesta and @elliotrades claiming that Founders should be active on social media as well as building:\nthe video tweet link is here.\nhow far does this extend to lead devs and web3 builders?\ni think it’s becoming more and more important for founders and lead devs to stay active on social (especially x)\nshipping real tech takes time. Communities need more than just final releases, they need ongoing updates, a sense of momentum, and personal connection. Being part of the public build journey keeps everyone engaged and aligned"
            }
        ]
    },
    {
        "id": "acef53721b441144",
        "topic_id": "5942",
        "title": "DevRel Isn’t Just GitHub Stars — What Real Success Looks Like",
        "url": "https://forum.ceg.vote/t/devrel-isn-t-just-github-stars-what-real-success-looks-like/5942",
        "views": "",
        "comments": "2",
        "created_date": "Jun 24, 2025 6:23 pm",
        "latest_activity": "Jul 9, 2025 10:51 am",
        "content": "When people talk about Developer Relations (DevRel), GitHub stars are usually the first metric they throw around.\nAnd yeah, they’re flashy. They look great in investor decks and executive dashboards.\nBut honestly? Stars can be a vanity metric. They don’t always reflect impact or engagement.\nHere’s what I’ve learned actually matters when you want to measure the real success of DevRel work:\n1. Developers Building in Public\nWhen devs start tweeting about the cool project they built using your API or SDK — that’s success.\nBonus if they share screenshots, tag your team, or drop your product into their YouTube demo.\nReal signal: “Just built this wallet connector in 15 mins thanks to @Xdevrel’s docs ”\n2. Tutorials That Drive First Success\nGood DevRel = reducing time-to-first-success.\nTrack how often your tutorials or quickstarts are completed. Ask devs: “How easy was it to get started?”\nIf they’re not rage-quitting halfway through, you’re doing it right.\nPro tip: Add subtle CTAs in tutorials to capture feedback or offer support at key steps.\n3. Community Contributions\nLook for signs of life in your ecosystem:\nPRs to your repo\nIssues with meaningful discussion\nDevs submitting bug fixes or doc updates\nPeople volunteering to write guides or translate docs\nThis is 10x more powerful than passive usage. It shows ownership.\n4. Support That Scales Through the Community\nWhen you see a question pop up in Discord or your forum — and another dev (not staff) answers it — that’s peak DevRel.\nIt means the community is engaged and empowered.\nYou’ve gone from “support team” to “dev enablement multiplier.”\n5. DevRel as a Product Feedback Engine\nIf you’re channeling feedback from devs into product improvements, you’re doing strategic DevRel — not just surface-level engagement.\nStart tracking:\nFeature requests from devs → features shipped\nBug reports that lead to fixes\nConfusion points that improve onboarding\nThis loop is gold for product-market fit.\n6. Talks, Podcasts, and Office Hours That Spark Action\nIt’s not about views or claps — it’s about outcomes.\nDid your talk lead to people signing up? Did your podcast episode drive devs to try something new?\nUse UTM links, follow-up surveys, or just plain community observation to track it.\n7. Retention > Reach\nYou don’t need 10,000 devs in your Discord.\nYou need 100 who keep coming back, build consistently, and bring others in.\nOne retained dev who builds weekly > 50 one-time visitors who star your repo and bounce.\n8. Internal Buy-In and Cross-Team Impact\nIf the PM team is asking for DevRel feedback, or the marketing team wants your help for launch messaging — that means your work is being recognized internally, not just externally.\nThis is often invisible success, but it’s powerful.\nTL;DR:\nDevRel success isn’t loud. It’s quiet, consistent, and based on real dev behavior:\nBuilding stuff\nContributing back\nShowing up\nSharing wins\nGiving feedback\nTeaching others\nAnd yeah, stars are fine. Just don’t let them be the only thing you’re tracking.",
        "comments_details": [
            {
                "author": "nidhinakranii",
                "comment": "When people talk about Developer Relations (DevRel), GitHub stars are usually the first metric they throw around.\nAnd yeah, they’re flashy. They look great in investor decks and executive dashboards.\nBut honestly? Stars can be a vanity metric. They don’t always reflect impact or engagement.\nHere’s what I’ve learned actually matters when you want to measure the real success of DevRel work:\n1. Developers Building in Public\nWhen devs start tweeting about the cool project they built using your API or SDK — that’s success.\nBonus if they share screenshots, tag your team, or drop your product into their YouTube demo.\nReal signal: “Just built this wallet connector in 15 mins thanks to @Xdevrel’s docs ”\n2. Tutorials That Drive First Success\nGood DevRel = reducing time-to-first-success.\nTrack how often your tutorials or quickstarts are completed. Ask devs: “How easy was it to get started?”\nIf they’re not rage-quitting halfway through, you’re doing it right.\nPro tip: Add subtle CTAs in tutorials to capture feedback or offer support at key steps.\n3. Community Contributions\nLook for signs of life in your ecosystem:\nPRs to your repo\nIssues with meaningful discussion\nDevs submitting bug fixes or doc updates\nPeople volunteering to write guides or translate docs\nThis is 10x more powerful than passive usage. It shows ownership.\n4. Support That Scales Through the Community\nWhen you see a question pop up in Discord or your forum — and another dev (not staff) answers it — that’s peak DevRel.\nIt means the community is engaged and empowered.\nYou’ve gone from “support team” to “dev enablement multiplier.”\n5. DevRel as a Product Feedback Engine\nIf you’re channeling feedback from devs into product improvements, you’re doing strategic DevRel — not just surface-level engagement.\nStart tracking:\nFeature requests from devs → features shipped\nBug reports that lead to fixes\nConfusion points that improve onboarding\nThis loop is gold for product-market fit.\n6. Talks, Podcasts, and Office Hours That Spark Action\nIt’s not about views or claps — it’s about outcomes.\nDid your talk lead to people signing up? Did your podcast episode drive devs to try something new?\nUse UTM links, follow-up surveys, or just plain community observation to track it.\n7. Retention > Reach\nYou don’t need 10,000 devs in your Discord.\nYou need 100 who keep coming back, build consistently, and bring others in.\nOne retained dev who builds weekly > 50 one-time visitors who star your repo and bounce.\n8. Internal Buy-In and Cross-Team Impact\nIf the PM team is asking for DevRel feedback, or the marketing team wants your help for launch messaging — that means your work is being recognized internally, not just externally.\nThis is often invisible success, but it’s powerful.\nTL;DR:\nDevRel success isn’t loud. It’s quiet, consistent, and based on real dev behavior:\nBuilding stuff\nContributing back\nShowing up\nSharing wins\nGiving feedback\nTeaching others\nAnd yeah, stars are fine. Just don’t let them be the only thing you’re tracking."
            },
            {
                "author": "Sheyda",
                "comment": "That’s a very comprehensive guide! thanks"
            },
            {
                "author": "Liametis",
                "comment": "nidhinakranii:\nDevRel success isn’t loud. It’s quiet, consistent, and based on real dev behavior:\nas always consistency is key"
            }
        ]
    },
    {
        "id": "e86da7e3d436f810",
        "topic_id": "6251",
        "title": "Should Builders Work with Blockchain Foundations or VCs?",
        "url": "https://forum.ceg.vote/t/should-builders-work-with-blockchain-foundations-or-vcs/6251",
        "views": "",
        "comments": "2",
        "created_date": "Jul 9, 2025 10:42 am",
        "latest_activity": "Jul 9, 2025 10:50 am",
        "content": "As Fracture Point continues to evolve, we’ve been lucky to interact with both blockchain foundations and venture capitalists and one question keeps surfacing in builder spaces:\nWho should early-stage teams work with, foundations or VCs?\nIt’s tempting to draw lines, but the truth is: both parties bring something valuable to the table. Rather than pick sides, I believe the future of Web3 innovation lies in understanding the distinct advantages each group offers.\nWhat Foundations Bring:\nEcosystem Integration: Foundations provide the native tools, support, and credibility to make your dApp “fit” in their ecosystem.\nGrants Without Pressure: Most don’t demand equity or tokens early on giving you breathing room to build with focus.\nCommunity Access: Foundations often serve as the first signal boost for new projects, especially with hackathons and dev evangelism.\nInfrastructure Insight: You get hands-on technical support from teams closest to the protocol layer.\nWhat VCs Bring:\nCapital for Growth: While foundations might fund you to build, VCs fund you to scale.\nNetwork Effects: VCs often bring deep connections with exchanges, influencers, service providers, and later-stage capital.\nOperational Strategy: Many firms now act as co-builders offering guidance on hiring, tokenomics, compliance, and GTM strategies.\nLong-Term Bets: If you find the right VC, they’re investing in your vision not just your product.\nFracture Point is trying to find its place in this spectrum we’ve been supported by a foundation (via HyperHack) and are exploring what strategic capital might look like in the future. We don’t see this as an “either-or” debate but more like a “build with both, wisely” challenge.\nCurious to hear from others building in the space:\nHow have you balanced foundation support vs. VC backing?\nAre there hidden pros/cons you’ve discovered?\nAny lessons on timing when is the right moment to approach either side?\nLet’s keep this constructive. The endgame isn’t funding it’s sustainable, user-first innovation.\nLooking forward to your thoughts.",
        "comments_details": [
            {
                "author": "Ghostt",
                "comment": "As Fracture Point continues to evolve, we’ve been lucky to interact with both blockchain foundations and venture capitalists and one question keeps surfacing in builder spaces:\nWho should early-stage teams work with, foundations or VCs?\nIt’s tempting to draw lines, but the truth is: both parties bring something valuable to the table. Rather than pick sides, I believe the future of Web3 innovation lies in understanding the distinct advantages each group offers.\nWhat Foundations Bring:\nEcosystem Integration: Foundations provide the native tools, support, and credibility to make your dApp “fit” in their ecosystem.\nGrants Without Pressure: Most don’t demand equity or tokens early on giving you breathing room to build with focus.\nCommunity Access: Foundations often serve as the first signal boost for new projects, especially with hackathons and dev evangelism.\nInfrastructure Insight: You get hands-on technical support from teams closest to the protocol layer.\nWhat VCs Bring:\nCapital for Growth: While foundations might fund you to build, VCs fund you to scale.\nNetwork Effects: VCs often bring deep connections with exchanges, influencers, service providers, and later-stage capital.\nOperational Strategy: Many firms now act as co-builders offering guidance on hiring, tokenomics, compliance, and GTM strategies.\nLong-Term Bets: If you find the right VC, they’re investing in your vision not just your product.\nFracture Point is trying to find its place in this spectrum we’ve been supported by a foundation (via HyperHack) and are exploring what strategic capital might look like in the future. We don’t see this as an “either-or” debate but more like a “build with both, wisely” challenge.\nCurious to hear from others building in the space:\nHow have you balanced foundation support vs. VC backing?\nAre there hidden pros/cons you’ve discovered?\nAny lessons on timing when is the right moment to approach either side?\nLet’s keep this constructive. The endgame isn’t funding it’s sustainable, user-first innovation.\nLooking forward to your thoughts."
            },
            {
                "author": "Ghostt",
                "comment": "@i_am_supaman_lj\ncheck here"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "I dont really know what i am seeing, are you asking for my opinion or a reply to your topic.\nreply: i think one comes before the other, you need a community before scaling. Fracture Point is designed to be successful through community trust and input. But scaling is equally important right after the community says so."
            }
        ]
    },
    {
        "id": "ce9f0992b15ea84f",
        "topic_id": "5752",
        "title": "How Can We Boost Community Engagement in Hyperion’s Marketing?",
        "url": "https://forum.ceg.vote/t/how-can-we-boost-community-engagement-in-hyperion-s-marketing/5752",
        "views": "",
        "comments": "21",
        "created_date": "Jun 16, 2025 10:09 am",
        "latest_activity": "Jul 9, 2025 10:37 am",
        "content": "Hi everyone,\nI’ve been thinking about marketing ideas to help grow the Hyperion ecosystem. What do you think are the most effective ways to increase community engagement? In areas like social media, content creation, events, or reward systems, what approaches could work best?\nAlso, how could we make community contributions more visible and rewarding-through badges, point systems, campaigns, or similar?\nI’d love to hear your thoughts and experiences if you’re willing to share!",
        "comments_details": [
            {
                "author": "han",
                "comment": "Hi everyone,\nI’ve been thinking about marketing ideas to help grow the Hyperion ecosystem. What do you think are the most effective ways to increase community engagement? In areas like social media, content creation, events, or reward systems, what approaches could work best?\nAlso, how could we make community contributions more visible and rewarding-through badges, point systems, campaigns, or similar?\nI’d love to hear your thoughts and experiences if you’re willing to share!"
            },
            {
                "author": "Norbert",
                "comment": "Good topic. A few practical ways we can grow engagement and visibility in my opinion, which we are doing already at Metis:\n• Short-form builder stories (Vibe sessions). Builders connect with people, not just product updates but get live questions and Answer sessions with Metis Devrel and community\n• One thing i would love to see and working on it to make it happen is to run weekly digests or highlights from the forum. So we have some overview of what is happening on major areas\n• Recognize effort, not noise. Badges and points should reflect real value, not post count. Curated community highlights help. Weekly or bi-weekly digests showcasing forum posts, guild updates, or active contributors can go a long way.\nIf we want this to scale, the system has to be simple and that’s what Hyperion Forum is about, consistent, and fairness are key.\nLet me know what you think"
            },
            {
                "author": "Geographer",
                "comment": "Hi everyone!\nGreat topic—growing the Hyperion ecosystem will depend heavily on how engaged and motivated the community feels. Here are a few ideas I believe could make a real difference:\nSocial Media & Content Creation\n#BuiltOnHyperion Campaigns: Encourage devs and creators to share what they’ve built, with visuals or demo videos—could even turn into a recurring series.\nCreator Grants or Bounties for blog posts, tutorials, or videos explaining how to use parts of the Hyperion stack.\nShort-form video contests explaining Hyperion concepts in <60 seconds (e.g., reels, TikToks).\nEvents & Interactive Engagement\nHyperion Town Halls or Office Hours: Monthly check-ins with the team or contributors to align on priorities and share updates.\nThemed Community Weeks: For example, “Infrastructure Week” or “Gaming on Hyperion Week,” where focused discussions, demos, and content happen.\nBuild & Earn hackathons (virtual or local) that encourage people to create tools, apps, or content.\nRewards, Recognition & Incentives\nHyperion XP System: Points for meaningful contributions (support, content, feedback, dev work), leading to levels, roles, and perks.\nDynamic badges/NFTs for community achievements—like “Validator,” “Early Supporter,” “Community Helper,” etc.\nLeaderboard Dashboards to publicly celebrate top contributors across categories.\nCampaign Ideas\n“Help Build the Hyperion Wiki”: Incentivize community-led documentation, FAQs, or beginner guides.\nMonthly Contribution Challenges: e.g. “Write a guide,” “Translate docs,” or “Answer 10 questions on Discord.”\nOverall, the more visible and valued contributions feel, the more people will want to get involved. Hyperion already has a strong tech foundation—now it’s about building a passionate, collaborative culture on top of it.\nWould love to hear if others have tried systems like these—or have totally different approaches!"
            },
            {
                "author": "han",
                "comment": "Well said. Signal over noise, stories over stats and consistency is the real growth hack. Fully aligned."
            },
            {
                "author": "4ngel",
                "comment": "More of “vitalik’s mom” less of “Web3 complicated language” haha JK ! I personnaly think devs and marketers should work together to simplfiy all the metis hyperion complicated stuff and give an insight on what’s the futur of Metis and hyperion will be in simple words"
            },
            {
                "author": "Elenaisplaying",
                "comment": "Love this initiative — growing the Hyperion community will need more than just awareness, it needs belonging.\nOne thing that could really work is a layered content strategy:\nUse public platforms (X, Farcaster) to spark interest\nThen funnel into interactive spaces like the Hyperion Forum or gated Discord channels for deeper engagement\nFor visibility and motivation, a community contribution score could be effective, combining things like:\nForum activity\nEducational content creation (threads, videos, translations)\nParticipation in testing or feedback\nEvent attendance or hosting\nGamify it with seasonal campaigns and onchain badges, even better if these unlock real perks like early access or governance rights."
            },
            {
                "author": "Ameliadupontttm",
                "comment": "han:\nHi everyone,\nI’ve been thinking about marketing ideas to help grow the Hyperion ecosystem. What do you think are the most effective ways to increase community engagement? In areas like social media, content creation, events, or reward systems, what approaches could work best?\nAlso, how could we make community contributions more visible and rewarding-through badges, point systems, campaigns, or similar?\nI’d love to hear your thoughts and experiences if you’re willing to share!\nGreat question! I think starting with small but fun reward systems (like badges or point leaderboards) always helps to motivate early contributors. Also, meme contests or short-form video campaigns on X/TG could really help bring more organic buzz to Hyperion"
            },
            {
                "author": "Harley",
                "comment": "Signal over noise. Stories > stats. Consistency wins."
            },
            {
                "author": "Lucie3",
                "comment": "Some quick ideas to boost Hyperion engagement:\n– Gamify testnet tasks with XP, levels, and titles (on-chain or off-chain)\n– Spotlight builders weekly — tweets, memes, even WIP posts\n– Use meme formats to highlight key testnet milestones\n– Run low-lift quests (e.g. “Deploy + Tweet” mini-sprints)\n– Reward insightful feedback , not just high volume\n– Tie it back to Metis’ sequencer vision so people know “why” it matters\nHyperion = not just test infra. It’s the launchpad for real L2 contributors."
            },
            {
                "author": "han",
                "comment": "Haha totally agree! Simplifying things doesn’t mean dumbing them down-it means opening the door for more people to actually get it. Devs and marketers teaming up sounds like the perfect recipe for clarity, especially with something as powerful (and complex) as Metis + Hyperion."
            },
            {
                "author": "han",
                "comment": "These are ideas love how they blend fun with purpose. Gamifying tasks + highlighting real builders makes it feel alive, not just like another testnet. And tying it all back to Metis’ sequencer vision? That’s the kind of context people need to stay invested. Hyperion should feel like a movement, not a checklist."
            },
            {
                "author": "han",
                "comment": "Absolutely. Stories create connection, stats just support them. In a noisy space like Web3, clear signals and consistent storytelling are what actually stick."
            },
            {
                "author": "han",
                "comment": "Small rewards + creative formats like memes or short vids are perfect for sparking early momentum and community buzz."
            },
            {
                "author": "han",
                "comment": "Love the depth here totally aligned. Awareness gets people in the door, but belonging keeps them around. Layered content + meaningful contribution tracking = a community that feels seen and empowered. Onchain perks tied to real effort? That’s the future."
            },
            {
                "author": "Norbert",
                "comment": "Well, i would say we shouldn’t fully ignore stats😅. As long as everything blockchain happens “onchain” we need to make sure the stories at least match the stats, else we will have noise with ghost towns"
            },
            {
                "author": "MK-Quen",
                "comment": "I believe that not only selling your project but have a genuine approach to your community will increase the engagement"
            },
            {
                "author": "Ghostt",
                "comment": "For a minuite you sound like\n@i_am_supaman_lj\nproof of play/contribution . I think if he is here he will give a good way to tackle this."
            },
            {
                "author": "Rosita",
                "comment": "Love this topic! So many great ideas in the replies already, excited to see more!"
            },
            {
                "author": "CrisMetis",
                "comment": "This is really a great post to keep the conversation ongoing and share ideas among the community. A vibrant community it’s also the key to boost the engagement, and I love to see already all these answers and thoughts."
            },
            {
                "author": "Norbert",
                "comment": "Interesting, let me be a spectator and read what our precious marketers would drop on this one."
            }
        ]
    },
    {
        "id": "19107ea94bbceb14",
        "topic_id": "6128",
        "title": "Fracture Point: Core Development Update – A Deep Dive into Our Web3 Foundation!",
        "url": "https://forum.ceg.vote/t/fracture-point-core-development-update-a-deep-dive-into-our-web3-foundation/6128",
        "views": "",
        "comments": "2",
        "created_date": "Jul 3, 2025 4:43 pm",
        "latest_activity": "Jul 9, 2025 7:24 am",
        "content": "We are thrilled to unveil a monumental leap in the development of Fracture Point, our upcoming tactical TPS game. While our interactive lobby prototype provides a glimpse into the player experience, the true revolution lies in the meticulously crafted on-chain smart contracts and the robust Alith Architecture that power our innovative Proof of Play ecosystem.\nThis past month has been dedicated to building the immutable bedrock of Fracture Point’s Web3 capabilities, focusing on decentralized ownership, verifiable progression, and a player-driven economy.\nFracture Point: The Game Skill, Strategy, and True Digital Ownership\nFracture Point is designed as a high-octane, tactical third-person shooter that demands precision, strategic thinking, and teamwork. We are building a fiercely competitive environment where your skill and dedication are not just recognized, but are fundamentally integrated into the game’s core value system.\nPrepare for:\nIntense FPS Combat: Master diverse weapon loadouts and tactical maneuvers in dynamic, high-stakes engagements.\nDeep Customization: Personalize your agents and unique “variants”, making your mark on the battlefield.\nCompetitive Progression: Climb verifiable leaderboards, earn genuine rewards, and truly own your in-game achievements.\nThe Proof of Play Revolution: Rewarding Skill On-Chain\nOur commitment to Proof of Play is the defining feature of Fracture Point. This is not a concept; it’s a core, on-chain mechanism ensuring that your active engagement and skillful performance directly translate into verifiable, immutable value and progression within the game’s ecosystem.\nHow Proof of Play works in Fracture Point, powered by our contracts:\nVerifiable Achievements: Through the GameAchievementRegistry.sol contract (which is part of our ClaimManager system), your significant in-game achievements and progression milestones are immutably recorded on the blockchain. This provides transparent, provable recognition for your dedication and skill.\nSkill-Based Rewards: Our FPToken (FracturePoint Token), serving as XP, is minted to players based on their in-game performance (e.g., in Rift events), authorized exclusively by our trusted Alith Oracle. This ensures that rewards are earned through genuine gameplay.\nOn-Chain Progression & Badges: Your accumulated FPToken (XP) can then be burned via the ClaimManager contract to claim unique Rank Badges (ERC-721 NFTs) from the RankBadge.sol contract, signifying your seasonal achievements and skill tier. This process is entirely on-chain, making your rank verifiable and owned.\nPlayer-Driven Ecosystem: This interconnected system ensures that the game’s economy and value are directly influenced and shaped by the collective activity and skilled contributions of its player base.\nThis ensures Fracture Point rewards genuine skill, time invested, and proven performance, fostering a fair, transparent, and truly player-owned gaming experience.\nOur Core Architecture: Dedicated Smart Contracts and The Alith Framework\nThe true innovation behind Fracture Point lies in its robust, interconnected smart contracts and the strategic implementation of the Alith Architecture.\n1. The Alith Architecture: Our Tailored Blockchain Game Framework\nFracture Point leverages a bespoke implementation of the Alith Architecture. This is our comprehensive, modular framework meticulously designed to seamlessly integrate blockchain technology without compromising gameplay performance. It intelligently separates:\nOn-Chain Components: Our smart contracts (FPToken, RankBadge, ClaimManager) handle critical, immutable data like XP (FPToken) balances, Rank Badge (NFT) ownership, and verifiable achievements. This ensures decentralization, security, and provable ownership. The Alith Oracle acts as the trusted off-chain authority that bridges game outcomes to on-chain actions, such as distributing XP and authorizing badge claims.\nOff-Chain Backend: High-frequency game logic, real-time matchmaking, complex physics calculations, and volatile player statistics run on a performant off-chain backend. This guarantees a smooth, low-latency, and responsive gameplay experience, unburdened by blockchain transaction times and gas costs.\nSecure Interoperability: A robust and auditable communication layer ensures seamless and secure data flow between our contracts (governed by the Alith Oracle) and the off-chain game server.\n2. Fracture Point’s Core Smart Contracts (Audited & Interconnected)\nWe have successfully designed, developed, and prepared for deployment the foundational smart contracts that power Fracture Point’s Web3 economy and the Proof of Play mechanics. These contracts work in concert:\nFPToken.sol (FuturePoint Token) : This ERC-20 token represents XP within the Fracture Point ecosystem. It’s designed specifically for in-game progression:\nMinted by Alith Oracle: Only the designated alithOracle can mint new FPToken to players (e.g., via distributeRiftXP) based on game outcomes.\nBurned by ClaimManager: The ClaimManager contract is uniquely authorized to burn FPToken (XP) from player balances when they claim Rank Badges, creating a clear utility and economic loop.\nNon-Transferable (Player-to-Player): Significantly, direct player-to-player transfers of FPToken are disabled. This ensures FPToken remains a pure XP/progression token, preventing speculative trading and focusing its value on in-game achievement.\nRankBadge.sol (Fracture Point Rank Badge) : This ERC-721 NFT contract represents unique, season-specific Rank Badges that players can earn.\nMinted by ClaimManager: Only the ClaimManager contract is authorized to mint new Rank Badges to players, ensuring badges are earned through the proper Proof of Play mechanism.\nImmutable On-Chain Proof: Each badge is a unique NFT, providing verifiable, immutable proof of a player’s achievement for a given season and rank.\nClaimManager.sol : This is the central orchestrator contract, linking FPToken (XP) to Rank Badges (NFTs) and acting as the bridge to the Alith Oracle.\nManages Badge Claims: Players claim badges via ClaimManager, which then verifies their XP balance, burns the necessary FPToken from their account, and instructs RankBadge.sol to mint the new NFT.\nSeason Management: It tracks the currentSeason, ensuring players can only claim one badge per season.\nKarma Evaluation Requests: It facilitates requests for off-chain “Karma” evaluations by the Alith Oracle, hinting at deeper player behavior analysis.\nAlith Oracle Integration: It designates and relies on the alithOracle for authorizing badge claims and distributing rewards based on verified game data.\nThe code for these foundational contracts and the full Alith Architecture implementation can be reviewed in our public repository: https://github.com/SUPAMAN-dev/fracture-point-hyperhack\nYou can also verify our currently deployed contract addresses on the Hyperion testnet network: https://hyperion-testnet.metisdevops.link/\nFPToken Address: 0x4D23a7A2231624F1486CE0dE07C2fbF002f751B9\nClaimManager Address: 0x1Dab96d049e3ce56D51e6B0b149477927B897FFb\nRankBadge Address: 0xBB84D771f6aef01f00dEE45D9C9dF9C7ef9159e5\n(Note on GHC: While not currently on-chain, the fixed supply GHC currency, managed by multisig, will form the broader economic layer of Fracture Point. Its design ensures seamless future integration with our on-chain systems when the time is right, complementing the FPToken XP system.)\nLobby Prototype: The Player’s Interactive Gateway\nComplementing this powerful blockchain backend, our functional lobby prototype provides the intuitive player-facing interface. It allows players to:\nSeamlessly navigate between game modes, customization options, and personal profiles.\nExperience a polished UI/UX that aligns with Fracture Point’s futuristic theme.\nInteract with the foundational elements for future wallet integration, demonstrating how players will connect their on-chain assets to the game.\nLink to the prototype demo: https://youtu.be/aI_lQ6DcwEI\nEcosystem Interest: Strategic Offer from Plurality Web3\nAs a direct result of our development efforts during this Hyperion Hackathon, Fracture Point attracted partnership interest from leading Web3 infrastructure teams, most notably Plurality Web3, a startup pioneering embedded identity and authentication infrastructure for dApps.\nPlurality offered us a 12-month support package under their Partner Program, which includes:\n1:1 Engineering Support for seamless integration of user authentication and personalized in-game logic.\nFree infrastructure credits to cover authentication, user session tooling, and zkTLS-powered identity gating.\nUX Collaboration to co-design smooth onboarding flows without popups or clunky wallets particularly valuable for our casual-to-core player conversion goals.\nTheir outreach came after they reviewed Fracture Point’s Hyperion-backed Proof of Play system and saw clear potential for adoption in competitive Web3 gaming.\nWe view this offer as both validation of our underlying architecture and a strategic complement to the low-cost, high-throughput infrastructure that Hyperion enables. These ecosystem synergies affirm that Fracture Point is not just a playable demo, but a platform being taken seriously by early infrastructure players.\nWhat’s Next for Fracture Point?\nWith the core blockchain architecture, smart contracts, and the lobby interface firmly established, our immediate next steps are to integrate these powerful systems with the actual game engine to bring the full combat experience to life. This includes:\nBackend Game Logic Development: Building out the sophisticated off-chain systems for real-time matchmaking, secure player data management, and robust anti-cheat measures.\nGame Engine Integration: Connecting the lobby and backend systems to a game engine to render the immersive world and high-fidelity combat of Fracture Point.\nProof of Play Loop Refinement: Fully integrating in-game actions with our GameAchievementRegistry.sol via the Alith Oracle to ensure every skill-based action is verifiable and contributes to player progression and potential future GHC earnings.\nThis is an incredibly exciting time for Fracture Point. We invite you to join our community as we build the next evolution of TPS gaming, truly owned and driven by its players.\nJoin our community and stay updated!\nTelegram\nFracture Point\nYou can view and join @fracturepointlabs right away.\nDiscord\nJoin the Fracture Point Discord Server!\nCheck out the Fracture Point community on Discord – hang out with 2 other members and enjoy free voice and text chat.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!",
        "comments_details": [
            {
                "author": "i_am_supaman_lj",
                "comment": "We are thrilled to unveil a monumental leap in the development of Fracture Point, our upcoming tactical TPS game. While our interactive lobby prototype provides a glimpse into the player experience, the true revolution lies in the meticulously crafted on-chain smart contracts and the robust Alith Architecture that power our innovative Proof of Play ecosystem.\nThis past month has been dedicated to building the immutable bedrock of Fracture Point’s Web3 capabilities, focusing on decentralized ownership, verifiable progression, and a player-driven economy.\nFracture Point: The Game Skill, Strategy, and True Digital Ownership\nFracture Point is designed as a high-octane, tactical third-person shooter that demands precision, strategic thinking, and teamwork. We are building a fiercely competitive environment where your skill and dedication are not just recognized, but are fundamentally integrated into the game’s core value system.\nPrepare for:\nIntense FPS Combat: Master diverse weapon loadouts and tactical maneuvers in dynamic, high-stakes engagements.\nDeep Customization: Personalize your agents and unique “variants”, making your mark on the battlefield.\nCompetitive Progression: Climb verifiable leaderboards, earn genuine rewards, and truly own your in-game achievements.\nThe Proof of Play Revolution: Rewarding Skill On-Chain\nOur commitment to Proof of Play is the defining feature of Fracture Point. This is not a concept; it’s a core, on-chain mechanism ensuring that your active engagement and skillful performance directly translate into verifiable, immutable value and progression within the game’s ecosystem.\nHow Proof of Play works in Fracture Point, powered by our contracts:\nVerifiable Achievements: Through the GameAchievementRegistry.sol contract (which is part of our ClaimManager system), your significant in-game achievements and progression milestones are immutably recorded on the blockchain. This provides transparent, provable recognition for your dedication and skill.\nSkill-Based Rewards: Our FPToken (FracturePoint Token), serving as XP, is minted to players based on their in-game performance (e.g., in Rift events), authorized exclusively by our trusted Alith Oracle. This ensures that rewards are earned through genuine gameplay.\nOn-Chain Progression & Badges: Your accumulated FPToken (XP) can then be burned via the ClaimManager contract to claim unique Rank Badges (ERC-721 NFTs) from the RankBadge.sol contract, signifying your seasonal achievements and skill tier. This process is entirely on-chain, making your rank verifiable and owned.\nPlayer-Driven Ecosystem: This interconnected system ensures that the game’s economy and value are directly influenced and shaped by the collective activity and skilled contributions of its player base.\nThis ensures Fracture Point rewards genuine skill, time invested, and proven performance, fostering a fair, transparent, and truly player-owned gaming experience.\nOur Core Architecture: Dedicated Smart Contracts and The Alith Framework\nThe true innovation behind Fracture Point lies in its robust, interconnected smart contracts and the strategic implementation of the Alith Architecture.\n1. The Alith Architecture: Our Tailored Blockchain Game Framework\nFracture Point leverages a bespoke implementation of the Alith Architecture. This is our comprehensive, modular framework meticulously designed to seamlessly integrate blockchain technology without compromising gameplay performance. It intelligently separates:\nOn-Chain Components: Our smart contracts (FPToken, RankBadge, ClaimManager) handle critical, immutable data like XP (FPToken) balances, Rank Badge (NFT) ownership, and verifiable achievements. This ensures decentralization, security, and provable ownership. The Alith Oracle acts as the trusted off-chain authority that bridges game outcomes to on-chain actions, such as distributing XP and authorizing badge claims.\nOff-Chain Backend: High-frequency game logic, real-time matchmaking, complex physics calculations, and volatile player statistics run on a performant off-chain backend. This guarantees a smooth, low-latency, and responsive gameplay experience, unburdened by blockchain transaction times and gas costs.\nSecure Interoperability: A robust and auditable communication layer ensures seamless and secure data flow between our contracts (governed by the Alith Oracle) and the off-chain game server.\n2. Fracture Point’s Core Smart Contracts (Audited & Interconnected)\nWe have successfully designed, developed, and prepared for deployment the foundational smart contracts that power Fracture Point’s Web3 economy and the Proof of Play mechanics. These contracts work in concert:\nFPToken.sol (FuturePoint Token) : This ERC-20 token represents XP within the Fracture Point ecosystem. It’s designed specifically for in-game progression:\nMinted by Alith Oracle: Only the designated alithOracle can mint new FPToken to players (e.g., via distributeRiftXP) based on game outcomes.\nBurned by ClaimManager: The ClaimManager contract is uniquely authorized to burn FPToken (XP) from player balances when they claim Rank Badges, creating a clear utility and economic loop.\nNon-Transferable (Player-to-Player): Significantly, direct player-to-player transfers of FPToken are disabled. This ensures FPToken remains a pure XP/progression token, preventing speculative trading and focusing its value on in-game achievement.\nRankBadge.sol (Fracture Point Rank Badge) : This ERC-721 NFT contract represents unique, season-specific Rank Badges that players can earn.\nMinted by ClaimManager: Only the ClaimManager contract is authorized to mint new Rank Badges to players, ensuring badges are earned through the proper Proof of Play mechanism.\nImmutable On-Chain Proof: Each badge is a unique NFT, providing verifiable, immutable proof of a player’s achievement for a given season and rank.\nClaimManager.sol : This is the central orchestrator contract, linking FPToken (XP) to Rank Badges (NFTs) and acting as the bridge to the Alith Oracle.\nManages Badge Claims: Players claim badges via ClaimManager, which then verifies their XP balance, burns the necessary FPToken from their account, and instructs RankBadge.sol to mint the new NFT.\nSeason Management: It tracks the currentSeason, ensuring players can only claim one badge per season.\nKarma Evaluation Requests: It facilitates requests for off-chain “Karma” evaluations by the Alith Oracle, hinting at deeper player behavior analysis.\nAlith Oracle Integration: It designates and relies on the alithOracle for authorizing badge claims and distributing rewards based on verified game data.\nThe code for these foundational contracts and the full Alith Architecture implementation can be reviewed in our public repository: https://github.com/SUPAMAN-dev/fracture-point-hyperhack\nYou can also verify our currently deployed contract addresses on the Hyperion testnet network: https://hyperion-testnet.metisdevops.link/\nFPToken Address: 0x4D23a7A2231624F1486CE0dE07C2fbF002f751B9\nClaimManager Address: 0x1Dab96d049e3ce56D51e6B0b149477927B897FFb\nRankBadge Address: 0xBB84D771f6aef01f00dEE45D9C9dF9C7ef9159e5\n(Note on GHC: While not currently on-chain, the fixed supply GHC currency, managed by multisig, will form the broader economic layer of Fracture Point. Its design ensures seamless future integration with our on-chain systems when the time is right, complementing the FPToken XP system.)\nLobby Prototype: The Player’s Interactive Gateway\nComplementing this powerful blockchain backend, our functional lobby prototype provides the intuitive player-facing interface. It allows players to:\nSeamlessly navigate between game modes, customization options, and personal profiles.\nExperience a polished UI/UX that aligns with Fracture Point’s futuristic theme.\nInteract with the foundational elements for future wallet integration, demonstrating how players will connect their on-chain assets to the game.\nLink to the prototype demo: https://youtu.be/aI_lQ6DcwEI\nEcosystem Interest: Strategic Offer from Plurality Web3\nAs a direct result of our development efforts during this Hyperion Hackathon, Fracture Point attracted partnership interest from leading Web3 infrastructure teams, most notably Plurality Web3, a startup pioneering embedded identity and authentication infrastructure for dApps.\nPlurality offered us a 12-month support package under their Partner Program, which includes:\n1:1 Engineering Support for seamless integration of user authentication and personalized in-game logic.\nFree infrastructure credits to cover authentication, user session tooling, and zkTLS-powered identity gating.\nUX Collaboration to co-design smooth onboarding flows without popups or clunky wallets particularly valuable for our casual-to-core player conversion goals.\nTheir outreach came after they reviewed Fracture Point’s Hyperion-backed Proof of Play system and saw clear potential for adoption in competitive Web3 gaming.\nWe view this offer as both validation of our underlying architecture and a strategic complement to the low-cost, high-throughput infrastructure that Hyperion enables. These ecosystem synergies affirm that Fracture Point is not just a playable demo, but a platform being taken seriously by early infrastructure players.\nWhat’s Next for Fracture Point?\nWith the core blockchain architecture, smart contracts, and the lobby interface firmly established, our immediate next steps are to integrate these powerful systems with the actual game engine to bring the full combat experience to life. This includes:\nBackend Game Logic Development: Building out the sophisticated off-chain systems for real-time matchmaking, secure player data management, and robust anti-cheat measures.\nGame Engine Integration: Connecting the lobby and backend systems to a game engine to render the immersive world and high-fidelity combat of Fracture Point.\nProof of Play Loop Refinement: Fully integrating in-game actions with our GameAchievementRegistry.sol via the Alith Oracle to ensure every skill-based action is verifiable and contributes to player progression and potential future GHC earnings.\nThis is an incredibly exciting time for Fracture Point. We invite you to join our community as we build the next evolution of TPS gaming, truly owned and driven by its players.\nJoin our community and stay updated!\nTelegram\nFracture Point\nYou can view and join @fracturepointlabs right away.\nDiscord\nJoin the Fracture Point Discord Server!\nCheck out the Fracture Point community on Discord – hang out with 2 other members and enjoy free voice and text chat.\nfracturepoint.netlify.app\nFracture Point - Unleash Your Variant. Dominate the Fractured Rifts.\nFracture Point is a next-gen Web3 battle royale game with unique Variants, fast-paced combat, and blockchain rewards ($GHC). Join the fight!"
            },
            {
                "author": "Rohit",
                "comment": "This is such a wonderful project, but I can’t but help!\nLooking through your architecture, what is the major role of alith, you talked about integration with Alith but you have to paint it more visibly for me.\nWhat does alith do on fracture point actually?"
            },
            {
                "author": "i_am_supaman_lj",
                "comment": "Thanks for the kind words! Really appreciate the interest and great question.\nAt its core, Fracture Point is about creating a truly fair and transparent gaming ecosystem, where skill and effort are what get rewarded, not exploits or shortcuts.\nThat’s exactly where Alith comes in.\nIn a typical game, especially online shooters, you always run into players who cheat, farm, or abuse systems to win. That destroys trust. What we’re doing differently in Fracture Point is putting integrity at the heart of our reward system.\nAlith acts as the intelligent game moderator. It monitors every match every Rift through the Unity backend, evaluating outcomes, watching for exploits, and making sure only fair wins are rewarded. No shady leaderboard climbs. No rigged XP farming.\nThen, using its special permissions (as the alithOracle in our ClaimManager contract), Alith sends reward signals on-chain, issuing XP (FPToken) to players who truly earned them. That XP can then be used to claim seasonal badges and other progression rewards all verifiable and immutable.\nOver time, Alith learns from gameplay, gets smarter at spotting abusers, and helps us maintain a competitive but honest battlefield.\nThis is the first real merge of Web2-style live gameplay with Web3 reward mechanics, and we’re doing it in a way that makes sense to real players. We want trust, transparency, and fun and Alith helps make that possible."
            }
        ]
    }
]